/* automatically generated by rust-bindgen */

#[repr(C)]
#[derive(Default)]
pub struct __IncompleteArrayField<T>(::std::marker::PhantomData<T>);
impl <T> __IncompleteArrayField<T> {
    #[inline]
    pub fn new() -> Self {
        __IncompleteArrayField(::std::marker::PhantomData)
    }
    #[inline]
    pub unsafe fn as_ptr(&self) -> *const T { ::std::mem::transmute(self) }
    #[inline]
    pub unsafe fn as_mut_ptr(&mut self) -> *mut T {
        ::std::mem::transmute(self)
    }
    #[inline]
    pub unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::std::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::std::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl <T> ::std::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
impl <T> ::std::clone::Clone for __IncompleteArrayField<T> {
    #[inline]
    fn clone(&self) -> Self { Self::new() }
}
impl <T> ::std::marker::Copy for __IncompleteArrayField<T> { }
#[repr(C)]
pub struct __BindgenUnionField<T>(::std::marker::PhantomData<T>);
impl <T> __BindgenUnionField<T> {
    #[inline]
    pub fn new() -> Self { __BindgenUnionField(::std::marker::PhantomData) }
    #[inline]
    pub unsafe fn as_ref(&self) -> &T { ::std::mem::transmute(self) }
    #[inline]

pub const MAX_SKIPLIST_DEPTH: ::std::os::raw::c_uint = 10;
pub const RTE_TM_ETH_FRAMING_OVERHEAD: ::std::os::raw::c_uint = 20;
pub const RTE_TM_ETH_FRAMING_OVERHEAD_FCS: ::std::os::raw::c_uint = 24;
pub const RTE_TM_WRED_PROFILE_ID_NONE: ::std::os::raw::c_uint = 4294967295;
pub const RTE_TM_SHAPER_PROFILE_ID_NONE: ::std::os::raw::c_uint = 4294967295;
pub const RTE_TM_NODE_ID_NULL: ::std::os::raw::c_uint = 4294967295;
pub const RTE_TM_NODE_LEVEL_ID_ANY: ::std::os::raw::c_uint = 4294967295;
pub const RTE_VER_PREFIX: &'static [u8; 5usize] = b"DPDK\x00";
pub const RTE_VER_YEAR: ::std::os::raw::c_uint = 17;
pub const RTE_VER_MONTH: ::std::os::raw::c_uint = 8;
pub const RTE_VER_MINOR: ::std::os::raw::c_uint = 0;
pub const RTE_VER_SUFFIX: &'static [u8; 1usize] = b"\x00";
pub const RTE_VER_RELEASE: ::std::os::raw::c_uint = 16;
pub type int_least8_t = ::std::os::raw::c_schar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_long;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = ::std::os::raw::c_long;
pub type uintmax_t = ::std::os::raw::c_ulong;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(::std::mem::size_of::<__fsid_t>() , 8usize , concat ! (
               "Size of: " , stringify ! ( __fsid_t ) ));
    assert_eq! (::std::mem::align_of::<__fsid_t>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( __fsid_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __fsid_t ) ) . __val as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __fsid_t ) , "::" ,
                stringify ! ( __val ) ));
}
impl Clone for __fsid_t {
    fn clone(&self) -> Self { *self }
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __qaddr_t = *mut __quad_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub __pad1: *mut ::std::os::raw::c_void,
    pub __pad2: *mut ::std::os::raw::c_void,
    pub __pad3: *mut ::std::os::raw::c_void,
    pub __pad4: *mut ::std::os::raw::c_void,
    pub __pad5: usize,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    assert_eq!(::std::mem::size_of::<_IO_FILE>() , 216usize , concat ! (
               "Size of: " , stringify ! ( _IO_FILE ) ));
    assert_eq! (::std::mem::align_of::<_IO_FILE>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( _IO_FILE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _flags as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_read_ptr as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_read_ptr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_read_end as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_read_end ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_read_base as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_read_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_write_base as * const
                _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_write_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_write_ptr as * const _
                as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_write_ptr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_write_end as * const _
                as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_write_end ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_buf_base as * const _
                as usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_buf_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_buf_end as * const _
                as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_buf_end ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_save_base as * const _
                as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_save_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_backup_base as * const
                _ as usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_backup_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_save_end as * const _
                as usize } , 88usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_save_end ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _markers as * const _ as
                usize } , 96usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _markers ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _chain as * const _ as
                usize } , 104usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _chain ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _fileno as * const _ as
                usize } , 112usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _fileno ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _flags2 as * const _ as
                usize } , 116usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _flags2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _old_offset as * const _
                as usize } , 120usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _old_offset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _cur_column as * const _
                as usize } , 128usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _cur_column ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _vtable_offset as * const
                _ as usize } , 130usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _vtable_offset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _shortbuf as * const _ as
                usize } , 131usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _shortbuf ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _lock as * const _ as
                usize } , 136usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _lock ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _offset as * const _ as
                usize } , 144usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _offset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . __pad1 as * const _ as
                usize } , 152usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( __pad1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . __pad2 as * const _ as
                usize } , 160usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( __pad2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . __pad3 as * const _ as
                usize } , 168usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( __pad3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . __pad4 as * const _ as
                usize } , 176usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( __pad4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . __pad5 as * const _ as
                usize } , 184usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( __pad5 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _mode as * const _ as
                usize } , 192usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _mode ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _unused2 as * const _ as
                usize } , 196usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _unused2 ) ));
}
impl Clone for _IO_FILE {
    fn clone(&self) -> Self { *self }
}
pub type FILE = _IO_FILE;
pub type __FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __mbstate_t__bindgen_ty_1 {
    pub __wch: __BindgenUnionField<::std::os::raw::c_uint>,
    pub __wchb: __BindgenUnionField<[::std::os::raw::c_char; 4usize]>,
    pub bindgen_union_field: u32,
}
#[test]
fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<__mbstate_t__bindgen_ty_1>() , 4usize ,
               concat ! (
               "Size of: " , stringify ! ( __mbstate_t__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<__mbstate_t__bindgen_ty_1>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( __mbstate_t__bindgen_ty_1 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __mbstate_t__bindgen_ty_1 ) ) . __wch as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                __mbstate_t__bindgen_ty_1 ) , "::" , stringify ! ( __wch ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __mbstate_t__bindgen_ty_1 ) ) . __wchb as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                __mbstate_t__bindgen_ty_1 ) , "::" , stringify ! ( __wchb )
                ));
}
impl Clone for __mbstate_t__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    assert_eq!(::std::mem::size_of::<__mbstate_t>() , 8usize , concat ! (
               "Size of: " , stringify ! ( __mbstate_t ) ));
    assert_eq! (::std::mem::align_of::<__mbstate_t>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( __mbstate_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __mbstate_t ) ) . __count as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __mbstate_t ) , "::" ,
                stringify ! ( __count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __mbstate_t ) ) . __value as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( __mbstate_t ) , "::" ,
                stringify ! ( __value ) ));
}
impl Clone for __mbstate_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos_t() {
    assert_eq!(::std::mem::size_of::<_G_fpos_t>() , 16usize , concat ! (
               "Size of: " , stringify ! ( _G_fpos_t ) ));
    assert_eq! (::std::mem::align_of::<_G_fpos_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( _G_fpos_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _G_fpos_t ) ) . __pos as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _G_fpos_t ) , "::" ,
                stringify ! ( __pos ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _G_fpos_t ) ) . __state as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _G_fpos_t ) , "::" ,
                stringify ! ( __state ) ));
}
impl Clone for _G_fpos_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos64_t() {
    assert_eq!(::std::mem::size_of::<_G_fpos64_t>() , 16usize , concat ! (
               "Size of: " , stringify ! ( _G_fpos64_t ) ));
    assert_eq! (::std::mem::align_of::<_G_fpos64_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( _G_fpos64_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _G_fpos64_t ) ) . __pos as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _G_fpos64_t ) , "::" ,
                stringify ! ( __pos ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _G_fpos64_t ) ) . __state as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _G_fpos64_t ) , "::" ,
                stringify ! ( __state ) ));
}
impl Clone for _G_fpos64_t {
    fn clone(&self) -> Self { *self }
}
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_jump_t {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct _IO_marker {
    pub _next: *mut _IO_marker,
    pub _sbuf: *mut _IO_FILE,
    pub _pos: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__IO_marker() {
    assert_eq!(::std::mem::size_of::<_IO_marker>() , 24usize , concat ! (
               "Size of: " , stringify ! ( _IO_marker ) ));
    assert_eq! (::std::mem::align_of::<_IO_marker>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( _IO_marker ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_marker ) ) . _next as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_marker ) , "::" ,
                stringify ! ( _next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_marker ) ) . _sbuf as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_marker ) , "::" ,
                stringify ! ( _sbuf ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_marker ) ) . _pos as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_marker ) , "::" ,
                stringify ! ( _pos ) ));
}
impl Clone for _IO_marker {
    fn clone(&self) -> Self { *self }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum __codecvt_result {
    __codecvt_ok = 0,
    __codecvt_partial = 1,
    __codecvt_error = 2,
    __codecvt_noconv = 3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE_plus {
    _unused: [u8; 0],
}
extern "C" {
    #[link_name = "_IO_2_1_stdin_"]
    pub static mut _IO_2_1_stdin_: _IO_FILE_plus;
}
extern "C" {
    #[link_name = "_IO_2_1_stdout_"]
    pub static mut _IO_2_1_stdout_: _IO_FILE_plus;
}
extern "C" {
    #[link_name = "_IO_2_1_stderr_"]
    pub static mut _IO_2_1_stderr_: _IO_FILE_plus;
}
pub type __io_read_fn =
    ::std::option::Option<unsafe extern "C" fn(__cookie:
                                                   *mut ::std::os::raw::c_void,
                                               __buf:
                                                   *mut ::std::os::raw::c_char,
                                               __nbytes: usize) -> __ssize_t>;
pub type __io_write_fn =
    ::std::option::Option<unsafe extern "C" fn(__cookie:
                                                   *mut ::std::os::raw::c_void,
                                               __buf:
                                                   *const ::std::os::raw::c_char,
                                               __n: usize) -> __ssize_t>;
pub type __io_seek_fn =
    ::std::option::Option<unsafe extern "C" fn(__cookie:
                                                   *mut ::std::os::raw::c_void,
                                               __pos: *mut __off64_t,
                                               __w: ::std::os::raw::c_int)
                              -> ::std::os::raw::c_int>;
pub type __io_close_fn =
    ::std::option::Option<unsafe extern "C" fn(__cookie:
                                                   *mut ::std::os::raw::c_void)
                              -> ::std::os::raw::c_int>;
extern "C" {
    pub fn __underflow(arg1: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __uflow(arg1: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __overflow(arg1: *mut _IO_FILE, arg2: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_getc(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_putc(__c: ::std::os::raw::c_int, __fp: *mut _IO_FILE)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_feof(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_ferror(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_peekc_locked(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_flockfile(arg1: *mut _IO_FILE);
}
extern "C" {
    pub fn _IO_funlockfile(arg1: *mut _IO_FILE);
}
extern "C" {
    pub fn _IO_ftrylockfile(arg1: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_vfscanf(arg1: *mut _IO_FILE,
                       arg2: *const ::std::os::raw::c_char,
                       arg3: *mut __va_list_tag,
                       arg4: *mut ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_vfprintf(arg1: *mut _IO_FILE,
                        arg2: *const ::std::os::raw::c_char,
                        arg3: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_padn(arg1: *mut _IO_FILE, arg2: ::std::os::raw::c_int,
                    arg3: __ssize_t) -> __ssize_t;
}
extern "C" {
    pub fn _IO_sgetn(arg1: *mut _IO_FILE, arg2: *mut ::std::os::raw::c_void,
                     arg3: usize) -> usize;
}
extern "C" {
    pub fn _IO_seekoff(arg1: *mut _IO_FILE, arg2: __off64_t,
                       arg3: ::std::os::raw::c_int,
                       arg4: ::std::os::raw::c_int) -> __off64_t;
}
extern "C" {
    pub fn _IO_seekpos(arg1: *mut _IO_FILE, arg2: __off64_t,
                       arg3: ::std::os::raw::c_int) -> __off64_t;
}
extern "C" {
    pub fn _IO_free_backup_area(arg1: *mut _IO_FILE);
}
pub type off_t = __off_t;
pub type fpos_t = _G_fpos_t;
extern "C" {
    #[link_name = "stdin"]
    pub static mut stdin: *mut _IO_FILE;
}
extern "C" {
    #[link_name = "stdout"]
    pub static mut stdout: *mut _IO_FILE;
}
extern "C" {
    #[link_name = "stderr"]
    pub static mut stderr: *mut _IO_FILE;
}
extern "C" {
    pub fn remove(__filename: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rename(__old: *const ::std::os::raw::c_char,
                  __new: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn renameat(__oldfd: ::std::os::raw::c_int,
                    __old: *const ::std::os::raw::c_char,
                    __newfd: ::std::os::raw::c_int,
                    __new: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(__s: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tmpnam_r(__s: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tempnam(__dir: *const ::std::os::raw::c_char,
                   __pfx: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fopen(__filename: *const ::std::os::raw::c_char,
                 __modes: *const ::std::os::raw::c_char) -> *mut FILE;
}
extern "C" {
    pub fn freopen(__filename: *const ::std::os::raw::c_char,
                   __modes: *const ::std::os::raw::c_char,
                   __stream: *mut FILE) -> *mut FILE;
}
extern "C" {
    pub fn fdopen(__fd: ::std::os::raw::c_int,
                  __modes: *const ::std::os::raw::c_char) -> *mut FILE;
}
extern "C" {
    pub fn fmemopen(__s: *mut ::std::os::raw::c_void, __len: usize,
                    __modes: *const ::std::os::raw::c_char) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(__bufloc: *mut *mut ::std::os::raw::c_char,
                          __sizeloc: *mut usize) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn setvbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char,
                   __modes: ::std::os::raw::c_int, __n: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char,
                     __size: usize);
}
extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
extern "C" {
    pub fn fprintf(__stream: *mut FILE,
                   __format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn printf(__format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sprintf(__s: *mut ::std::os::raw::c_char,
                   __format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfprintf(__s: *mut FILE, __format: *const ::std::os::raw::c_char,
                    __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vprintf(__format: *const ::std::os::raw::c_char,
                   __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsprintf(__s: *mut ::std::os::raw::c_char,
                    __format: *const ::std::os::raw::c_char,
                    __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snprintf(__s: *mut ::std::os::raw::c_char, __maxlen: usize,
                    __format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsnprintf(__s: *mut ::std::os::raw::c_char, __maxlen: usize,
                     __format: *const ::std::os::raw::c_char,
                     __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vdprintf(__fd: ::std::os::raw::c_int,
                    __fmt: *const ::std::os::raw::c_char,
                    __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dprintf(__fd: ::std::os::raw::c_int,
                   __fmt: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fscanf(__stream: *mut FILE,
                  __format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scanf(__format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sscanf(__s: *const ::std::os::raw::c_char,
                  __format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "__isoc99_fscanf"]
    pub fn fscanf1(__stream: *mut FILE,
                   __format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "__isoc99_scanf"]
    pub fn scanf1(__format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "__isoc99_sscanf"]
    pub fn sscanf1(__s: *const ::std::os::raw::c_char,
                   __format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfscanf(__s: *mut FILE, __format: *const ::std::os::raw::c_char,
                   __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vscanf(__format: *const ::std::os::raw::c_char,
                  __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsscanf(__s: *const ::std::os::raw::c_char,
                   __format: *const ::std::os::raw::c_char,
                   __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "__isoc99_vfscanf"]
    pub fn vfscanf1(__s: *mut FILE, __format: *const ::std::os::raw::c_char,
                    __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "__isoc99_vscanf"]
    pub fn vscanf1(__format: *const ::std::os::raw::c_char,
                   __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "__isoc99_vsscanf"]
    pub fn vsscanf1(__s: *const ::std::os::raw::c_char,
                    __format: *const ::std::os::raw::c_char,
                    __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc(__c: ::std::os::raw::c_int, __stream: *mut FILE)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc(__c: ::std::os::raw::c_int, __stream: *mut FILE)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar_unlocked(__c: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putw(__w: ::std::os::raw::c_int, __stream: *mut FILE)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgets(__s: *mut ::std::os::raw::c_char, __n: ::std::os::raw::c_int,
                 __stream: *mut FILE) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __getdelim(__lineptr: *mut *mut ::std::os::raw::c_char,
                      __n: *mut usize, __delimiter: ::std::os::raw::c_int,
                      __stream: *mut FILE) -> __ssize_t;
}
extern "C" {
    pub fn getdelim(__lineptr: *mut *mut ::std::os::raw::c_char,
                    __n: *mut usize, __delimiter: ::std::os::raw::c_int,
                    __stream: *mut FILE) -> __ssize_t;
}
extern "C" {
    pub fn getline(__lineptr: *mut *mut ::std::os::raw::c_char,
                   __n: *mut usize, __stream: *mut FILE) -> __ssize_t;
}
extern "C" {
    pub fn fputs(__s: *const ::std::os::raw::c_char, __stream: *mut FILE)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ungetc(__c: ::std::os::raw::c_int, __stream: *mut FILE)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread(__ptr: *mut ::std::os::raw::c_void, __size: usize,
                 __n: usize, __stream: *mut FILE) -> usize;
}
extern "C" {
    pub fn fwrite(__ptr: *const ::std::os::raw::c_void, __size: usize,
                  __n: usize, __s: *mut FILE) -> usize;
}
extern "C" {
    pub fn fread_unlocked(__ptr: *mut ::std::os::raw::c_void, __size: usize,
                          __n: usize, __stream: *mut FILE) -> usize;
}
extern "C" {
    pub fn fwrite_unlocked(__ptr: *const ::std::os::raw::c_void,
                           __size: usize, __n: usize, __stream: *mut FILE)
     -> usize;
}
extern "C" {
    pub fn fseek(__stream: *mut FILE, __off: ::std::os::raw::c_long,
                 __whence: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
extern "C" {
    pub fn fseeko(__stream: *mut FILE, __off: __off_t,
                  __whence: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
extern "C" {
    pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn perror(__s: *const ::std::os::raw::c_char);
}
extern "C" {
    #[link_name = "sys_nerr"]
    pub static mut sys_nerr: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "sys_errlist"]
    pub static mut sys_errlist: [*const ::std::os::raw::c_char; 0usize];
}
extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn popen(__command: *const ::std::os::raw::c_char,
                 __modes: *const ::std::os::raw::c_char) -> *mut FILE;
}
extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ctermid(__s: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type time_t = __time_t;
pub type clockid_t = __clockid_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = ::std::os::raw::c_uchar;
pub type u_int16_t = ::std::os::raw::c_ushort;
pub type u_int32_t = ::std::os::raw::c_uint;
pub type u_int64_t = ::std::os::raw::c_ulong;
pub type register_t = ::std::os::raw::c_long;
pub type __sig_atomic_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    assert_eq!(::std::mem::size_of::<__sigset_t>() , 128usize , concat ! (
               "Size of: " , stringify ! ( __sigset_t ) ));
    assert_eq! (::std::mem::align_of::<__sigset_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( __sigset_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __sigset_t ) ) . __val as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __sigset_t ) , "::" ,
                stringify ! ( __val ) ));
}
impl Clone for __sigset_t {
    fn clone(&self) -> Self { *self }
}
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(::std::mem::size_of::<timespec>() , 16usize , concat ! (
               "Size of: " , stringify ! ( timespec ) ));
    assert_eq! (::std::mem::align_of::<timespec>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( timespec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const timespec ) ) . tv_sec as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( timespec ) , "::" ,
                stringify ! ( tv_sec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const timespec ) ) . tv_nsec as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( timespec ) , "::" ,
                stringify ! ( tv_nsec ) ));
}
impl Clone for timespec {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    assert_eq!(::std::mem::size_of::<timeval>() , 16usize , concat ! (
               "Size of: " , stringify ! ( timeval ) ));
    assert_eq! (::std::mem::align_of::<timeval>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( timeval ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const timeval ) ) . tv_sec as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( timeval ) , "::" ,
                stringify ! ( tv_sec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const timeval ) ) . tv_usec as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( timeval ) , "::" ,
                stringify ! ( tv_usec ) ));
}
impl Clone for timeval {
    fn clone(&self) -> Self { *self }
}
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    assert_eq!(::std::mem::size_of::<fd_set>() , 128usize , concat ! (
               "Size of: " , stringify ! ( fd_set ) ));
    assert_eq! (::std::mem::align_of::<fd_set>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( fd_set ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const fd_set ) ) . __fds_bits as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( fd_set ) , "::" ,
                stringify ! ( __fds_bits ) ));
}
impl Clone for fd_set {
    fn clone(&self) -> Self { *self }
}
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(__nfds: ::std::os::raw::c_int, __readfds: *mut fd_set,
                  __writefds: *mut fd_set, __exceptfds: *mut fd_set,
                  __timeout: *mut timeval) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pselect(__nfds: ::std::os::raw::c_int, __readfds: *mut fd_set,
                   __writefds: *mut fd_set, __exceptfds: *mut fd_set,
                   __timeout: *const timespec, __sigmask: *const __sigset_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gnu_dev_major(__dev: ::std::os::raw::c_ulonglong)
     -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn gnu_dev_minor(__dev: ::std::os::raw::c_ulonglong)
     -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn gnu_dev_makedev(__major: ::std::os::raw::c_uint,
                           __minor: ::std::os::raw::c_uint)
     -> ::std::os::raw::c_ulonglong;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pthread_attr_t {
    pub __size: __BindgenUnionField<[::std::os::raw::c_char; 56usize]>,
    pub __align: __BindgenUnionField<::std::os::raw::c_long>,
    pub bindgen_union_field: [u64; 7usize],
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    assert_eq!(::std::mem::size_of::<pthread_attr_t>() , 56usize , concat ! (
               "Size of: " , stringify ! ( pthread_attr_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_attr_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( pthread_attr_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_attr_t ) ) . __size as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_attr_t ) , "::"
                , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_attr_t ) ) . __align as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_attr_t ) , "::"
                , stringify ! ( __align ) ));
}
impl Clone for pthread_attr_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    assert_eq!(::std::mem::size_of::<__pthread_internal_list>() , 16usize ,
               concat ! (
               "Size of: " , stringify ! ( __pthread_internal_list ) ));
    assert_eq! (::std::mem::align_of::<__pthread_internal_list>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( __pthread_internal_list ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_internal_list ) ) . __prev as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_internal_list
                ) , "::" , stringify ! ( __prev ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_internal_list ) ) . __next as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_internal_list
                ) , "::" , stringify ! ( __next ) ));
}
impl Clone for __pthread_internal_list {
    fn clone(&self) -> Self { *self }
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pthread_mutex_t {
    pub __data: __BindgenUnionField<pthread_mutex_t___pthread_mutex_s>,
    pub __size: __BindgenUnionField<[::std::os::raw::c_char; 40usize]>,
    pub __align: __BindgenUnionField<::std::os::raw::c_long>,
    pub bindgen_union_field: [u64; 5usize],
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pthread_mutex_t___pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout_pthread_mutex_t___pthread_mutex_s() {
    assert_eq!(::std::mem::size_of::<pthread_mutex_t___pthread_mutex_s>() ,
               40usize , concat ! (
               "Size of: " , stringify ! ( pthread_mutex_t___pthread_mutex_s )
               ));
    assert_eq! (::std::mem::align_of::<pthread_mutex_t___pthread_mutex_s>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __lock as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __lock ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __count as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __owner as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __owner ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __nusers as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __nusers ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __kind as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __kind ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __spins as * const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __spins ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __elision as * const _ as usize } , 22usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __elision ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __list as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __list ) ));
}
impl Clone for pthread_mutex_t___pthread_mutex_s {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    assert_eq!(::std::mem::size_of::<pthread_mutex_t>() , 40usize , concat ! (
               "Size of: " , stringify ! ( pthread_mutex_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_mutex_t>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( pthread_mutex_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t ) ) . __data as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_mutex_t ) ,
                "::" , stringify ! ( __data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t ) ) . __size as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_mutex_t ) ,
                "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t ) ) . __align as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_mutex_t ) ,
                "::" , stringify ! ( __align ) ));
}
impl Clone for pthread_mutex_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pthread_mutexattr_t {
    pub __size: __BindgenUnionField<[::std::os::raw::c_char; 4usize]>,
    pub __align: __BindgenUnionField<::std::os::raw::c_int>,
    pub bindgen_union_field: u32,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    assert_eq!(::std::mem::size_of::<pthread_mutexattr_t>() , 4usize , concat
               ! ( "Size of: " , stringify ! ( pthread_mutexattr_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_mutexattr_t>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( pthread_mutexattr_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutexattr_t ) ) . __size as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_mutexattr_t ) ,
                "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutexattr_t ) ) . __align as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_mutexattr_t ) ,
                "::" , stringify ! ( __align ) ));
}
impl Clone for pthread_mutexattr_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pthread_cond_t {
    pub __data: __BindgenUnionField<pthread_cond_t__bindgen_ty_1>,
    pub __size: __BindgenUnionField<[::std::os::raw::c_char; 48usize]>,
    pub __align: __BindgenUnionField<::std::os::raw::c_longlong>,
    pub bindgen_union_field: [u64; 6usize],
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pthread_cond_t__bindgen_ty_1 {
    pub __lock: ::std::os::raw::c_int,
    pub __futex: ::std::os::raw::c_uint,
    pub __total_seq: ::std::os::raw::c_ulonglong,
    pub __wakeup_seq: ::std::os::raw::c_ulonglong,
    pub __woken_seq: ::std::os::raw::c_ulonglong,
    pub __mutex: *mut ::std::os::raw::c_void,
    pub __nwaiters: ::std::os::raw::c_uint,
    pub __broadcast_seq: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_pthread_cond_t__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<pthread_cond_t__bindgen_ty_1>() , 48usize
               , concat ! (
               "Size of: " , stringify ! ( pthread_cond_t__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<pthread_cond_t__bindgen_ty_1>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! ( pthread_cond_t__bindgen_ty_1 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t__bindgen_ty_1 ) ) . __lock
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! ( __lock )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t__bindgen_ty_1 ) ) .
                __futex as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! ( __futex
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t__bindgen_ty_1 ) ) .
                __total_seq as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! (
                __total_seq ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t__bindgen_ty_1 ) ) .
                __wakeup_seq as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! (
                __wakeup_seq ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t__bindgen_ty_1 ) ) .
                __woken_seq as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! (
                __woken_seq ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t__bindgen_ty_1 ) ) .
                __mutex as * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! ( __mutex
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t__bindgen_ty_1 ) ) .
                __nwaiters as * const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! (
                __nwaiters ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t__bindgen_ty_1 ) ) .
                __broadcast_seq as * const _ as usize } , 44usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! (
                __broadcast_seq ) ));
}
impl Clone for pthread_cond_t__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    assert_eq!(::std::mem::size_of::<pthread_cond_t>() , 48usize , concat ! (
               "Size of: " , stringify ! ( pthread_cond_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_cond_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( pthread_cond_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t ) ) . __data as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_cond_t ) , "::"
                , stringify ! ( __data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t ) ) . __size as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_cond_t ) , "::"
                , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t ) ) . __align as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_cond_t ) , "::"
                , stringify ! ( __align ) ));
}
impl Clone for pthread_cond_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pthread_condattr_t {
    pub __size: __BindgenUnionField<[::std::os::raw::c_char; 4usize]>,
    pub __align: __BindgenUnionField<::std::os::raw::c_int>,
    pub bindgen_union_field: u32,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    assert_eq!(::std::mem::size_of::<pthread_condattr_t>() , 4usize , concat !
               ( "Size of: " , stringify ! ( pthread_condattr_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_condattr_t>() , 4usize , concat
                ! ( "Alignment of " , stringify ! ( pthread_condattr_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_condattr_t ) ) . __size as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_condattr_t ) ,
                "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_condattr_t ) ) . __align as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_condattr_t ) ,
                "::" , stringify ! ( __align ) ));
}
impl Clone for pthread_condattr_t {
    fn clone(&self) -> Self { *self }
}
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pthread_rwlock_t {
    pub __data: __BindgenUnionField<pthread_rwlock_t__bindgen_ty_1>,
    pub __size: __BindgenUnionField<[::std::os::raw::c_char; 56usize]>,
    pub __align: __BindgenUnionField<::std::os::raw::c_long>,
    pub bindgen_union_field: [u64; 7usize],
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pthread_rwlock_t__bindgen_ty_1 {
    pub __lock: ::std::os::raw::c_int,
    pub __nr_readers: ::std::os::raw::c_uint,
    pub __readers_wakeup: ::std::os::raw::c_uint,
    pub __writer_wakeup: ::std::os::raw::c_uint,
    pub __nr_readers_queued: ::std::os::raw::c_uint,
    pub __nr_writers_queued: ::std::os::raw::c_uint,
    pub __writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<pthread_rwlock_t__bindgen_ty_1>() ,
               56usize , concat ! (
               "Size of: " , stringify ! ( pthread_rwlock_t__bindgen_ty_1 )
               ));
    assert_eq! (::std::mem::align_of::<pthread_rwlock_t__bindgen_ty_1>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! ( pthread_rwlock_t__bindgen_ty_1
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __lock as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! ( __lock
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __nr_readers as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __nr_readers ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __readers_wakeup as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __readers_wakeup ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __writer_wakeup as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __writer_wakeup ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __nr_readers_queued as * const _ as usize } , 16usize , concat
                ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __nr_readers_queued ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __nr_writers_queued as * const _ as usize } , 20usize , concat
                ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __nr_writers_queued ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __writer as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __writer ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __shared as * const _ as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __shared ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __rwelision as * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __rwelision ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __pad1 as * const _ as usize } , 33usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! ( __pad1
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __pad2 as * const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! ( __pad2
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __flags as * const _ as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __flags ) ));
}
impl Clone for pthread_rwlock_t__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    assert_eq!(::std::mem::size_of::<pthread_rwlock_t>() , 56usize , concat !
               ( "Size of: " , stringify ! ( pthread_rwlock_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_rwlock_t>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( pthread_rwlock_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t ) ) . __data as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_rwlock_t ) ,
                "::" , stringify ! ( __data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t ) ) . __size as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_rwlock_t ) ,
                "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t ) ) . __align as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_rwlock_t ) ,
                "::" , stringify ! ( __align ) ));
}
impl Clone for pthread_rwlock_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pthread_rwlockattr_t {
    pub __size: __BindgenUnionField<[::std::os::raw::c_char; 8usize]>,
    pub __align: __BindgenUnionField<::std::os::raw::c_long>,
    pub bindgen_union_field: u64,
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    assert_eq!(::std::mem::size_of::<pthread_rwlockattr_t>() , 8usize , concat
               ! ( "Size of: " , stringify ! ( pthread_rwlockattr_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_rwlockattr_t>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( pthread_rwlockattr_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlockattr_t ) ) . __size as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_rwlockattr_t )
                , "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlockattr_t ) ) . __align as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_rwlockattr_t )
                , "::" , stringify ! ( __align ) ));
}
impl Clone for pthread_rwlockattr_t {
    fn clone(&self) -> Self { *self }
}
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pthread_barrier_t {
    pub __size: __BindgenUnionField<[::std::os::raw::c_char; 32usize]>,
    pub __align: __BindgenUnionField<::std::os::raw::c_long>,
    pub bindgen_union_field: [u64; 4usize],
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    assert_eq!(::std::mem::size_of::<pthread_barrier_t>() , 32usize , concat !
               ( "Size of: " , stringify ! ( pthread_barrier_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_barrier_t>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( pthread_barrier_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_barrier_t ) ) . __size as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_barrier_t ) ,
                "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_barrier_t ) ) . __align as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_barrier_t ) ,
                "::" , stringify ! ( __align ) ));
}
impl Clone for pthread_barrier_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pthread_barrierattr_t {
    pub __size: __BindgenUnionField<[::std::os::raw::c_char; 4usize]>,
    pub __align: __BindgenUnionField<::std::os::raw::c_int>,
    pub bindgen_union_field: u32,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    assert_eq!(::std::mem::size_of::<pthread_barrierattr_t>() , 4usize ,
               concat ! ( "Size of: " , stringify ! ( pthread_barrierattr_t )
               ));
    assert_eq! (::std::mem::align_of::<pthread_barrierattr_t>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( pthread_barrierattr_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_barrierattr_t ) ) . __size as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_barrierattr_t )
                , "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_barrierattr_t ) ) . __align as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_barrierattr_t )
                , "::" , stringify ! ( __align ) ));
}
impl Clone for pthread_barrierattr_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct iovec {
    pub iov_base: *mut ::std::os::raw::c_void,
    pub iov_len: usize,
}
#[test]
fn bindgen_test_layout_iovec() {
    assert_eq!(::std::mem::size_of::<iovec>() , 16usize , concat ! (
               "Size of: " , stringify ! ( iovec ) ));
    assert_eq! (::std::mem::align_of::<iovec>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( iovec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const iovec ) ) . iov_base as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( iovec ) , "::" ,
                stringify ! ( iov_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const iovec ) ) . iov_len as * const _ as usize
                } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( iovec ) , "::" ,
                stringify ! ( iov_len ) ));
}
impl Clone for iovec {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn readv(__fd: ::std::os::raw::c_int, __iovec: *const iovec,
                 __count: ::std::os::raw::c_int) -> isize;
}
extern "C" {
    pub fn writev(__fd: ::std::os::raw::c_int, __iovec: *const iovec,
                  __count: ::std::os::raw::c_int) -> isize;
}
extern "C" {
    pub fn preadv(__fd: ::std::os::raw::c_int, __iovec: *const iovec,
                  __count: ::std::os::raw::c_int, __offset: __off_t) -> isize;
}
extern "C" {
    pub fn pwritev(__fd: ::std::os::raw::c_int, __iovec: *const iovec,
                   __count: ::std::os::raw::c_int, __offset: __off_t)
     -> isize;
}
pub type socklen_t = __socklen_t;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum __socket_type {
    SOCK_STREAM = 1,
    SOCK_DGRAM = 2,
    SOCK_RAW = 3,
    SOCK_RDM = 4,
    SOCK_SEQPACKET = 5,
    SOCK_DCCP = 6,
    SOCK_PACKET = 10,
    SOCK_CLOEXEC = 524288,
    SOCK_NONBLOCK = 2048,
}
pub type sa_family_t = ::std::os::raw::c_ushort;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct sockaddr {
    pub sa_family: sa_family_t,
    pub sa_data: [::std::os::raw::c_char; 14usize],
}
#[test]
fn bindgen_test_layout_sockaddr() {
    assert_eq!(::std::mem::size_of::<sockaddr>() , 16usize , concat ! (
               "Size of: " , stringify ! ( sockaddr ) ));
    assert_eq! (::std::mem::align_of::<sockaddr>() , 2usize , concat ! (
                "Alignment of " , stringify ! ( sockaddr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sockaddr ) ) . sa_family as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( sockaddr ) , "::" ,
                stringify ! ( sa_family ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sockaddr ) ) . sa_data as * const _ as
                usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( sockaddr ) , "::" ,
                stringify ! ( sa_data ) ));
}
impl Clone for sockaddr {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
pub struct sockaddr_storage {
    pub ss_family: sa_family_t,
    pub __ss_padding: [::std::os::raw::c_char; 118usize],
    pub __ss_align: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout_sockaddr_storage() {
    assert_eq!(::std::mem::size_of::<sockaddr_storage>() , 128usize , concat !
               ( "Size of: " , stringify ! ( sockaddr_storage ) ));
    assert_eq! (::std::mem::align_of::<sockaddr_storage>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( sockaddr_storage ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sockaddr_storage ) ) . ss_family as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( sockaddr_storage ) ,
                "::" , stringify ! ( ss_family ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sockaddr_storage ) ) . __ss_padding as *
                const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( sockaddr_storage ) ,
                "::" , stringify ! ( __ss_padding ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sockaddr_storage ) ) . __ss_align as *
                const _ as usize } , 120usize , concat ! (
                "Alignment of field: " , stringify ! ( sockaddr_storage ) ,
                "::" , stringify ! ( __ss_align ) ));
}
pub const MSG_OOB: _bindgen_ty_1 = _bindgen_ty_1::MSG_OOB;
pub const MSG_PEEK: _bindgen_ty_1 = _bindgen_ty_1::MSG_PEEK;
pub const MSG_DONTROUTE: _bindgen_ty_1 = _bindgen_ty_1::MSG_DONTROUTE;
pub const MSG_CTRUNC: _bindgen_ty_1 = _bindgen_ty_1::MSG_CTRUNC;
pub const MSG_PROXY: _bindgen_ty_1 = _bindgen_ty_1::MSG_PROXY;
pub const MSG_TRUNC: _bindgen_ty_1 = _bindgen_ty_1::MSG_TRUNC;
pub const MSG_DONTWAIT: _bindgen_ty_1 = _bindgen_ty_1::MSG_DONTWAIT;
pub const MSG_EOR: _bindgen_ty_1 = _bindgen_ty_1::MSG_EOR;
pub const MSG_WAITALL: _bindgen_ty_1 = _bindgen_ty_1::MSG_WAITALL;
pub const MSG_FIN: _bindgen_ty_1 = _bindgen_ty_1::MSG_FIN;
pub const MSG_SYN: _bindgen_ty_1 = _bindgen_ty_1::MSG_SYN;
pub const MSG_CONFIRM: _bindgen_ty_1 = _bindgen_ty_1::MSG_CONFIRM;
pub const MSG_RST: _bindgen_ty_1 = _bindgen_ty_1::MSG_RST;
pub const MSG_ERRQUEUE: _bindgen_ty_1 = _bindgen_ty_1::MSG_ERRQUEUE;
pub const MSG_NOSIGNAL: _bindgen_ty_1 = _bindgen_ty_1::MSG_NOSIGNAL;
pub const MSG_MORE: _bindgen_ty_1 = _bindgen_ty_1::MSG_MORE;
pub const MSG_WAITFORONE: _bindgen_ty_1 = _bindgen_ty_1::MSG_WAITFORONE;
pub const MSG_FASTOPEN: _bindgen_ty_1 = _bindgen_ty_1::MSG_FASTOPEN;
pub const MSG_CMSG_CLOEXEC: _bindgen_ty_1 = _bindgen_ty_1::MSG_CMSG_CLOEXEC;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_1 {
    MSG_OOB = 1,
    MSG_PEEK = 2,
    MSG_DONTROUTE = 4,
    MSG_CTRUNC = 8,
    MSG_PROXY = 16,
    MSG_TRUNC = 32,
    MSG_DONTWAIT = 64,
    MSG_EOR = 128,
    MSG_WAITALL = 256,
    MSG_FIN = 512,
    MSG_SYN = 1024,
    MSG_CONFIRM = 2048,
    MSG_RST = 4096,
    MSG_ERRQUEUE = 8192,
    MSG_NOSIGNAL = 16384,
    MSG_MORE = 32768,
    MSG_WAITFORONE = 65536,
    MSG_FASTOPEN = 536870912,
    MSG_CMSG_CLOEXEC = 1073741824,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct msghdr {
    pub msg_name: *mut ::std::os::raw::c_void,
    pub msg_namelen: socklen_t,
    pub msg_iov: *mut iovec,
    pub msg_iovlen: usize,
    pub msg_control: *mut ::std::os::raw::c_void,
    pub msg_controllen: usize,
    pub msg_flags: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_msghdr() {
    assert_eq!(::std::mem::size_of::<msghdr>() , 56usize , concat ! (
               "Size of: " , stringify ! ( msghdr ) ));
    assert_eq! (::std::mem::align_of::<msghdr>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( msghdr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const msghdr ) ) . msg_name as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( msghdr ) , "::" ,
                stringify ! ( msg_name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const msghdr ) ) . msg_namelen as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( msghdr ) , "::" ,
                stringify ! ( msg_namelen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const msghdr ) ) . msg_iov as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( msghdr ) , "::" ,
                stringify ! ( msg_iov ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const msghdr ) ) . msg_iovlen as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( msghdr ) , "::" ,
                stringify ! ( msg_iovlen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const msghdr ) ) . msg_control as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( msghdr ) , "::" ,
                stringify ! ( msg_control ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const msghdr ) ) . msg_controllen as * const _
                as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( msghdr ) , "::" ,
                stringify ! ( msg_controllen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const msghdr ) ) . msg_flags as * const _ as
                usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( msghdr ) , "::" ,
                stringify ! ( msg_flags ) ));
}
impl Clone for msghdr {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct cmsghdr {
    pub cmsg_len: usize,
    pub cmsg_level: ::std::os::raw::c_int,
    pub cmsg_type: ::std::os::raw::c_int,
    pub __cmsg_data: __IncompleteArrayField<::std::os::raw::c_uchar>,
}
#[test]
fn bindgen_test_layout_cmsghdr() {
    assert_eq!(::std::mem::size_of::<cmsghdr>() , 16usize , concat ! (
               "Size of: " , stringify ! ( cmsghdr ) ));
    assert_eq! (::std::mem::align_of::<cmsghdr>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( cmsghdr ) ));
}
impl Clone for cmsghdr {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn __cmsg_nxthdr(__mhdr: *mut msghdr, __cmsg: *mut cmsghdr)
     -> *mut cmsghdr;
}
pub const SCM_RIGHTS: _bindgen_ty_2 = _bindgen_ty_2::SCM_RIGHTS;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_2 { SCM_RIGHTS = 1, }
#[repr(C)]
#[derive(Debug, Copy)]
pub struct linger {
    pub l_onoff: ::std::os::raw::c_int,
    pub l_linger: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_linger() {
    assert_eq!(::std::mem::size_of::<linger>() , 8usize , concat ! (
               "Size of: " , stringify ! ( linger ) ));
    assert_eq! (::std::mem::align_of::<linger>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( linger ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const linger ) ) . l_onoff as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( linger ) , "::" ,
                stringify ! ( l_onoff ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const linger ) ) . l_linger as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( linger ) , "::" ,
                stringify ! ( l_linger ) ));
}
impl Clone for linger {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct osockaddr {
    pub sa_family: ::std::os::raw::c_ushort,
    pub sa_data: [::std::os::raw::c_uchar; 14usize],
}
#[test]
fn bindgen_test_layout_osockaddr() {
    assert_eq!(::std::mem::size_of::<osockaddr>() , 16usize , concat ! (
               "Size of: " , stringify ! ( osockaddr ) ));
    assert_eq! (::std::mem::align_of::<osockaddr>() , 2usize , concat ! (
                "Alignment of " , stringify ! ( osockaddr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const osockaddr ) ) . sa_family as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( osockaddr ) , "::" ,
                stringify ! ( sa_family ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const osockaddr ) ) . sa_data as * const _ as
                usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( osockaddr ) , "::" ,
                stringify ! ( sa_data ) ));
}
impl Clone for osockaddr {
    fn clone(&self) -> Self { *self }
}
pub const SHUT_RD: _bindgen_ty_3 = _bindgen_ty_3::SHUT_RD;
pub const SHUT_WR: _bindgen_ty_3 = _bindgen_ty_3::SHUT_WR;
pub const SHUT_RDWR: _bindgen_ty_3 = _bindgen_ty_3::SHUT_RDWR;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_3 { SHUT_RD = 0, SHUT_WR = 1, SHUT_RDWR = 2, }
extern "C" {
    pub fn socket(__domain: ::std::os::raw::c_int,
                  __type: ::std::os::raw::c_int,
                  __protocol: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn socketpair(__domain: ::std::os::raw::c_int,
                      __type: ::std::os::raw::c_int,
                      __protocol: ::std::os::raw::c_int,
                      __fds: *mut ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bind(__fd: ::std::os::raw::c_int, __addr: *const sockaddr,
                __len: socklen_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getsockname(__fd: ::std::os::raw::c_int, __addr: *mut sockaddr,
                       __len: *mut socklen_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn connect(__fd: ::std::os::raw::c_int, __addr: *const sockaddr,
                   __len: socklen_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getpeername(__fd: ::std::os::raw::c_int, __addr: *mut sockaddr,
                       __len: *mut socklen_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn send(__fd: ::std::os::raw::c_int,
                __buf: *const ::std::os::raw::c_void, __n: usize,
                __flags: ::std::os::raw::c_int) -> isize;
}
extern "C" {
    pub fn recv(__fd: ::std::os::raw::c_int,
                __buf: *mut ::std::os::raw::c_void, __n: usize,
                __flags: ::std::os::raw::c_int) -> isize;
}
extern "C" {
    pub fn sendto(__fd: ::std::os::raw::c_int,
                  __buf: *const ::std::os::raw::c_void, __n: usize,
                  __flags: ::std::os::raw::c_int, __addr: *const sockaddr,
                  __addr_len: socklen_t) -> isize;
}
extern "C" {
    pub fn recvfrom(__fd: ::std::os::raw::c_int,
                    __buf: *mut ::std::os::raw::c_void, __n: usize,
                    __flags: ::std::os::raw::c_int, __addr: *mut sockaddr,
                    __addr_len: *mut socklen_t) -> isize;
}
extern "C" {
    pub fn sendmsg(__fd: ::std::os::raw::c_int, __message: *const msghdr,
                   __flags: ::std::os::raw::c_int) -> isize;
}
extern "C" {
    pub fn recvmsg(__fd: ::std::os::raw::c_int, __message: *mut msghdr,
                   __flags: ::std::os::raw::c_int) -> isize;
}
extern "C" {
    pub fn getsockopt(__fd: ::std::os::raw::c_int,
                      __level: ::std::os::raw::c_int,
                      __optname: ::std::os::raw::c_int,
                      __optval: *mut ::std::os::raw::c_void,
                      __optlen: *mut socklen_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setsockopt(__fd: ::std::os::raw::c_int,
                      __level: ::std::os::raw::c_int,
                      __optname: ::std::os::raw::c_int,
                      __optval: *const ::std::os::raw::c_void,
                      __optlen: socklen_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn listen(__fd: ::std::os::raw::c_int, __n: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn accept(__fd: ::std::os::raw::c_int, __addr: *mut sockaddr,
                  __addr_len: *mut socklen_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn shutdown(__fd: ::std::os::raw::c_int, __how: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sockatmark(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isfdtype(__fd: ::std::os::raw::c_int,
                    __fdtype: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
pub type in_addr_t = u32;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct in_addr {
    pub s_addr: in_addr_t,
}
#[test]
fn bindgen_test_layout_in_addr() {
    assert_eq!(::std::mem::size_of::<in_addr>() , 4usize , concat ! (
               "Size of: " , stringify ! ( in_addr ) ));
    assert_eq! (::std::mem::align_of::<in_addr>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( in_addr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const in_addr ) ) . s_addr as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( in_addr ) , "::" ,
                stringify ! ( s_addr ) ));
}
impl Clone for in_addr {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
pub struct ip_opts {
    pub ip_dst: in_addr,
    pub ip_opts: [::std::os::raw::c_char; 40usize],
}
#[test]
fn bindgen_test_layout_ip_opts() {
    assert_eq!(::std::mem::size_of::<ip_opts>() , 44usize , concat ! (
               "Size of: " , stringify ! ( ip_opts ) ));
    assert_eq! (::std::mem::align_of::<ip_opts>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( ip_opts ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ip_opts ) ) . ip_dst as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ip_opts ) , "::" ,
                stringify ! ( ip_dst ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ip_opts ) ) . ip_opts as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( ip_opts ) , "::" ,
                stringify ! ( ip_opts ) ));
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct ip_mreqn {
    pub imr_multiaddr: in_addr,
    pub imr_address: in_addr,
    pub imr_ifindex: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ip_mreqn() {
    assert_eq!(::std::mem::size_of::<ip_mreqn>() , 12usize , concat ! (
               "Size of: " , stringify ! ( ip_mreqn ) ));
    assert_eq! (::std::mem::align_of::<ip_mreqn>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( ip_mreqn ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ip_mreqn ) ) . imr_multiaddr as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ip_mreqn ) , "::" ,
                stringify ! ( imr_multiaddr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ip_mreqn ) ) . imr_address as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( ip_mreqn ) , "::" ,
                stringify ! ( imr_address ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ip_mreqn ) ) . imr_ifindex as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( ip_mreqn ) , "::" ,
                stringify ! ( imr_ifindex ) ));
}
impl Clone for ip_mreqn {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct in_pktinfo {
    pub ipi_ifindex: ::std::os::raw::c_int,
    pub ipi_spec_dst: in_addr,
    pub ipi_addr: in_addr,
}
#[test]
fn bindgen_test_layout_in_pktinfo() {
    assert_eq!(::std::mem::size_of::<in_pktinfo>() , 12usize , concat ! (
               "Size of: " , stringify ! ( in_pktinfo ) ));
    assert_eq! (::std::mem::align_of::<in_pktinfo>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( in_pktinfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const in_pktinfo ) ) . ipi_ifindex as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( in_pktinfo ) , "::" ,
                stringify ! ( ipi_ifindex ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const in_pktinfo ) ) . ipi_spec_dst as * const
                _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( in_pktinfo ) , "::" ,
                stringify ! ( ipi_spec_dst ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const in_pktinfo ) ) . ipi_addr as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( in_pktinfo ) , "::" ,
                stringify ! ( ipi_addr ) ));
}
impl Clone for in_pktinfo {
    fn clone(&self) -> Self { *self }
}
pub const IPPROTO_IP: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_IP;
pub const IPPROTO_ICMP: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_ICMP;
pub const IPPROTO_IGMP: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_IGMP;
pub const IPPROTO_IPIP: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_IPIP;
pub const IPPROTO_TCP: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_TCP;
pub const IPPROTO_EGP: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_EGP;
pub const IPPROTO_PUP: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_PUP;
pub const IPPROTO_UDP: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_UDP;
pub const IPPROTO_IDP: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_IDP;
pub const IPPROTO_TP: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_TP;
pub const IPPROTO_DCCP: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_DCCP;
pub const IPPROTO_IPV6: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_IPV6;
pub const IPPROTO_RSVP: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_RSVP;
pub const IPPROTO_GRE: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_GRE;
pub const IPPROTO_ESP: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_ESP;
pub const IPPROTO_AH: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_AH;
pub const IPPROTO_MTP: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_MTP;
pub const IPPROTO_BEETPH: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_BEETPH;
pub const IPPROTO_ENCAP: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_ENCAP;
pub const IPPROTO_PIM: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_PIM;
pub const IPPROTO_COMP: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_COMP;
pub const IPPROTO_SCTP: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_SCTP;
pub const IPPROTO_UDPLITE: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_UDPLITE;
pub const IPPROTO_MPLS: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_MPLS;
pub const IPPROTO_RAW: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_RAW;
pub const IPPROTO_MAX: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_MAX;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_4 {
    IPPROTO_IP = 0,
    IPPROTO_ICMP = 1,
    IPPROTO_IGMP = 2,
    IPPROTO_IPIP = 4,
    IPPROTO_TCP = 6,
    IPPROTO_EGP = 8,
    IPPROTO_PUP = 12,
    IPPROTO_UDP = 17,
    IPPROTO_IDP = 22,
    IPPROTO_TP = 29,
    IPPROTO_DCCP = 33,
    IPPROTO_IPV6 = 41,
    IPPROTO_RSVP = 46,
    IPPROTO_GRE = 47,
    IPPROTO_ESP = 50,
    IPPROTO_AH = 51,
    IPPROTO_MTP = 92,
    IPPROTO_BEETPH = 94,
    IPPROTO_ENCAP = 98,
    IPPROTO_PIM = 103,
    IPPROTO_COMP = 108,
    IPPROTO_SCTP = 132,
    IPPROTO_UDPLITE = 136,
    IPPROTO_MPLS = 137,
    IPPROTO_RAW = 255,
    IPPROTO_MAX = 256,
}
pub const IPPROTO_HOPOPTS: _bindgen_ty_5 = _bindgen_ty_5::IPPROTO_HOPOPTS;
pub const IPPROTO_ROUTING: _bindgen_ty_5 = _bindgen_ty_5::IPPROTO_ROUTING;
pub const IPPROTO_FRAGMENT: _bindgen_ty_5 = _bindgen_ty_5::IPPROTO_FRAGMENT;
pub const IPPROTO_ICMPV6: _bindgen_ty_5 = _bindgen_ty_5::IPPROTO_ICMPV6;
pub const IPPROTO_NONE: _bindgen_ty_5 = _bindgen_ty_5::IPPROTO_NONE;
pub const IPPROTO_DSTOPTS: _bindgen_ty_5 = _bindgen_ty_5::IPPROTO_DSTOPTS;
pub const IPPROTO_MH: _bindgen_ty_5 = _bindgen_ty_5::IPPROTO_MH;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_5 {
    IPPROTO_HOPOPTS = 0,
    IPPROTO_ROUTING = 43,
    IPPROTO_FRAGMENT = 44,
    IPPROTO_ICMPV6 = 58,
    IPPROTO_NONE = 59,
    IPPROTO_DSTOPTS = 60,
    IPPROTO_MH = 135,
}
pub type in_port_t = u16;
pub const IPPORT_ECHO: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_ECHO;
pub const IPPORT_DISCARD: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_DISCARD;
pub const IPPORT_SYSTAT: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_SYSTAT;
pub const IPPORT_DAYTIME: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_DAYTIME;
pub const IPPORT_NETSTAT: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_NETSTAT;
pub const IPPORT_FTP: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_FTP;
pub const IPPORT_TELNET: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_TELNET;
pub const IPPORT_SMTP: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_SMTP;
pub const IPPORT_TIMESERVER: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_TIMESERVER;
pub const IPPORT_NAMESERVER: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_NAMESERVER;
pub const IPPORT_WHOIS: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_WHOIS;
pub const IPPORT_MTP: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_MTP;
pub const IPPORT_TFTP: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_TFTP;
pub const IPPORT_RJE: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_RJE;
pub const IPPORT_FINGER: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_FINGER;
pub const IPPORT_TTYLINK: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_TTYLINK;
pub const IPPORT_SUPDUP: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_SUPDUP;
pub const IPPORT_EXECSERVER: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_EXECSERVER;
pub const IPPORT_LOGINSERVER: _bindgen_ty_6 =
    _bindgen_ty_6::IPPORT_LOGINSERVER;
pub const IPPORT_CMDSERVER: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_CMDSERVER;
pub const IPPORT_EFSSERVER: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_EFSSERVER;
pub const IPPORT_BIFFUDP: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_EXECSERVER;
pub const IPPORT_WHOSERVER: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_LOGINSERVER;
pub const IPPORT_ROUTESERVER: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_EFSSERVER;
pub const IPPORT_RESERVED: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_RESERVED;
pub const IPPORT_USERRESERVED: _bindgen_ty_6 =
    _bindgen_ty_6::IPPORT_USERRESERVED;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_6 {
    IPPORT_ECHO = 7,
    IPPORT_DISCARD = 9,
    IPPORT_SYSTAT = 11,
    IPPORT_DAYTIME = 13,
    IPPORT_NETSTAT = 15,
    IPPORT_FTP = 21,
    IPPORT_TELNET = 23,
    IPPORT_SMTP = 25,
    IPPORT_TIMESERVER = 37,
    IPPORT_NAMESERVER = 42,
    IPPORT_WHOIS = 43,
    IPPORT_MTP = 57,
    IPPORT_TFTP = 69,
    IPPORT_RJE = 77,
    IPPORT_FINGER = 79,
    IPPORT_TTYLINK = 87,
    IPPORT_SUPDUP = 95,
    IPPORT_EXECSERVER = 512,
    IPPORT_LOGINSERVER = 513,
    IPPORT_CMDSERVER = 514,
    IPPORT_EFSSERVER = 520,
    IPPORT_RESERVED = 1024,
    IPPORT_USERRESERVED = 5000,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct in6_addr {
    pub __in6_u: in6_addr__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct in6_addr__bindgen_ty_1 {
    pub __u6_addr8: __BindgenUnionField<[u8; 16usize]>,
    pub __u6_addr16: __BindgenUnionField<[u16; 8usize]>,
    pub __u6_addr32: __BindgenUnionField<[u32; 4usize]>,
    pub bindgen_union_field: [u32; 4usize],
}
#[test]
fn bindgen_test_layout_in6_addr__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<in6_addr__bindgen_ty_1>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( in6_addr__bindgen_ty_1 )
               ));
    assert_eq! (::std::mem::align_of::<in6_addr__bindgen_ty_1>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( in6_addr__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const in6_addr__bindgen_ty_1 ) ) . __u6_addr8
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( in6_addr__bindgen_ty_1
                ) , "::" , stringify ! ( __u6_addr8 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const in6_addr__bindgen_ty_1 ) ) . __u6_addr16
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( in6_addr__bindgen_ty_1
                ) , "::" , stringify ! ( __u6_addr16 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const in6_addr__bindgen_ty_1 ) ) . __u6_addr32
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( in6_addr__bindgen_ty_1
                ) , "::" , stringify ! ( __u6_addr32 ) ));
}
impl Clone for in6_addr__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_in6_addr() {
    assert_eq!(::std::mem::size_of::<in6_addr>() , 16usize , concat ! (
               "Size of: " , stringify ! ( in6_addr ) ));
    assert_eq! (::std::mem::align_of::<in6_addr>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( in6_addr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const in6_addr ) ) . __in6_u as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( in6_addr ) , "::" ,
                stringify ! ( __in6_u ) ));
}
impl Clone for in6_addr {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    #[link_name = "in6addr_any"]
    pub static in6addr_any: in6_addr;
}
extern "C" {
    #[link_name = "in6addr_loopback"]
    pub static in6addr_loopback: in6_addr;
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct sockaddr_in {
    pub sin_family: sa_family_t,
    pub sin_port: in_port_t,
    pub sin_addr: in_addr,
    pub sin_zero: [::std::os::raw::c_uchar; 8usize],
}
#[test]
fn bindgen_test_layout_sockaddr_in() {
    assert_eq!(::std::mem::size_of::<sockaddr_in>() , 16usize , concat ! (
               "Size of: " , stringify ! ( sockaddr_in ) ));
    assert_eq! (::std::mem::align_of::<sockaddr_in>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( sockaddr_in ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sockaddr_in ) ) . sin_family as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( sockaddr_in ) , "::" ,
                stringify ! ( sin_family ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sockaddr_in ) ) . sin_port as * const _
                as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( sockaddr_in ) , "::" ,
                stringify ! ( sin_port ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sockaddr_in ) ) . sin_addr as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( sockaddr_in ) , "::" ,
                stringify ! ( sin_addr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sockaddr_in ) ) . sin_zero as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( sockaddr_in ) , "::" ,
                stringify ! ( sin_zero ) ));
}
impl Clone for sockaddr_in {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct sockaddr_in6 {
    pub sin6_family: sa_family_t,
    pub sin6_port: in_port_t,
    pub sin6_flowinfo: u32,
    pub sin6_addr: in6_addr,
    pub sin6_scope_id: u32,
}
#[test]
fn bindgen_test_layout_sockaddr_in6() {
    assert_eq!(::std::mem::size_of::<sockaddr_in6>() , 28usize , concat ! (
               "Size of: " , stringify ! ( sockaddr_in6 ) ));
    assert_eq! (::std::mem::align_of::<sockaddr_in6>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( sockaddr_in6 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sockaddr_in6 ) ) . sin6_family as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( sockaddr_in6 ) , "::" ,
                stringify ! ( sin6_family ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sockaddr_in6 ) ) . sin6_port as * const _
                as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( sockaddr_in6 ) , "::" ,
                stringify ! ( sin6_port ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sockaddr_in6 ) ) . sin6_flowinfo as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( sockaddr_in6 ) , "::" ,
                stringify ! ( sin6_flowinfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sockaddr_in6 ) ) . sin6_addr as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( sockaddr_in6 ) , "::" ,
                stringify ! ( sin6_addr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sockaddr_in6 ) ) . sin6_scope_id as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( sockaddr_in6 ) , "::" ,
                stringify ! ( sin6_scope_id ) ));
}
impl Clone for sockaddr_in6 {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct ip_mreq {
    pub imr_multiaddr: in_addr,
    pub imr_interface: in_addr,
}
#[test]
fn bindgen_test_layout_ip_mreq() {
    assert_eq!(::std::mem::size_of::<ip_mreq>() , 8usize , concat ! (
               "Size of: " , stringify ! ( ip_mreq ) ));
    assert_eq! (::std::mem::align_of::<ip_mreq>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( ip_mreq ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ip_mreq ) ) . imr_multiaddr as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ip_mreq ) , "::" ,
                stringify ! ( imr_multiaddr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ip_mreq ) ) . imr_interface as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( ip_mreq ) , "::" ,
                stringify ! ( imr_interface ) ));
}
impl Clone for ip_mreq {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct ip_mreq_source {
    pub imr_multiaddr: in_addr,
    pub imr_interface: in_addr,
    pub imr_sourceaddr: in_addr,
}
#[test]
fn bindgen_test_layout_ip_mreq_source() {
    assert_eq!(::std::mem::size_of::<ip_mreq_source>() , 12usize , concat ! (
               "Size of: " , stringify ! ( ip_mreq_source ) ));
    assert_eq! (::std::mem::align_of::<ip_mreq_source>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( ip_mreq_source ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ip_mreq_source ) ) . imr_multiaddr as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ip_mreq_source ) , "::"
                , stringify ! ( imr_multiaddr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ip_mreq_source ) ) . imr_interface as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( ip_mreq_source ) , "::"
                , stringify ! ( imr_interface ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ip_mreq_source ) ) . imr_sourceaddr as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( ip_mreq_source ) , "::"
                , stringify ! ( imr_sourceaddr ) ));
}
impl Clone for ip_mreq_source {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct ipv6_mreq {
    pub ipv6mr_multiaddr: in6_addr,
    pub ipv6mr_interface: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_ipv6_mreq() {
    assert_eq!(::std::mem::size_of::<ipv6_mreq>() , 20usize , concat ! (
               "Size of: " , stringify ! ( ipv6_mreq ) ));
    assert_eq! (::std::mem::align_of::<ipv6_mreq>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( ipv6_mreq ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ipv6_mreq ) ) . ipv6mr_multiaddr as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ipv6_mreq ) , "::" ,
                stringify ! ( ipv6mr_multiaddr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ipv6_mreq ) ) . ipv6mr_interface as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( ipv6_mreq ) , "::" ,
                stringify ! ( ipv6mr_interface ) ));
}
impl Clone for ipv6_mreq {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
pub struct group_req {
    pub gr_interface: u32,
    pub gr_group: sockaddr_storage,
}
#[test]
fn bindgen_test_layout_group_req() {
    assert_eq!(::std::mem::size_of::<group_req>() , 136usize , concat ! (
               "Size of: " , stringify ! ( group_req ) ));
    assert_eq! (::std::mem::align_of::<group_req>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( group_req ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const group_req ) ) . gr_interface as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( group_req ) , "::" ,
                stringify ! ( gr_interface ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const group_req ) ) . gr_group as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( group_req ) , "::" ,
                stringify ! ( gr_group ) ));
}
#[repr(C)]
pub struct group_source_req {
    pub gsr_interface: u32,
    pub gsr_group: sockaddr_storage,
    pub gsr_source: sockaddr_storage,
}
#[test]
fn bindgen_test_layout_group_source_req() {
    assert_eq!(::std::mem::size_of::<group_source_req>() , 264usize , concat !
               ( "Size of: " , stringify ! ( group_source_req ) ));
    assert_eq! (::std::mem::align_of::<group_source_req>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( group_source_req ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const group_source_req ) ) . gsr_interface as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( group_source_req ) ,
                "::" , stringify ! ( gsr_interface ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const group_source_req ) ) . gsr_group as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( group_source_req ) ,
                "::" , stringify ! ( gsr_group ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const group_source_req ) ) . gsr_source as *
                const _ as usize } , 136usize , concat ! (
                "Alignment of field: " , stringify ! ( group_source_req ) ,
                "::" , stringify ! ( gsr_source ) ));
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct ip_msfilter {
    pub imsf_multiaddr: in_addr,
    pub imsf_interface: in_addr,
    pub imsf_fmode: u32,
    pub imsf_numsrc: u32,
    pub imsf_slist: [in_addr; 1usize],
}
#[test]
fn bindgen_test_layout_ip_msfilter() {
    assert_eq!(::std::mem::size_of::<ip_msfilter>() , 20usize , concat ! (
               "Size of: " , stringify ! ( ip_msfilter ) ));
    assert_eq! (::std::mem::align_of::<ip_msfilter>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( ip_msfilter ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ip_msfilter ) ) . imsf_multiaddr as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ip_msfilter ) , "::" ,
                stringify ! ( imsf_multiaddr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ip_msfilter ) ) . imsf_interface as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( ip_msfilter ) , "::" ,
                stringify ! ( imsf_interface ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ip_msfilter ) ) . imsf_fmode as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( ip_msfilter ) , "::" ,
                stringify ! ( imsf_fmode ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ip_msfilter ) ) . imsf_numsrc as * const
                _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( ip_msfilter ) , "::" ,
                stringify ! ( imsf_numsrc ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ip_msfilter ) ) . imsf_slist as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( ip_msfilter ) , "::" ,
                stringify ! ( imsf_slist ) ));
}
impl Clone for ip_msfilter {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
pub struct group_filter {
    pub gf_interface: u32,
    pub gf_group: sockaddr_storage,
    pub gf_fmode: u32,
    pub gf_numsrc: u32,
    pub gf_slist: [sockaddr_storage; 1usize],
}
#[test]
fn bindgen_test_layout_group_filter() {
    assert_eq!(::std::mem::size_of::<group_filter>() , 272usize , concat ! (
               "Size of: " , stringify ! ( group_filter ) ));
    assert_eq! (::std::mem::align_of::<group_filter>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( group_filter ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const group_filter ) ) . gf_interface as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( group_filter ) , "::" ,
                stringify ! ( gf_interface ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const group_filter ) ) . gf_group as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( group_filter ) , "::" ,
                stringify ! ( gf_group ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const group_filter ) ) . gf_fmode as * const _
                as usize } , 136usize , concat ! (
                "Alignment of field: " , stringify ! ( group_filter ) , "::" ,
                stringify ! ( gf_fmode ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const group_filter ) ) . gf_numsrc as * const _
                as usize } , 140usize , concat ! (
                "Alignment of field: " , stringify ! ( group_filter ) , "::" ,
                stringify ! ( gf_numsrc ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const group_filter ) ) . gf_slist as * const _
                as usize } , 144usize , concat ! (
                "Alignment of field: " , stringify ! ( group_filter ) , "::" ,
                stringify ! ( gf_slist ) ));
}
extern "C" {
    pub fn ntohl(__netlong: u32) -> u32;
}
extern "C" {
    pub fn ntohs(__netshort: u16) -> u16;
}
extern "C" {
    pub fn htonl(__hostlong: u32) -> u32;
}
extern "C" {
    pub fn htons(__hostshort: u16) -> u16;
}
extern "C" {
    pub fn bindresvport(__sockfd: ::std::os::raw::c_int,
                        __sock_in: *mut sockaddr_in) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bindresvport6(__sockfd: ::std::os::raw::c_int,
                         __sock_in: *mut sockaddr_in6)
     -> ::std::os::raw::c_int;
}
pub type cc_t = ::std::os::raw::c_uchar;
pub type speed_t = ::std::os::raw::c_uint;
pub type tcflag_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct termios {
    pub c_iflag: tcflag_t,
    pub c_oflag: tcflag_t,
    pub c_cflag: tcflag_t,
    pub c_lflag: tcflag_t,
    pub c_line: cc_t,
    pub c_cc: [cc_t; 32usize],
    pub c_ispeed: speed_t,
    pub c_ospeed: speed_t,
}
#[test]
fn bindgen_test_layout_termios() {
    assert_eq!(::std::mem::size_of::<termios>() , 60usize , concat ! (
               "Size of: " , stringify ! ( termios ) ));
    assert_eq! (::std::mem::align_of::<termios>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( termios ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const termios ) ) . c_iflag as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( termios ) , "::" ,
                stringify ! ( c_iflag ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const termios ) ) . c_oflag as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( termios ) , "::" ,
                stringify ! ( c_oflag ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const termios ) ) . c_cflag as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( termios ) , "::" ,
                stringify ! ( c_cflag ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const termios ) ) . c_lflag as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( termios ) , "::" ,
                stringify ! ( c_lflag ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const termios ) ) . c_line as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( termios ) , "::" ,
                stringify ! ( c_line ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const termios ) ) . c_cc as * const _ as usize
                } , 17usize , concat ! (
                "Alignment of field: " , stringify ! ( termios ) , "::" ,
                stringify ! ( c_cc ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const termios ) ) . c_ispeed as * const _ as
                usize } , 52usize , concat ! (
                "Alignment of field: " , stringify ! ( termios ) , "::" ,
                stringify ! ( c_ispeed ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const termios ) ) . c_ospeed as * const _ as
                usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( termios ) , "::" ,
                stringify ! ( c_ospeed ) ));
}
impl Clone for termios {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn cfgetospeed(__termios_p: *const termios) -> speed_t;
}
extern "C" {
    pub fn cfgetispeed(__termios_p: *const termios) -> speed_t;
}
extern "C" {
    pub fn cfsetospeed(__termios_p: *mut termios, __speed: speed_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cfsetispeed(__termios_p: *mut termios, __speed: speed_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cfsetspeed(__termios_p: *mut termios, __speed: speed_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tcgetattr(__fd: ::std::os::raw::c_int, __termios_p: *mut termios)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tcsetattr(__fd: ::std::os::raw::c_int,
                     __optional_actions: ::std::os::raw::c_int,
                     __termios_p: *const termios) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cfmakeraw(__termios_p: *mut termios);
}
extern "C" {
    pub fn tcsendbreak(__fd: ::std::os::raw::c_int,
                       __duration: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tcdrain(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tcflush(__fd: ::std::os::raw::c_int,
                   __queue_selector: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tcflow(__fd: ::std::os::raw::c_int,
                  __action: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tcgetsid(__fd: ::std::os::raw::c_int) -> __pid_t;
}
/// This structure is the header of a cirbuf type.
#[repr(C)]
#[derive(Debug, Copy)]
pub struct cirbuf {
    /// < total len of the fifo (number of elements)
    pub maxlen: ::std::os::raw::c_uint,
    /// < indice of the first elt
    pub start: ::std::os::raw::c_uint,
    /// < indice of the last elt
    pub end: ::std::os::raw::c_uint,
    /// < current len of fifo
    pub len: ::std::os::raw::c_uint,
    pub buf: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_cirbuf() {
    assert_eq!(::std::mem::size_of::<cirbuf>() , 24usize , concat ! (
               "Size of: " , stringify ! ( cirbuf ) ));
    assert_eq! (::std::mem::align_of::<cirbuf>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( cirbuf ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cirbuf ) ) . maxlen as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( cirbuf ) , "::" ,
                stringify ! ( maxlen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cirbuf ) ) . start as * const _ as usize
                } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( cirbuf ) , "::" ,
                stringify ! ( start ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cirbuf ) ) . end as * const _ as usize }
                , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( cirbuf ) , "::" ,
                stringify ! ( end ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cirbuf ) ) . len as * const _ as usize }
                , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( cirbuf ) , "::" ,
                stringify ! ( len ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cirbuf ) ) . buf as * const _ as usize }
                , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( cirbuf ) , "::" ,
                stringify ! ( buf ) ));
}
impl Clone for cirbuf {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    /// Init the circular buffer
    pub fn cirbuf_init(cbuf: *mut cirbuf, buf: *mut ::std::os::raw::c_char,
                       start: ::std::os::raw::c_uint,
                       maxlen: ::std::os::raw::c_uint)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /// Add a character at head of the circular buffer. Return 0 on success, or
/// a negative value on error.
    pub fn cirbuf_add_head_safe(cbuf: *mut cirbuf, c: ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /// Add a character at head of the circular buffer. You _must_ check that you
/// have enough free space in the buffer before calling this func.
    pub fn cirbuf_add_head(cbuf: *mut cirbuf, c: ::std::os::raw::c_char);
}
extern "C" {
    /// Add a character at tail of the circular buffer. Return 0 on success, or
/// a negative value on error.
    pub fn cirbuf_add_tail_safe(cbuf: *mut cirbuf, c: ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /// Add a character at tail of the circular buffer. You _must_ check that you
/// have enough free space in the buffer before calling this func.
    pub fn cirbuf_add_tail(cbuf: *mut cirbuf, c: ::std::os::raw::c_char);
}
extern "C" {
    /// Remove a char at the head of the circular buffer. Return 0 on
/// success, or a negative value on error.
    pub fn cirbuf_del_head_safe(cbuf: *mut cirbuf) -> ::std::os::raw::c_int;
}
extern "C" {
    /// Remove a char at the head of the circular buffer. You _must_ check
/// that buffer is not empty before calling the function.
    pub fn cirbuf_del_head(cbuf: *mut cirbuf);
}
extern "C" {
    /// Remove a char at the tail of the circular buffer. Return 0 on
/// success, or a negative value on error.
    pub fn cirbuf_del_tail_safe(cbuf: *mut cirbuf) -> ::std::os::raw::c_int;
}
extern "C" {
    /// Remove a char at the tail of the circular buffer. You _must_ check
/// that buffer is not empty before calling the function.
    pub fn cirbuf_del_tail(cbuf: *mut cirbuf);
}
extern "C" {
    /// Return the head of the circular buffer. You _must_ check that
/// buffer is not empty before calling the function.
    pub fn cirbuf_get_head(cbuf: *mut cirbuf) -> ::std::os::raw::c_char;
}
extern "C" {
    /// Return the tail of the circular buffer. You _must_ check that
/// buffer is not empty before calling the function.
    pub fn cirbuf_get_tail(cbuf: *mut cirbuf) -> ::std::os::raw::c_char;
}
extern "C" {
    /// Add a buffer at head of the circular buffer. 'c' is a pointer to a
/// buffer, and n is the number of char to add. Return the number of
/// copied bytes on success, or a negative value on error.
    pub fn cirbuf_add_buf_head(cbuf: *mut cirbuf,
                               c: *const ::std::os::raw::c_char,
                               n: ::std::os::raw::c_uint)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /// Add a buffer at tail of the circular buffer. 'c' is a pointer to a
/// buffer, and n is the number of char to add. Return the number of
/// copied bytes on success, or a negative value on error.
    pub fn cirbuf_add_buf_tail(cbuf: *mut cirbuf,
                               c: *const ::std::os::raw::c_char,
                               n: ::std::os::raw::c_uint)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /// Remove chars at the head of the circular buffer. Return 0 on
/// success, or a negative value on error.
    pub fn cirbuf_del_buf_head(cbuf: *mut cirbuf,
                               size: ::std::os::raw::c_uint)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /// Remove chars at the tail of the circular buffer. Return 0 on
/// success, or a negative value on error.
    pub fn cirbuf_del_buf_tail(cbuf: *mut cirbuf,
                               size: ::std::os::raw::c_uint)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /// Copy a maximum of 'size' characters from the head of the circular
/// buffer to a flat one pointed by 'c'. Return the number of copied
/// chars.
    pub fn cirbuf_get_buf_head(cbuf: *mut cirbuf,
                               c: *mut ::std::os::raw::c_char,
                               size: ::std::os::raw::c_uint)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /// Copy a maximum of 'size' characters from the tail of the circular
/// buffer to a flat one pointed by 'c'. Return the number of copied
/// chars.
    pub fn cirbuf_get_buf_tail(cbuf: *mut cirbuf,
                               c: *mut ::std::os::raw::c_char,
                               size: ::std::os::raw::c_uint)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /// Set the start of the data to the index 0 of the internal buffer.
    pub fn cirbuf_align_left(cbuf: *mut cirbuf) -> ::std::os::raw::c_int;
}
extern "C" {
    /// Set the end of the data to the last index of the internal buffer.
    pub fn cirbuf_align_right(cbuf: *mut cirbuf) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "cmdline_vt100_commands"]
    pub static mut cmdline_vt100_commands:
               [*const ::std::os::raw::c_char; 0usize];
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum cmdline_vt100_parser_state {
    CMDLINE_VT100_INIT = 0,
    CMDLINE_VT100_ESCAPE = 1,
    CMDLINE_VT100_ESCAPE_CSI = 2,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct cmdline_vt100 {
    pub bufpos: u8,
    pub buf: [::std::os::raw::c_char; 8usize],
    pub state: cmdline_vt100_parser_state,
}
#[test]
fn bindgen_test_layout_cmdline_vt100() {
    assert_eq!(::std::mem::size_of::<cmdline_vt100>() , 16usize , concat ! (
               "Size of: " , stringify ! ( cmdline_vt100 ) ));
    assert_eq! (::std::mem::align_of::<cmdline_vt100>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( cmdline_vt100 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmdline_vt100 ) ) . bufpos as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( cmdline_vt100 ) , "::"
                , stringify ! ( bufpos ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmdline_vt100 ) ) . buf as * const _ as
                usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! ( cmdline_vt100 ) , "::"
                , stringify ! ( buf ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmdline_vt100 ) ) . state as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( cmdline_vt100 ) , "::"
                , stringify ! ( state ) ));
}
impl Clone for cmdline_vt100 {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    /// Init
    pub fn vt100_init(vt: *mut cmdline_vt100);
}
extern "C" {
    /// Input a new character.
/// Return -1 if the character is not part of a control sequence
/// Return -2 if c is not the last char of a control sequence
/// Else return the index in vt100_commands[]
    pub fn vt100_parser(vt: *mut cmdline_vt100, c: ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum rdline_status {
    RDLINE_INIT = 0,
    RDLINE_RUNNING = 1,
    RDLINE_EXITED = 2,
}
#[repr(C)]
pub struct rdline {
    pub status: rdline_status,
    pub left: cirbuf,
    pub right: cirbuf,
    pub left_buf: [::std::os::raw::c_char; 514usize],
    pub right_buf: [::std::os::raw::c_char; 512usize],
    pub prompt: [::std::os::raw::c_char; 32usize],
    pub prompt_size: ::std::os::raw::c_uint,
    pub kill_buf: [::std::os::raw::c_char; 512usize],
    pub kill_size: ::std::os::raw::c_uint,
    pub history: cirbuf,
    pub history_buf: [::std::os::raw::c_char; 8192usize],
    pub history_cur_line: ::std::os::raw::c_int,
    pub write_char: rdline_write_char_t,
    pub validate: rdline_validate_t,
    pub complete: rdline_complete_t,
    pub vt100: cmdline_vt100,
    pub opaque: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_rdline() {
    assert_eq!(::std::mem::size_of::<rdline>() , 9912usize , concat ! (
               "Size of: " , stringify ! ( rdline ) ));
    assert_eq! (::std::mem::align_of::<rdline>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( rdline ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rdline ) ) . status as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rdline ) , "::" ,
                stringify ! ( status ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rdline ) ) . left as * const _ as usize }
                , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( rdline ) , "::" ,
                stringify ! ( left ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rdline ) ) . right as * const _ as usize
                } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( rdline ) , "::" ,
                stringify ! ( right ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rdline ) ) . left_buf as * const _ as
                usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( rdline ) , "::" ,
                stringify ! ( left_buf ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rdline ) ) . right_buf as * const _ as
                usize } , 570usize , concat ! (
                "Alignment of field: " , stringify ! ( rdline ) , "::" ,
                stringify ! ( right_buf ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rdline ) ) . prompt as * const _ as usize
                } , 1082usize , concat ! (
                "Alignment of field: " , stringify ! ( rdline ) , "::" ,
                stringify ! ( prompt ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rdline ) ) . prompt_size as * const _ as
                usize } , 1116usize , concat ! (
                "Alignment of field: " , stringify ! ( rdline ) , "::" ,
                stringify ! ( prompt_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rdline ) ) . kill_buf as * const _ as
                usize } , 1120usize , concat ! (
                "Alignment of field: " , stringify ! ( rdline ) , "::" ,
                stringify ! ( kill_buf ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rdline ) ) . kill_size as * const _ as
                usize } , 1632usize , concat ! (
                "Alignment of field: " , stringify ! ( rdline ) , "::" ,
                stringify ! ( kill_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rdline ) ) . history as * const _ as
                usize } , 1640usize , concat ! (
                "Alignment of field: " , stringify ! ( rdline ) , "::" ,
                stringify ! ( history ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rdline ) ) . history_buf as * const _ as
                usize } , 1664usize , concat ! (
                "Alignment of field: " , stringify ! ( rdline ) , "::" ,
                stringify ! ( history_buf ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rdline ) ) . history_cur_line as * const
                _ as usize } , 9856usize , concat ! (
                "Alignment of field: " , stringify ! ( rdline ) , "::" ,
                stringify ! ( history_cur_line ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rdline ) ) . write_char as * const _ as
                usize } , 9864usize , concat ! (
                "Alignment of field: " , stringify ! ( rdline ) , "::" ,
                stringify ! ( write_char ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rdline ) ) . validate as * const _ as
                usize } , 9872usize , concat ! (
                "Alignment of field: " , stringify ! ( rdline ) , "::" ,
                stringify ! ( validate ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rdline ) ) . complete as * const _ as
                usize } , 9880usize , concat ! (
                "Alignment of field: " , stringify ! ( rdline ) , "::" ,
                stringify ! ( complete ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rdline ) ) . vt100 as * const _ as usize
                } , 9888usize , concat ! (
                "Alignment of field: " , stringify ! ( rdline ) , "::" ,
                stringify ! ( vt100 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rdline ) ) . opaque as * const _ as usize
                } , 9904usize , concat ! (
                "Alignment of field: " , stringify ! ( rdline ) , "::" ,
                stringify ! ( opaque ) ));
}
pub type rdline_write_char_t =
    ::std::option::Option<unsafe extern "C" fn(rdl: *mut rdline,
                                               arg1: ::std::os::raw::c_char)
                              -> ::std::os::raw::c_int>;
pub type rdline_validate_t =
    ::std::option::Option<unsafe extern "C" fn(rdl: *mut rdline,
                                               buf:
                                                   *const ::std::os::raw::c_char,
                                               size: ::std::os::raw::c_uint)>;
pub type rdline_complete_t =
    ::std::option::Option<unsafe extern "C" fn(rdl: *mut rdline,
                                               buf:
                                                   *const ::std::os::raw::c_char,
                                               dstbuf:
                                                   *mut ::std::os::raw::c_char,
                                               dstsize:
                                                   ::std::os::raw::c_uint,
                                               state:
                                                   *mut ::std::os::raw::c_int)
                              -> ::std::os::raw::c_int>;
extern "C" {
    /// Init fields for a struct rdline. Call this only once at the beginning
/// of your program.
/// \param rdl A pointer to an uninitialized struct rdline
/// \param write_char The function used by the function to write a character
/// \param validate A pointer to the function to execute when the
/// user validates the buffer.
/// \param complete A pointer to the function to execute when the
/// user completes the buffer.
    pub fn rdline_init(rdl: *mut rdline, write_char: rdline_write_char_t,
                       validate: rdline_validate_t,
                       complete: rdline_complete_t) -> ::std::os::raw::c_int;
}
extern "C" {
    /// Init the current buffer, and display a prompt.
/// \param rdl A pointer to a struct rdline
/// \param prompt A string containing the prompt
    pub fn rdline_newline(rdl: *mut rdline,
                          prompt: *const ::std::os::raw::c_char);
}
extern "C" {
    /// Call it and all received chars will be ignored.
/// \param rdl A pointer to a struct rdline
    pub fn rdline_stop(rdl: *mut rdline);
}
extern "C" {
    /// Same than rdline_stop() except that next calls to rdline_char_in()
/// will return RDLINE_RES_EXITED.
/// \param rdl A pointer to a struct rdline
    pub fn rdline_quit(rdl: *mut rdline);
}
extern "C" {
    /// Restart after a call to rdline_stop() or rdline_quit()
/// \param rdl A pointer to a struct rdline
    pub fn rdline_restart(rdl: *mut rdline);
}
extern "C" {
    /// Redisplay the current buffer
/// \param rdl A pointer to a struct rdline
    pub fn rdline_redisplay(rdl: *mut rdline);
}
extern "C" {
    /// Reset the current buffer and setup for a new line.
/// \param rdl A pointer to a struct rdline
    pub fn rdline_reset(rdl: *mut rdline);
}
extern "C" {
    /// append a char to the readline buffer.
/// Return RDLINE_RES_VALIDATE when the line has been validated.
/// Return RDLINE_RES_COMPLETE when the user asked to complete the buffer.
/// Return RDLINE_RES_NOT_RUNNING if it is not running.
/// Return RDLINE_RES_EOF if EOF (ctrl-d on an empty line).
/// Else return RDLINE_RES_SUCCESS.
/// XXX error case when the buffer is full ?
///
/// \param rdl A pointer to a struct rdline
/// \param c The character to append
    pub fn rdline_char_in(rdl: *mut rdline, c: ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /// Return the current buffer, terminated by '\0'.
/// \param rdl A pointer to a struct rdline
    pub fn rdline_get_buffer(rdl: *mut rdline)
     -> *const ::std::os::raw::c_char;
}
extern "C" {
    /// Add the buffer to history.
/// return < 0 on error.
/// \param rdl A pointer to a struct rdline
/// \param buf A buffer that is terminated by '\0'
    pub fn rdline_add_history(rdl: *mut rdline,
                              buf: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /// Clear current history
/// \param rdl A pointer to a struct rdline
    pub fn rdline_clear_history(rdl: *mut rdline);
}
extern "C" {
    /// Get the i-th history item
    pub fn rdline_get_history_item(rdl: *mut rdline,
                                   i: ::std::os::raw::c_uint)
     -> *mut ::std::os::raw::c_char;
}
/// Stores a pointer to the ops struct, and the offset: the place to
/// write the parsed result in the destination structure.
#[repr(C)]
#[derive(Debug, Copy)]
pub struct cmdline_token_hdr {
    pub ops: *mut cmdline_token_ops,
    pub offset: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_cmdline_token_hdr() {
    assert_eq!(::std::mem::size_of::<cmdline_token_hdr>() , 16usize , concat !
               ( "Size of: " , stringify ! ( cmdline_token_hdr ) ));
    assert_eq! (::std::mem::align_of::<cmdline_token_hdr>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( cmdline_token_hdr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmdline_token_hdr ) ) . ops as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( cmdline_token_hdr ) ,
                "::" , stringify ! ( ops ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmdline_token_hdr ) ) . offset as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( cmdline_token_hdr ) ,
                "::" , stringify ! ( offset ) ));
}
impl Clone for cmdline_token_hdr {
    fn clone(&self) -> Self { *self }
}
pub type cmdline_parse_token_hdr_t = cmdline_token_hdr;
/// A token is defined by this structure.
///
/// parse() takes the token as first argument, then the source buffer
/// starting at the token we want to parse. The 3rd arg is a pointer
/// where we store the parsed data (as binary). It returns the number of
/// parsed chars on success and a negative value on error.
///
/// complete_get_nb() returns the number of possible values for this
/// token if completion is possible. If it is NULL or if it returns 0,
/// no completion is possible.
///
/// complete_get_elt() copy in dstbuf (the size is specified in the
/// parameter) the i-th possible completion for this token.  returns 0
/// on success or and a negative value on error.
///
/// get_help() fills the dstbuf with the help for the token. It returns
/// -1 on error and 0 on success.
#[repr(C)]
#[derive(Debug, Copy)]
pub struct cmdline_token_ops {
    /// parse(token ptr, buf, res pts, buf len)
    pub parse: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                              *mut cmdline_parse_token_hdr_t,
                                                          arg2:
                                                              *const ::std::os::raw::c_char,
                                                          arg3:
                                                              *mut ::std::os::raw::c_void,
                                                          arg4:
                                                              ::std::os::raw::c_uint)
                                         -> ::std::os::raw::c_int>,
    /// return the num of possible choices for this token
    pub complete_get_nb: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                        *mut cmdline_parse_token_hdr_t)
                                                   -> ::std::os::raw::c_int>,
    /// return the elt x for this token (token, idx, dstbuf, size)
    pub complete_get_elt: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                         *mut cmdline_parse_token_hdr_t,
                                                                     arg2:
                                                                         ::std::os::raw::c_int,
                                                                     arg3:
                                                                         *mut ::std::os::raw::c_char,
                                                                     arg4:
                                                                         ::std::os::raw::c_uint)
                                                    -> ::std::os::raw::c_int>,
    /// get help for this token (token, dstbuf, size)
    pub get_help: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                 *mut cmdline_parse_token_hdr_t,
                                                             arg2:
                                                                 *mut ::std::os::raw::c_char,
                                                             arg3:
                                                                 ::std::os::raw::c_uint)
                                            -> ::std::os::raw::c_int>,
}
#[test]
fn bindgen_test_layout_cmdline_token_ops() {
    assert_eq!(::std::mem::size_of::<cmdline_token_ops>() , 32usize , concat !
               ( "Size of: " , stringify ! ( cmdline_token_ops ) ));
    assert_eq! (::std::mem::align_of::<cmdline_token_ops>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( cmdline_token_ops ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmdline_token_ops ) ) . parse as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( cmdline_token_ops ) ,
                "::" , stringify ! ( parse ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmdline_token_ops ) ) . complete_get_nb
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( cmdline_token_ops ) ,
                "::" , stringify ! ( complete_get_nb ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmdline_token_ops ) ) . complete_get_elt
                as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( cmdline_token_ops ) ,
                "::" , stringify ! ( complete_get_elt ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmdline_token_ops ) ) . get_help as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( cmdline_token_ops ) ,
                "::" , stringify ! ( get_help ) ));
}
impl Clone for cmdline_token_ops {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
pub struct cmdline {
    pub s_in: ::std::os::raw::c_int,
    pub s_out: ::std::os::raw::c_int,
    pub ctx: *mut cmdline_parse_ctx_t,
    pub rdl: rdline,
    pub prompt: [::std::os::raw::c_char; 32usize],
    pub oldterm: termios,
}
#[test]
fn bindgen_test_layout_cmdline() {
    assert_eq!(::std::mem::size_of::<cmdline>() , 10024usize , concat ! (
               "Size of: " , stringify ! ( cmdline ) ));
    assert_eq! (::std::mem::align_of::<cmdline>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( cmdline ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmdline ) ) . s_in as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( cmdline ) , "::" ,
                stringify ! ( s_in ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmdline ) ) . s_out as * const _ as usize
                } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( cmdline ) , "::" ,
                stringify ! ( s_out ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmdline ) ) . ctx as * const _ as usize }
                , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( cmdline ) , "::" ,
                stringify ! ( ctx ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmdline ) ) . rdl as * const _ as usize }
                , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( cmdline ) , "::" ,
                stringify ! ( rdl ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmdline ) ) . prompt as * const _ as
                usize } , 9928usize , concat ! (
                "Alignment of field: " , stringify ! ( cmdline ) , "::" ,
                stringify ! ( prompt ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmdline ) ) . oldterm as * const _ as
                usize } , 9960usize , concat ! (
                "Alignment of field: " , stringify ! ( cmdline ) , "::" ,
                stringify ! ( oldterm ) ));
}
/// Store a instruction, which is a pointer to a callback function and
/// its parameter that is called when the instruction is parsed, a help
/// string, and a list of token composing this instruction.
///
/// When no tokens are defined (tokens[0] == NULL), they are retrieved
/// dynamically by calling f() as follows:
///
/// @code
///
/// f((struct cmdline_token_hdr **)&token_p,
/// NULL,
/// (struct cmdline_token_hdr **)&inst->tokens[num]);
///
/// @endcode
///
/// The address of the resulting token is expected at the location pointed by
/// the first argument. Can be set to NULL to end the list.
///
/// The cmdline argument (struct cmdline *) is always NULL.
///
/// The last argument points to the inst->tokens[] entry to retrieve, which
/// is not necessarily inside allocated memory and should neither be read nor
/// written. Its sole purpose is to deduce the token entry index of interest
/// as described in the example below.
///
/// Note about constraints:
///
/// - Only the address of these tokens is dynamic, their storage should be
/// static like normal tokens.
/// - Dynamic token lists that need to maintain an internal context (e.g. in
/// order to determine the next token) must store it statically also. This
/// context must be reinitialized when the first token is requested, that
/// is, when &inst->tokens[0] is provided as the third argument.
/// - Dynamic token lists must be NULL-terminated to generate usable
/// commands.
///
/// @code
///
/// // Assuming first and third arguments are respectively named "token_p"
/// // and "token":
///
/// int index = token - inst->tokens;
///
/// if (!index) {
/// [...] // Clean up internal context if any.
/// }
/// [...] // Then set up dyn_token according to index.
///
/// if (no_more_tokens)
/// *token_p = NULL;
/// else
/// *token_p = &dyn_token;
///
/// @endcode
#[repr(C)]
#[derive(Debug, Copy)]
pub struct cmdline_inst {
    pub f: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                          *mut ::std::os::raw::c_void,
                                                      arg2: *mut cmdline,
                                                      arg3:
                                                          *mut ::std::os::raw::c_void)>,
    pub data: *mut ::std::os::raw::c_void,
    pub help_str: *const ::std::os::raw::c_char,
    pub tokens: __IncompleteArrayField<*mut cmdline_parse_token_hdr_t>,
}
#[test]
fn bindgen_test_layout_cmdline_inst() {
    assert_eq!(::std::mem::size_of::<cmdline_inst>() , 24usize , concat ! (
               "Size of: " , stringify ! ( cmdline_inst ) ));
    assert_eq! (::std::mem::align_of::<cmdline_inst>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( cmdline_inst ) ));
}
impl Clone for cmdline_inst {
    fn clone(&self) -> Self { *self }
}
pub type cmdline_parse_inst_t = cmdline_inst;
/// A context is identified by its name, and contains a list of
/// instruction
///
pub type cmdline_parse_ctx_t = *mut cmdline_parse_inst_t;
extern "C" {
    /// Try to parse a buffer according to the specified context. The
/// argument buf must ends with "\n\0". The function returns
/// CMDLINE_PARSE_AMBIGUOUS, CMDLINE_PARSE_NOMATCH or
/// CMDLINE_PARSE_BAD_ARGS on error. Else it calls the associated
/// function (defined in the context) and returns 0
/// (CMDLINE_PARSE_SUCCESS).
    pub fn cmdline_parse(cl: *mut cmdline, buf: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /// complete() must be called with *state==0 (try to complete) or
/// with *state==-1 (just display choices), then called without
/// modifying *state until it returns CMDLINE_PARSE_COMPLETED_BUFFER or
/// CMDLINE_PARSE_COMPLETED_BUFFER.
///
/// It returns < 0 on error.
///
/// Else it returns:
/// - CMDLINE_PARSE_COMPLETED_BUFFER on completion (one possible
/// choice). In this case, the chars are appended in dst buffer.
/// - CMDLINE_PARSE_COMPLETE_AGAIN if there is several possible
/// choices. In this case, you must call the function again,
/// keeping the value of state intact.
/// - CMDLINE_PARSE_COMPLETED_BUFFER when the iteration is
/// finished. The dst is not valid for this last call.
///
/// The returned dst buf ends with \0.
    pub fn cmdline_complete(cl: *mut cmdline,
                            buf: *const ::std::os::raw::c_char,
                            state: *mut ::std::os::raw::c_int,
                            dst: *mut ::std::os::raw::c_char,
                            size: ::std::os::raw::c_uint)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cmdline_isendoftoken(c: ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cmdline_isendofcommand(c: ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cmdline_new(ctx: *mut cmdline_parse_ctx_t,
                       prompt: *const ::std::os::raw::c_char,
                       s_in: ::std::os::raw::c_int,
                       s_out: ::std::os::raw::c_int) -> *mut cmdline;
}
extern "C" {
    pub fn cmdline_set_prompt(cl: *mut cmdline,
                              prompt: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn cmdline_free(cl: *mut cmdline);
}
extern "C" {
    pub fn cmdline_printf(cl: *const cmdline,
                          fmt: *const ::std::os::raw::c_char, ...);
}
extern "C" {
    pub fn cmdline_in(cl: *mut cmdline, buf: *const ::std::os::raw::c_char,
                      size: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cmdline_write_char(rdl: *mut rdline, c: ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /// This function is nonblocking equivalent of ``cmdline_interact()``. It polls
/// *cl* for one character and interpret it. If return value is *RDLINE_EXITED*
/// it mean that ``cmdline_quit()`` was invoked.
///
/// @param cl
/// The command line object.
///
/// @return
/// On success return object status - one of *enum rdline_status*.
/// On error return negative value.
    pub fn cmdline_poll(cl: *mut cmdline) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cmdline_interact(cl: *mut cmdline);
}
extern "C" {
    pub fn cmdline_quit(cl: *mut cmdline);
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct cmdline_token_etheraddr {
    pub hdr: cmdline_token_hdr,
}
#[test]
fn bindgen_test_layout_cmdline_token_etheraddr() {
    assert_eq!(::std::mem::size_of::<cmdline_token_etheraddr>() , 16usize ,
               concat ! (
               "Size of: " , stringify ! ( cmdline_token_etheraddr ) ));
    assert_eq! (::std::mem::align_of::<cmdline_token_etheraddr>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( cmdline_token_etheraddr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmdline_token_etheraddr ) ) . hdr as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( cmdline_token_etheraddr
                ) , "::" , stringify ! ( hdr ) ));
}
impl Clone for cmdline_token_etheraddr {
    fn clone(&self) -> Self { *self }
}
pub type cmdline_parse_token_etheraddr_t = cmdline_token_etheraddr;
extern "C" {
    #[link_name = "cmdline_token_etheraddr_ops"]
    pub static mut cmdline_token_etheraddr_ops: cmdline_token_ops;
}
extern "C" {
    pub fn cmdline_parse_etheraddr(tk: *mut cmdline_parse_token_hdr_t,
                                   srcbuf: *const ::std::os::raw::c_char,
                                   res: *mut ::std::os::raw::c_void,
                                   ressize: ::std::os::raw::c_uint)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cmdline_get_help_etheraddr(tk: *mut cmdline_parse_token_hdr_t,
                                      dstbuf: *mut ::std::os::raw::c_char,
                                      size: ::std::os::raw::c_uint)
     -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct cmdline_ipaddr {
    pub family: u8,
    pub addr: cmdline_ipaddr__bindgen_ty_1,
    pub prefixlen: ::std::os::raw::c_uint,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct cmdline_ipaddr__bindgen_ty_1 {
    pub ipv4: __BindgenUnionField<in_addr>,
    pub ipv6: __BindgenUnionField<in6_addr>,
    pub bindgen_union_field: [u32; 4usize],
}
#[test]
fn bindgen_test_layout_cmdline_ipaddr__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<cmdline_ipaddr__bindgen_ty_1>() , 16usize
               , concat ! (
               "Size of: " , stringify ! ( cmdline_ipaddr__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<cmdline_ipaddr__bindgen_ty_1>() ,
                4usize , concat ! (
                "Alignment of " , stringify ! ( cmdline_ipaddr__bindgen_ty_1 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmdline_ipaddr__bindgen_ty_1 ) ) . ipv4
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                cmdline_ipaddr__bindgen_ty_1 ) , "::" , stringify ! ( ipv4 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmdline_ipaddr__bindgen_ty_1 ) ) . ipv6
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                cmdline_ipaddr__bindgen_ty_1 ) , "::" , stringify ! ( ipv6 )
                ));
}
impl Clone for cmdline_ipaddr__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_cmdline_ipaddr() {
    assert_eq!(::std::mem::size_of::<cmdline_ipaddr>() , 24usize , concat ! (
               "Size of: " , stringify ! ( cmdline_ipaddr ) ));
    assert_eq! (::std::mem::align_of::<cmdline_ipaddr>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( cmdline_ipaddr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmdline_ipaddr ) ) . family as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( cmdline_ipaddr ) , "::"
                , stringify ! ( family ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmdline_ipaddr ) ) . addr as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( cmdline_ipaddr ) , "::"
                , stringify ! ( addr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmdline_ipaddr ) ) . prefixlen as * const
                _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( cmdline_ipaddr ) , "::"
                , stringify ! ( prefixlen ) ));
}
impl Clone for cmdline_ipaddr {
    fn clone(&self) -> Self { *self }
}
pub type cmdline_ipaddr_t = cmdline_ipaddr;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct cmdline_token_ipaddr_data {
    pub flags: u8,
}
#[test]
fn bindgen_test_layout_cmdline_token_ipaddr_data() {
    assert_eq!(::std::mem::size_of::<cmdline_token_ipaddr_data>() , 1usize ,
               concat ! (
               "Size of: " , stringify ! ( cmdline_token_ipaddr_data ) ));
    assert_eq! (::std::mem::align_of::<cmdline_token_ipaddr_data>() , 1usize ,
                concat ! (
                "Alignment of " , stringify ! ( cmdline_token_ipaddr_data )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmdline_token_ipaddr_data ) ) . flags as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                cmdline_token_ipaddr_data ) , "::" , stringify ! ( flags ) ));
}
impl Clone for cmdline_token_ipaddr_data {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct cmdline_token_ipaddr {
    pub hdr: cmdline_token_hdr,
    pub ipaddr_data: cmdline_token_ipaddr_data,
}
#[test]
fn bindgen_test_layout_cmdline_token_ipaddr() {
    assert_eq!(::std::mem::size_of::<cmdline_token_ipaddr>() , 24usize ,
               concat ! ( "Size of: " , stringify ! ( cmdline_token_ipaddr )
               ));
    assert_eq! (::std::mem::align_of::<cmdline_token_ipaddr>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( cmdline_token_ipaddr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmdline_token_ipaddr ) ) . hdr as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( cmdline_token_ipaddr )
                , "::" , stringify ! ( hdr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmdline_token_ipaddr ) ) . ipaddr_data as
                * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( cmdline_token_ipaddr )
                , "::" , stringify ! ( ipaddr_data ) ));
}
impl Clone for cmdline_token_ipaddr {
    fn clone(&self) -> Self { *self }
}
pub type cmdline_parse_token_ipaddr_t = cmdline_token_ipaddr;
extern "C" {
    #[link_name = "cmdline_token_ipaddr_ops"]
    pub static mut cmdline_token_ipaddr_ops: cmdline_token_ops;
}
extern "C" {
    pub fn cmdline_parse_ipaddr(tk: *mut cmdline_parse_token_hdr_t,
                                srcbuf: *const ::std::os::raw::c_char,
                                res: *mut ::std::os::raw::c_void,
                                ressize: ::std::os::raw::c_uint)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cmdline_get_help_ipaddr(tk: *mut cmdline_parse_token_hdr_t,
                                   dstbuf: *mut ::std::os::raw::c_char,
                                   size: ::std::os::raw::c_uint)
     -> ::std::os::raw::c_int;
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum cmdline_numtype {
    UINT8 = 0,
    UINT16 = 1,
    UINT32 = 2,
    UINT64 = 3,
    INT8 = 4,
    INT16 = 5,
    INT32 = 6,
    INT64 = 7,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct cmdline_token_num_data {
    pub type_: cmdline_numtype,
}
#[test]
fn bindgen_test_layout_cmdline_token_num_data() {
    assert_eq!(::std::mem::size_of::<cmdline_token_num_data>() , 4usize ,
               concat ! ( "Size of: " , stringify ! ( cmdline_token_num_data )
               ));
    assert_eq! (::std::mem::align_of::<cmdline_token_num_data>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( cmdline_token_num_data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmdline_token_num_data ) ) . type_ as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( cmdline_token_num_data
                ) , "::" , stringify ! ( type_ ) ));
}
impl Clone for cmdline_token_num_data {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct cmdline_token_num {
    pub hdr: cmdline_token_hdr,
    pub num_data: cmdline_token_num_data,
}
#[test]
fn bindgen_test_layout_cmdline_token_num() {
    assert_eq!(::std::mem::size_of::<cmdline_token_num>() , 24usize , concat !
               ( "Size of: " , stringify ! ( cmdline_token_num ) ));
    assert_eq! (::std::mem::align_of::<cmdline_token_num>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( cmdline_token_num ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmdline_token_num ) ) . hdr as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( cmdline_token_num ) ,
                "::" , stringify ! ( hdr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmdline_token_num ) ) . num_data as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( cmdline_token_num ) ,
                "::" , stringify ! ( num_data ) ));
}
impl Clone for cmdline_token_num {
    fn clone(&self) -> Self { *self }
}
pub type cmdline_parse_token_num_t = cmdline_token_num;
extern "C" {
    #[link_name = "cmdline_token_num_ops"]
    pub static mut cmdline_token_num_ops: cmdline_token_ops;
}
extern "C" {
    pub fn cmdline_parse_num(tk: *mut cmdline_parse_token_hdr_t,
                             srcbuf: *const ::std::os::raw::c_char,
                             res: *mut ::std::os::raw::c_void,
                             ressize: ::std::os::raw::c_uint)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cmdline_get_help_num(tk: *mut cmdline_parse_token_hdr_t,
                                dstbuf: *mut ::std::os::raw::c_char,
                                size: ::std::os::raw::c_uint)
     -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct cmdline_portlist {
    pub map: u32,
}
#[test]
fn bindgen_test_layout_cmdline_portlist() {
    assert_eq!(::std::mem::size_of::<cmdline_portlist>() , 4usize , concat ! (
               "Size of: " , stringify ! ( cmdline_portlist ) ));
    assert_eq! (::std::mem::align_of::<cmdline_portlist>() , 4usize , concat !
                ( "Alignment of " , stringify ! ( cmdline_portlist ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmdline_portlist ) ) . map as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( cmdline_portlist ) ,
                "::" , stringify ! ( map ) ));
}
impl Clone for cmdline_portlist {
    fn clone(&self) -> Self { *self }
}
pub type cmdline_portlist_t = cmdline_portlist;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct cmdline_token_portlist {
    pub hdr: cmdline_token_hdr,
}
#[test]
fn bindgen_test_layout_cmdline_token_portlist() {
    assert_eq!(::std::mem::size_of::<cmdline_token_portlist>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( cmdline_token_portlist )
               ));
    assert_eq! (::std::mem::align_of::<cmdline_token_portlist>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( cmdline_token_portlist ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmdline_token_portlist ) ) . hdr as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( cmdline_token_portlist
                ) , "::" , stringify ! ( hdr ) ));
}
impl Clone for cmdline_token_portlist {
    fn clone(&self) -> Self { *self }
}
pub type cmdline_parse_token_portlist_t = cmdline_token_portlist;
extern "C" {
    #[link_name = "cmdline_token_portlist_ops"]
    pub static mut cmdline_token_portlist_ops: cmdline_token_ops;
}
extern "C" {
    pub fn cmdline_parse_portlist(tk: *mut cmdline_parse_token_hdr_t,
                                  srcbuf: *const ::std::os::raw::c_char,
                                  res: *mut ::std::os::raw::c_void,
                                  ressize: ::std::os::raw::c_uint)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cmdline_get_help_portlist(tk: *mut cmdline_parse_token_hdr_t,
                                     dstbuf: *mut ::std::os::raw::c_char,
                                     size: ::std::os::raw::c_uint)
     -> ::std::os::raw::c_int;
}
pub type cmdline_fixed_string_t = [::std::os::raw::c_char; 128usize];
pub type cmdline_multi_string_t = [::std::os::raw::c_char; 4096usize];
#[repr(C)]
#[derive(Debug, Copy)]
pub struct cmdline_token_string_data {
    pub str: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_cmdline_token_string_data() {
    assert_eq!(::std::mem::size_of::<cmdline_token_string_data>() , 8usize ,
               concat ! (
               "Size of: " , stringify ! ( cmdline_token_string_data ) ));
    assert_eq! (::std::mem::align_of::<cmdline_token_string_data>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( cmdline_token_string_data )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmdline_token_string_data ) ) . str as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                cmdline_token_string_data ) , "::" , stringify ! ( str ) ));
}
impl Clone for cmdline_token_string_data {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct cmdline_token_string {
    pub hdr: cmdline_token_hdr,
    pub string_data: cmdline_token_string_data,
}
#[test]
fn bindgen_test_layout_cmdline_token_string() {
    assert_eq!(::std::mem::size_of::<cmdline_token_string>() , 24usize ,
               concat ! ( "Size of: " , stringify ! ( cmdline_token_string )
               ));
    assert_eq! (::std::mem::align_of::<cmdline_token_string>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( cmdline_token_string ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmdline_token_string ) ) . hdr as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( cmdline_token_string )
                , "::" , stringify ! ( hdr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmdline_token_string ) ) . string_data as
                * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( cmdline_token_string )
                , "::" , stringify ! ( string_data ) ));
}
impl Clone for cmdline_token_string {
    fn clone(&self) -> Self { *self }
}
pub type cmdline_parse_token_string_t = cmdline_token_string;
extern "C" {
    #[link_name = "cmdline_token_string_ops"]
    pub static mut cmdline_token_string_ops: cmdline_token_ops;
}
extern "C" {
    pub fn cmdline_parse_string(tk: *mut cmdline_parse_token_hdr_t,
                                srcbuf: *const ::std::os::raw::c_char,
                                res: *mut ::std::os::raw::c_void,
                                ressize: ::std::os::raw::c_uint)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cmdline_complete_get_nb_string(tk: *mut cmdline_parse_token_hdr_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cmdline_complete_get_elt_string(tk: *mut cmdline_parse_token_hdr_t,
                                           idx: ::std::os::raw::c_int,
                                           dstbuf:
                                               *mut ::std::os::raw::c_char,
                                           size: ::std::os::raw::c_uint)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cmdline_get_help_string(tk: *mut cmdline_parse_token_hdr_t,
                                   dstbuf: *mut ::std::os::raw::c_char,
                                   size: ::std::os::raw::c_uint)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cmdline_file_new(ctx: *mut cmdline_parse_ctx_t,
                            prompt: *const ::std::os::raw::c_char,
                            path: *const ::std::os::raw::c_char)
     -> *mut cmdline;
}
extern "C" {
    pub fn cmdline_stdin_new(ctx: *mut cmdline_parse_ctx_t,
                             prompt: *const ::std::os::raw::c_char)
     -> *mut cmdline;
}
extern "C" {
    pub fn cmdline_stdin_exit(cl: *mut cmdline);
}
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: f64,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(::std::mem::size_of::<max_align_t>() , 32usize , concat ! (
               "Size of: " , stringify ! ( max_align_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const max_align_t ) ) .
                __clang_max_align_nonce1 as * const _ as usize } , 0usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( max_align_t ) , "::" ,
                stringify ! ( __clang_max_align_nonce1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const max_align_t ) ) .
                __clang_max_align_nonce2 as * const _ as usize } , 16usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( max_align_t ) , "::" ,
                stringify ! ( __clang_max_align_nonce2 ) ));
}
impl Clone for max_align_t {
    fn clone(&self) -> Self { *self }
}
pub type __gwchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct imaxdiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_imaxdiv_t() {
    assert_eq!(::std::mem::size_of::<imaxdiv_t>() , 16usize , concat ! (
               "Size of: " , stringify ! ( imaxdiv_t ) ));
    assert_eq! (::std::mem::align_of::<imaxdiv_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( imaxdiv_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const imaxdiv_t ) ) . quot as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( imaxdiv_t ) , "::" ,
                stringify ! ( quot ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const imaxdiv_t ) ) . rem as * const _ as usize
                } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( imaxdiv_t ) , "::" ,
                stringify ! ( rem ) ));
}
impl Clone for imaxdiv_t {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn imaxabs(__n: intmax_t) -> intmax_t;
}
extern "C" {
    pub fn imaxdiv(__numer: intmax_t, __denom: intmax_t) -> imaxdiv_t;
}
extern "C" {
    pub fn strtoimax(__nptr: *const ::std::os::raw::c_char,
                     __endptr: *mut *mut ::std::os::raw::c_char,
                     __base: ::std::os::raw::c_int) -> intmax_t;
}
extern "C" {
    pub fn strtoumax(__nptr: *const ::std::os::raw::c_char,
                     __endptr: *mut *mut ::std::os::raw::c_char,
                     __base: ::std::os::raw::c_int) -> uintmax_t;
}
extern "C" {
    pub fn wcstoimax(__nptr: *const __gwchar_t,
                     __endptr: *mut *mut __gwchar_t,
                     __base: ::std::os::raw::c_int) -> intmax_t;
}
extern "C" {
    pub fn wcstoumax(__nptr: *const __gwchar_t,
                     __endptr: *mut *mut __gwchar_t,
                     __base: ::std::os::raw::c_int) -> uintmax_t;
}
pub const _ISupper: _bindgen_ty_7 = _bindgen_ty_7::_ISupper;
pub const _ISlower: _bindgen_ty_7 = _bindgen_ty_7::_ISlower;
pub const _ISalpha: _bindgen_ty_7 = _bindgen_ty_7::_ISalpha;
pub const _ISdigit: _bindgen_ty_7 = _bindgen_ty_7::_ISdigit;
pub const _ISxdigit: _bindgen_ty_7 = _bindgen_ty_7::_ISxdigit;
pub const _ISspace: _bindgen_ty_7 = _bindgen_ty_7::_ISspace;
pub const _ISprint: _bindgen_ty_7 = _bindgen_ty_7::_ISprint;
pub const _ISgraph: _bindgen_ty_7 = _bindgen_ty_7::_ISgraph;
pub const _ISblank: _bindgen_ty_7 = _bindgen_ty_7::_ISblank;
pub const _IScntrl: _bindgen_ty_7 = _bindgen_ty_7::_IScntrl;
pub const _ISpunct: _bindgen_ty_7 = _bindgen_ty_7::_ISpunct;
pub const _ISalnum: _bindgen_ty_7 = _bindgen_ty_7::_ISalnum;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_7 {
    _ISupper = 256,
    _ISlower = 512,
    _ISalpha = 1024,
    _ISdigit = 2048,
    _ISxdigit = 4096,
    _ISspace = 8192,
    _ISprint = 16384,
    _ISgraph = 32768,
    _ISblank = 1,
    _IScntrl = 2,
    _ISpunct = 4,
    _ISalnum = 8,
}
extern "C" {
    pub fn __ctype_b_loc() -> *mut *const ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn __ctype_tolower_loc() -> *mut *const __int32_t;
}
extern "C" {
    pub fn __ctype_toupper_loc() -> *mut *const __int32_t;
}
extern "C" {
    pub fn isalnum(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isalpha(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn iscntrl(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isdigit(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn islower(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isgraph(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isprint(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ispunct(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isspace(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isupper(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isxdigit(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tolower(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn toupper(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isblank(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isascii(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn toascii(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _toupper(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _tolower(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[test]
fn bindgen_test_layout___locale_struct() {
    assert_eq!(::std::mem::size_of::<__locale_struct>() , 232usize , concat !
               ( "Size of: " , stringify ! ( __locale_struct ) ));
    assert_eq! (::std::mem::align_of::<__locale_struct>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( __locale_struct ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __locale_struct ) ) . __locales as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __locale_struct ) ,
                "::" , stringify ! ( __locales ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __locale_struct ) ) . __ctype_b as *
                const _ as usize } , 104usize , concat ! (
                "Alignment of field: " , stringify ! ( __locale_struct ) ,
                "::" , stringify ! ( __ctype_b ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __locale_struct ) ) . __ctype_tolower as
                * const _ as usize } , 112usize , concat ! (
                "Alignment of field: " , stringify ! ( __locale_struct ) ,
                "::" , stringify ! ( __ctype_tolower ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __locale_struct ) ) . __ctype_toupper as
                * const _ as usize } , 120usize , concat ! (
                "Alignment of field: " , stringify ! ( __locale_struct ) ,
                "::" , stringify ! ( __ctype_toupper ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __locale_struct ) ) . __names as * const
                _ as usize } , 128usize , concat ! (
                "Alignment of field: " , stringify ! ( __locale_struct ) ,
                "::" , stringify ! ( __names ) ));
}
impl Clone for __locale_struct {
    fn clone(&self) -> Self { *self }
}
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
extern "C" {
    pub fn isalnum_l(arg1: ::std::os::raw::c_int, arg2: __locale_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isalpha_l(arg1: ::std::os::raw::c_int, arg2: __locale_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn iscntrl_l(arg1: ::std::os::raw::c_int, arg2: __locale_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isdigit_l(arg1: ::std::os::raw::c_int, arg2: __locale_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn islower_l(arg1: ::std::os::raw::c_int, arg2: __locale_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isgraph_l(arg1: ::std::os::raw::c_int, arg2: __locale_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isprint_l(arg1: ::std::os::raw::c_int, arg2: __locale_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ispunct_l(arg1: ::std::os::raw::c_int, arg2: __locale_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isspace_l(arg1: ::std::os::raw::c_int, arg2: __locale_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isupper_l(arg1: ::std::os::raw::c_int, arg2: __locale_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isxdigit_l(arg1: ::std::os::raw::c_int, arg2: __locale_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isblank_l(arg1: ::std::os::raw::c_int, arg2: __locale_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __tolower_l(__c: ::std::os::raw::c_int, __l: __locale_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tolower_l(__c: ::std::os::raw::c_int, __l: __locale_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __toupper_l(__c: ::std::os::raw::c_int, __l: __locale_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn toupper_l(__c: ::std::os::raw::c_int, __l: __locale_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn memcpy(__dest: *mut ::std::os::raw::c_void,
                  __src: *const ::std::os::raw::c_void, __n: usize)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memmove(__dest: *mut ::std::os::raw::c_void,
                   __src: *const ::std::os::raw::c_void, __n: usize)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memccpy(__dest: *mut ::std::os::raw::c_void,
                   __src: *const ::std::os::raw::c_void,
                   __c: ::std::os::raw::c_int, __n: usize)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memset(__s: *mut ::std::os::raw::c_void,
                  __c: ::std::os::raw::c_int, __n: usize)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memcmp(__s1: *const ::std::os::raw::c_void,
                  __s2: *const ::std::os::raw::c_void, __n: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn memchr(__s: *const ::std::os::raw::c_void,
                  __c: ::std::os::raw::c_int, __n: usize)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn strcpy(__dest: *mut ::std::os::raw::c_char,
                  __src: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncpy(__dest: *mut ::std::os::raw::c_char,
                   __src: *const ::std::os::raw::c_char, __n: usize)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcat(__dest: *mut ::std::os::raw::c_char,
                  __src: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncat(__dest: *mut ::std::os::raw::c_char,
                   __src: *const ::std::os::raw::c_char, __n: usize)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcmp(__s1: *const ::std::os::raw::c_char,
                  __s2: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncmp(__s1: *const ::std::os::raw::c_char,
                   __s2: *const ::std::os::raw::c_char, __n: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcoll(__s1: *const ::std::os::raw::c_char,
                   __s2: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strxfrm(__dest: *mut ::std::os::raw::c_char,
                   __src: *const ::std::os::raw::c_char, __n: usize)
     -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strcoll_l(__s1: *const ::std::os::raw::c_char,
                     __s2: *const ::std::os::raw::c_char, __l: __locale_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strxfrm_l(__dest: *mut ::std::os::raw::c_char,
                     __src: *const ::std::os::raw::c_char, __n: usize,
                     __l: __locale_t) -> usize;
}
extern "C" {
    pub fn strdup(__s: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strndup(__string: *const ::std::os::raw::c_char, __n: usize)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strchr(__s: *const ::std::os::raw::c_char,
                  __c: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strrchr(__s: *const ::std::os::raw::c_char,
                   __c: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcspn(__s: *const ::std::os::raw::c_char,
                   __reject: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strspn(__s: *const ::std::os::raw::c_char,
                  __accept: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strpbrk(__s: *const ::std::os::raw::c_char,
                   __accept: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strstr(__haystack: *const ::std::os::raw::c_char,
                  __needle: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strtok(__s: *mut ::std::os::raw::c_char,
                  __delim: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __strtok_r(__s: *mut ::std::os::raw::c_char,
                      __delim: *const ::std::os::raw::c_char,
                      __save_ptr: *mut *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strtok_r(__s: *mut ::std::os::raw::c_char,
                    __delim: *const ::std::os::raw::c_char,
                    __save_ptr: *mut *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strlen(__s: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strnlen(__string: *const ::std::os::raw::c_char, __maxlen: usize)
     -> usize;
}
extern "C" {
    pub fn strerror(__errnum: ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[link_name = "__xpg_strerror_r"]
    pub fn strerror_r(__errnum: ::std::os::raw::c_int,
                      __buf: *mut ::std::os::raw::c_char, __buflen: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strerror_l(__errnum: ::std::os::raw::c_int, __l: __locale_t)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __bzero(__s: *mut ::std::os::raw::c_void, __n: usize);
}
extern "C" {
    pub fn bcopy(__src: *const ::std::os::raw::c_void,
                 __dest: *mut ::std::os::raw::c_void, __n: usize);
}
extern "C" {
    pub fn bzero(__s: *mut ::std::os::raw::c_void, __n: usize);
}
extern "C" {
    pub fn bcmp(__s1: *const ::std::os::raw::c_void,
                __s2: *const ::std::os::raw::c_void, __n: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn index(__s: *const ::std::os::raw::c_char,
                 __c: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn rindex(__s: *const ::std::os::raw::c_char,
                  __c: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ffs(__i: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcasecmp(__s1: *const ::std::os::raw::c_char,
                      __s2: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncasecmp(__s1: *const ::std::os::raw::c_char,
                       __s2: *const ::std::os::raw::c_char, __n: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strsep(__stringp: *mut *mut ::std::os::raw::c_char,
                  __delim: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strsignal(__sig: ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __stpcpy(__dest: *mut ::std::os::raw::c_char,
                    __src: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn stpcpy(__dest: *mut ::std::os::raw::c_char,
                  __src: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __stpncpy(__dest: *mut ::std::os::raw::c_char,
                     __src: *const ::std::os::raw::c_char, __n: usize)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn stpncpy(__dest: *mut ::std::os::raw::c_char,
                   __src: *const ::std::os::raw::c_char, __n: usize)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __errno_location() -> *mut ::std::os::raw::c_int;
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum idtype_t { P_ALL = 0, P_PID = 1, P_PGID = 2, }
#[repr(C)]
#[derive(Debug, Copy)]
pub struct wait {
    pub w_status: __BindgenUnionField<::std::os::raw::c_int>,
    pub __wait_terminated: __BindgenUnionField<wait__bindgen_ty_1>,
    pub __wait_stopped: __BindgenUnionField<wait__bindgen_ty_2>,
    pub bindgen_union_field: u32,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct wait__bindgen_ty_1 {
    pub _bitfield_1: [u16; 2usize],
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_wait__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<wait__bindgen_ty_1>() , 4usize , concat !
               ( "Size of: " , stringify ! ( wait__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<wait__bindgen_ty_1>() , 4usize , concat
                ! ( "Alignment of " , stringify ! ( wait__bindgen_ty_1 ) ));
}
impl Clone for wait__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl wait__bindgen_ty_1 {
    #[inline]
    pub fn __w_termsig(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 127u64 as u32;
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set___w_termsig(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 127u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn __w_coredump(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 128u64 as u32;
        let val = (unit_field_val & mask) >> 7usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set___w_coredump(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 128u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 7usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn __w_retcode(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 65280u64 as u32;
        let val = (unit_field_val & mask) >> 8usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set___w_retcode(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 65280u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 8usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn new_bitfield_1(__w_termsig: ::std::os::raw::c_uint,
                          __w_coredump: ::std::os::raw::c_uint,
                          __w_retcode: ::std::os::raw::c_uint) -> u32 {
        ({
             ({
                  ({ 0 } |
                       ((__w_termsig as u32 as u32) << 0usize) &
                           (127u64 as u32))
              } | ((__w_coredump as u32 as u32) << 7usize) & (128u64 as u32))
         } | ((__w_retcode as u32 as u32) << 8usize) & (65280u64 as u32))
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct wait__bindgen_ty_2 {
    pub _bitfield_1: [u16; 2usize],
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_wait__bindgen_ty_2() {
    assert_eq!(::std::mem::size_of::<wait__bindgen_ty_2>() , 4usize , concat !
               ( "Size of: " , stringify ! ( wait__bindgen_ty_2 ) ));
    assert_eq! (::std::mem::align_of::<wait__bindgen_ty_2>() , 4usize , concat
                ! ( "Alignment of " , stringify ! ( wait__bindgen_ty_2 ) ));
}
impl Clone for wait__bindgen_ty_2 {
    fn clone(&self) -> Self { *self }
}
impl wait__bindgen_ty_2 {
    #[inline]
    pub fn __w_stopval(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 255u64 as u32;
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set___w_stopval(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 255u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn __w_stopsig(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 65280u64 as u32;
        let val = (unit_field_val & mask) >> 8usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set___w_stopsig(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 65280u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 8usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn new_bitfield_1(__w_stopval: ::std::os::raw::c_uint,
                          __w_stopsig: ::std::os::raw::c_uint) -> u32 {
        ({
             ({ 0 } |
                  ((__w_stopval as u32 as u32) << 0usize) & (255u64 as u32))
         } | ((__w_stopsig as u32 as u32) << 8usize) & (65280u64 as u32))
    }
}
#[test]
fn bindgen_test_layout_wait() {
    assert_eq!(::std::mem::size_of::<wait>() , 4usize , concat ! (
               "Size of: " , stringify ! ( wait ) ));
    assert_eq! (::std::mem::align_of::<wait>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( wait ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const wait ) ) . w_status as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( wait ) , "::" ,
                stringify ! ( w_status ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const wait ) ) . __wait_terminated as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( wait ) , "::" ,
                stringify ! ( __wait_terminated ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const wait ) ) . __wait_stopped as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( wait ) , "::" ,
                stringify ! ( __wait_stopped ) ));
}
impl Clone for wait {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __WAIT_STATUS {
    pub __uptr: __BindgenUnionField<*mut wait>,
    pub __iptr: __BindgenUnionField<*mut ::std::os::raw::c_int>,
    pub bindgen_union_field: u64,
}
#[test]
fn bindgen_test_layout___WAIT_STATUS() {
    assert_eq!(::std::mem::size_of::<__WAIT_STATUS>() , 8usize , concat ! (
               "Size of: " , stringify ! ( __WAIT_STATUS ) ));
    assert_eq! (::std::mem::align_of::<__WAIT_STATUS>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( __WAIT_STATUS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __WAIT_STATUS ) ) . __uptr as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __WAIT_STATUS ) , "::"
                , stringify ! ( __uptr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __WAIT_STATUS ) ) . __iptr as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __WAIT_STATUS ) , "::"
                , stringify ! ( __iptr ) ));
}
impl Clone for __WAIT_STATUS {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_div_t() {
    assert_eq!(::std::mem::size_of::<div_t>() , 8usize , concat ! (
               "Size of: " , stringify ! ( div_t ) ));
    assert_eq! (::std::mem::align_of::<div_t>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( div_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const div_t ) ) . quot as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( div_t ) , "::" ,
                stringify ! ( quot ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const div_t ) ) . rem as * const _ as usize } ,
                4usize , concat ! (
                "Alignment of field: " , stringify ! ( div_t ) , "::" ,
                stringify ! ( rem ) ));
}
impl Clone for div_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_ldiv_t() {
    assert_eq!(::std::mem::size_of::<ldiv_t>() , 16usize , concat ! (
               "Size of: " , stringify ! ( ldiv_t ) ));
    assert_eq! (::std::mem::align_of::<ldiv_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( ldiv_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ldiv_t ) ) . quot as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ldiv_t ) , "::" ,
                stringify ! ( quot ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ldiv_t ) ) . rem as * const _ as usize }
                , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( ldiv_t ) , "::" ,
                stringify ! ( rem ) ));
}
impl Clone for ldiv_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_lldiv_t() {
    assert_eq!(::std::mem::size_of::<lldiv_t>() , 16usize , concat ! (
               "Size of: " , stringify ! ( lldiv_t ) ));
    assert_eq! (::std::mem::align_of::<lldiv_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( lldiv_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lldiv_t ) ) . quot as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( lldiv_t ) , "::" ,
                stringify ! ( quot ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lldiv_t ) ) . rem as * const _ as usize }
                , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( lldiv_t ) , "::" ,
                stringify ! ( rem ) ));
}
impl Clone for lldiv_t {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn __ctype_get_mb_cur_max() -> usize;
}
extern "C" {
    pub fn atof(__nptr: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn atoi(__nptr: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn atol(__nptr: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn atoll(__nptr: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtod(__nptr: *const ::std::os::raw::c_char,
                  __endptr: *mut *mut ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn strtof(__nptr: *const ::std::os::raw::c_char,
                  __endptr: *mut *mut ::std::os::raw::c_char) -> f32;
}
extern "C" {
    pub fn strtold(__nptr: *const ::std::os::raw::c_char,
                   __endptr: *mut *mut ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn strtol(__nptr: *const ::std::os::raw::c_char,
                  __endptr: *mut *mut ::std::os::raw::c_char,
                  __base: ::std::os::raw::c_int) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn strtoul(__nptr: *const ::std::os::raw::c_char,
                   __endptr: *mut *mut ::std::os::raw::c_char,
                   __base: ::std::os::raw::c_int) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strtoq(__nptr: *const ::std::os::raw::c_char,
                  __endptr: *mut *mut ::std::os::raw::c_char,
                  __base: ::std::os::raw::c_int)
     -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtouq(__nptr: *const ::std::os::raw::c_char,
                   __endptr: *mut *mut ::std::os::raw::c_char,
                   __base: ::std::os::raw::c_int)
     -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn strtoll(__nptr: *const ::std::os::raw::c_char,
                   __endptr: *mut *mut ::std::os::raw::c_char,
                   __base: ::std::os::raw::c_int)
     -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtoull(__nptr: *const ::std::os::raw::c_char,
                    __endptr: *mut *mut ::std::os::raw::c_char,
                    __base: ::std::os::raw::c_int)
     -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn l64a(__n: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn a64l(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn random() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srandom(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn initstate(__seed: ::std::os::raw::c_uint,
                     __statebuf: *mut ::std::os::raw::c_char,
                     __statelen: usize) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn setstate(__statebuf: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::std::os::raw::c_int,
    pub rand_deg: ::std::os::raw::c_int,
    pub rand_sep: ::std::os::raw::c_int,
    pub end_ptr: *mut i32,
}
#[test]
fn bindgen_test_layout_random_data() {
    assert_eq!(::std::mem::size_of::<random_data>() , 48usize , concat ! (
               "Size of: " , stringify ! ( random_data ) ));
    assert_eq! (::std::mem::align_of::<random_data>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( random_data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const random_data ) ) . fptr as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( random_data ) , "::" ,
                stringify ! ( fptr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const random_data ) ) . rptr as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( random_data ) , "::" ,
                stringify ! ( rptr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const random_data ) ) . state as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( random_data ) , "::" ,
                stringify ! ( state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const random_data ) ) . rand_type as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( random_data ) , "::" ,
                stringify ! ( rand_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const random_data ) ) . rand_deg as * const _
                as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( random_data ) , "::" ,
                stringify ! ( rand_deg ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const random_data ) ) . rand_sep as * const _
                as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( random_data ) , "::" ,
                stringify ! ( rand_sep ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const random_data ) ) . end_ptr as * const _ as
                usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( random_data ) , "::" ,
                stringify ! ( end_ptr ) ));
}
impl Clone for random_data {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn random_r(__buf: *mut random_data, __result: *mut i32)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srandom_r(__seed: ::std::os::raw::c_uint, __buf: *mut random_data)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn initstate_r(__seed: ::std::os::raw::c_uint,
                       __statebuf: *mut ::std::os::raw::c_char,
                       __statelen: usize, __buf: *mut random_data)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setstate_r(__statebuf: *mut ::std::os::raw::c_char,
                      __buf: *mut random_data) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn rand_r(__seed: *mut ::std::os::raw::c_uint)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn drand48() -> f64;
}
extern "C" {
    pub fn erand48(__xsubi: *mut ::std::os::raw::c_ushort) -> f64;
}
extern "C" {
    pub fn lrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn nrand48(__xsubi: *mut ::std::os::raw::c_ushort)
     -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn mrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn jrand48(__xsubi: *mut ::std::os::raw::c_ushort)
     -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srand48(__seedval: ::std::os::raw::c_long);
}
extern "C" {
    pub fn seed48(__seed16v: *mut ::std::os::raw::c_ushort)
     -> *mut ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn lcong48(__param: *mut ::std::os::raw::c_ushort);
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct drand48_data {
    pub __x: [::std::os::raw::c_ushort; 3usize],
    pub __old_x: [::std::os::raw::c_ushort; 3usize],
    pub __c: ::std::os::raw::c_ushort,
    pub __init: ::std::os::raw::c_ushort,
    pub __a: ::std::os::raw::c_ulonglong,
}
#[test]
fn bindgen_test_layout_drand48_data() {
    assert_eq!(::std::mem::size_of::<drand48_data>() , 24usize , concat ! (
               "Size of: " , stringify ! ( drand48_data ) ));
    assert_eq! (::std::mem::align_of::<drand48_data>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( drand48_data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const drand48_data ) ) . __x as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( drand48_data ) , "::" ,
                stringify ! ( __x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const drand48_data ) ) . __old_x as * const _
                as usize } , 6usize , concat ! (
                "Alignment of field: " , stringify ! ( drand48_data ) , "::" ,
                stringify ! ( __old_x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const drand48_data ) ) . __c as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( drand48_data ) , "::" ,
                stringify ! ( __c ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const drand48_data ) ) . __init as * const _ as
                usize } , 14usize , concat ! (
                "Alignment of field: " , stringify ! ( drand48_data ) , "::" ,
                stringify ! ( __init ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const drand48_data ) ) . __a as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( drand48_data ) , "::" ,
                stringify ! ( __a ) ));
}
impl Clone for drand48_data {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn drand48_r(__buffer: *mut drand48_data, __result: *mut f64)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn erand48_r(__xsubi: *mut ::std::os::raw::c_ushort,
                     __buffer: *mut drand48_data, __result: *mut f64)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lrand48_r(__buffer: *mut drand48_data,
                     __result: *mut ::std::os::raw::c_long)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nrand48_r(__xsubi: *mut ::std::os::raw::c_ushort,
                     __buffer: *mut drand48_data,
                     __result: *mut ::std::os::raw::c_long)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mrand48_r(__buffer: *mut drand48_data,
                     __result: *mut ::std::os::raw::c_long)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn jrand48_r(__xsubi: *mut ::std::os::raw::c_ushort,
                     __buffer: *mut drand48_data,
                     __result: *mut ::std::os::raw::c_long)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand48_r(__seedval: ::std::os::raw::c_long,
                     __buffer: *mut drand48_data) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn seed48_r(__seed16v: *mut ::std::os::raw::c_ushort,
                    __buffer: *mut drand48_data) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lcong48_r(__param: *mut ::std::os::raw::c_ushort,
                     __buffer: *mut drand48_data) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn malloc(__size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn calloc(__nmemb: usize, __size: usize)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn realloc(__ptr: *mut ::std::os::raw::c_void, __size: usize)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn free(__ptr: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn cfree(__ptr: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn alloca(__size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn valloc(__size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn posix_memalign(__memptr: *mut *mut ::std::os::raw::c_void,
                          __alignment: usize, __size: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aligned_alloc(__alignment: usize, __size: usize)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn abort();
}
extern "C" {
    pub fn atexit(__func: ::std::option::Option<unsafe extern "C" fn()>)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn at_quick_exit(__func:
                             ::std::option::Option<unsafe extern "C" fn()>)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn on_exit(__func:
                       ::std::option::Option<unsafe extern "C" fn(__status:
                                                                      ::std::os::raw::c_int,
                                                                  __arg:
                                                                      *mut ::std::os::raw::c_void)>,
                   __arg: *mut ::std::os::raw::c_void)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn quick_exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn _Exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn getenv(__name: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn putenv(__string: *mut ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setenv(__name: *const ::std::os::raw::c_char,
                  __value: *const ::std::os::raw::c_char,
                  __replace: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unsetenv(__name: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearenv() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mktemp(__template: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn mkstemp(__template: *mut ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkstemps(__template: *mut ::std::os::raw::c_char,
                    __suffixlen: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkdtemp(__template: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn system(__command: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn realpath(__name: *const ::std::os::raw::c_char,
                    __resolved: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
pub type __compar_fn_t =
    ::std::option::Option<unsafe extern "C" fn(arg1:
                                                   *const ::std::os::raw::c_void,
                                               arg2:
                                                   *const ::std::os::raw::c_void)
                              -> ::std::os::raw::c_int>;
extern "C" {
    pub fn bsearch(__key: *const ::std::os::raw::c_void,
                   __base: *const ::std::os::raw::c_void, __nmemb: usize,
                   __size: usize, __compar: __compar_fn_t)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn qsort(__base: *mut ::std::os::raw::c_void, __nmemb: usize,
                 __size: usize, __compar: __compar_fn_t);
}
extern "C" {
    pub fn abs(__x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn labs(__x: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llabs(__x: ::std::os::raw::c_longlong)
     -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn div(__numer: ::std::os::raw::c_int, __denom: ::std::os::raw::c_int)
     -> div_t;
}
extern "C" {
    pub fn ldiv(__numer: ::std::os::raw::c_long,
                __denom: ::std::os::raw::c_long) -> ldiv_t;
}
extern "C" {
    pub fn lldiv(__numer: ::std::os::raw::c_longlong,
                 __denom: ::std::os::raw::c_longlong) -> lldiv_t;
}
extern "C" {
    pub fn ecvt(__value: f64, __ndigit: ::std::os::raw::c_int,
                __decpt: *mut ::std::os::raw::c_int,
                __sign: *mut ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fcvt(__value: f64, __ndigit: ::std::os::raw::c_int,
                __decpt: *mut ::std::os::raw::c_int,
                __sign: *mut ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn gcvt(__value: f64, __ndigit: ::std::os::raw::c_int,
                __buf: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qecvt(__value: f64, __ndigit: ::std::os::raw::c_int,
                 __decpt: *mut ::std::os::raw::c_int,
                 __sign: *mut ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qfcvt(__value: f64, __ndigit: ::std::os::raw::c_int,
                 __decpt: *mut ::std::os::raw::c_int,
                 __sign: *mut ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qgcvt(__value: f64, __ndigit: ::std::os::raw::c_int,
                 __buf: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ecvt_r(__value: f64, __ndigit: ::std::os::raw::c_int,
                  __decpt: *mut ::std::os::raw::c_int,
                  __sign: *mut ::std::os::raw::c_int,
                  __buf: *mut ::std::os::raw::c_char, __len: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fcvt_r(__value: f64, __ndigit: ::std::os::raw::c_int,
                  __decpt: *mut ::std::os::raw::c_int,
                  __sign: *mut ::std::os::raw::c_int,
                  __buf: *mut ::std::os::raw::c_char, __len: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qecvt_r(__value: f64, __ndigit: ::std::os::raw::c_int,
                   __decpt: *mut ::std::os::raw::c_int,
                   __sign: *mut ::std::os::raw::c_int,
                   __buf: *mut ::std::os::raw::c_char, __len: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qfcvt_r(__value: f64, __ndigit: ::std::os::raw::c_int,
                   __decpt: *mut ::std::os::raw::c_int,
                   __sign: *mut ::std::os::raw::c_int,
                   __buf: *mut ::std::os::raw::c_char, __len: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mblen(__s: *const ::std::os::raw::c_char, __n: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbtowc(__pwc: *mut wchar_t, __s: *const ::std::os::raw::c_char,
                  __n: usize) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wctomb(__s: *mut ::std::os::raw::c_char, __wchar: wchar_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbstowcs(__pwcs: *mut wchar_t, __s: *const ::std::os::raw::c_char,
                    __n: usize) -> usize;
}
extern "C" {
    pub fn wcstombs(__s: *mut ::std::os::raw::c_char, __pwcs: *const wchar_t,
                    __n: usize) -> usize;
}
extern "C" {
    pub fn rpmatch(__response: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getsubopt(__optionp: *mut *mut ::std::os::raw::c_char,
                     __tokens: *const *const ::std::os::raw::c_char,
                     __valuep: *mut *mut ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getloadavg(__loadavg: *mut f64, __nelem: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
pub type unaligned_uint64_t = u64;
pub type unaligned_uint32_t = u32;
pub type unaligned_uint16_t = u16;
extern "C" {
    /// Function to terminate the application immediately, printing an error
/// message and returning the exit_code back to the shell.
///
/// This function never returns
///
/// @param exit_code
/// The exit code to be returned by the application
/// @param format
/// The format string to be used for printing the message. This can include
/// printf format characters which will be expanded using any further parameters
/// to the function.
    pub fn rte_exit(exit_code: ::std::os::raw::c_int,
                    format: *const ::std::os::raw::c_char, ...);
}
/// 64 bits vector size to use with unsigned 8 bits elements.
///
/// a = (rte_v64u8_t){ a0, a1, a2, a3, a4, a5, a6, a7 }
pub type rte_v64u8_t = [u8; 8usize];
/// 64 bits vector size to use with unsigned 16 bits elements.
///
/// a = (rte_v64u16_t){ a0, a1, a2, a3 }
pub type rte_v64u16_t = [u16; 4usize];
/// 64 bits vector size to use with unsigned 32 bits elements.
///
/// a = (rte_v64u32_t){ a0, a1 }
pub type rte_v64u32_t = [u32; 2usize];
/// 128 bits vector size to use with unsigned 8 bits elements.
///
/// a = (rte_v128u8_t){ a00, a01, a02, a03, a04, a05, a06, a07,
/// a08, a09, a10, a11, a12, a13, a14, a15 }
pub type rte_v128u8_t = [u8; 16usize];
/// 128 bits vector size to use with unsigned 16 bits elements.
///
/// a = (rte_v128u16_t){ a0, a1, a2, a3, a4, a5, a6, a7 }
pub type rte_v128u16_t = [u16; 8usize];
/// 128 bits vector size to use with unsigned 32 bits elements.
///
/// a = (rte_v128u32_t){ a0, a1, a2, a3, a4 }
pub type rte_v128u32_t = [u32; 4usize];
/// 128 bits vector size to use with unsigned 64 bits elements.
///
/// a = (rte_v128u64_t){ a0, a1 }
pub type rte_v128u64_t = [u64; 2usize];
/// 256 bits vector size to use with unsigned 8 bits elements.
///
/// a = (rte_v256u8_t){ a00, a01, a02, a03, a04, a05, a06, a07,
/// a08, a09, a10, a11, a12, a13, a14, a15,
/// a16, a17, a18, a19, a20, a21, a22, a23,
/// a24, a25, a26, a27, a28, a29, a30, a31 }
pub type rte_v256u8_t = [u8; 32usize];
/// 256 bits vector size to use with unsigned 16 bits elements.
///
/// a = (rte_v256u16_t){ a00, a01, a02, a03, a04, a05, a06, a07,
/// a08, a09, a10, a11, a12, a13, a14, a15 }
pub type rte_v256u16_t = [u16; 16usize];
/// 256 bits vector size to use with unsigned 32 bits elements.
///
/// a = (rte_v256u32_t){ a0, a1, a2, a3, a4, a5, a6, a7 }
pub type rte_v256u32_t = [u32; 8usize];
/// 256 bits vector size to use with unsigned 64 bits elements.
///
/// a = (rte_v256u64_t){ a0, a1, a2, a3 }
pub type rte_v256u64_t = [u64; 4usize];
/// 64 bits vector size to use with 8 bits elements.
///
/// a = (rte_v64s8_t){ a0, a1, a2, a3, a4, a5, a6, a7 }
pub type rte_v64s8_t = [i8; 8usize];
/// 64 bits vector size to use with 16 bits elements.
///
/// a = (rte_v64s16_t){ a0, a1, a2, a3 }
pub type rte_v64s16_t = [i16; 4usize];
/// 64 bits vector size to use with 32 bits elements.
///
/// a = (rte_v64s32_t){ a0, a1 }
pub type rte_v64s32_t = [i32; 2usize];
/// 128 bits vector size to use with 8 bits elements.
///
/// a = (rte_v128s8_t){ a00, a01, a02, a03, a04, a05, a06, a07,
/// a08, a09, a10, a11, a12, a13, a14, a15 }
pub type rte_v128s8_t = [i8; 16usize];
/// 128 bits vector size to use with 16 bits elements.
///
/// a = (rte_v128s16_t){ a0, a1, a2, a3, a4, a5, a6, a7 }
pub type rte_v128s16_t = [i16; 8usize];
/// 128 bits vector size to use with 32 bits elements.
///
/// a = (rte_v128s32_t){ a0, a1, a2, a3 }
pub type rte_v128s32_t = [i32; 4usize];
/// 128 bits vector size to use with 64 bits elements.
///
/// a = (rte_v128s64_t){ a1, a2 }
pub type rte_v128s64_t = [i64; 2usize];
/// 256 bits vector size to use with 8 bits elements.
///
/// a = (rte_v256s8_t){ a00, a01, a02, a03, a04, a05, a06, a07,
/// a08, a09, a10, a11, a12, a13, a14, a15,
/// a16, a17, a18, a19, a20, a21, a22, a23,
/// a24, a25, a26, a27, a28, a29, a30, a31 }
pub type rte_v256s8_t = [i8; 32usize];
/// 256 bits vector size to use with 16 bits elements.
///
/// a = (rte_v256s16_t){ a00, a01, a02, a03, a04, a05, a06, a07,
/// a08, a09, a10, a11, a12, a13, a14, a15 }
pub type rte_v256s16_t = [i16; 16usize];
/// 256 bits vector size to use with 32 bits elements.
///
/// a = (rte_v256s32_t){ a0, a1, a2, a3, a4, a5, a6, a7 }
pub type rte_v256s32_t = [i32; 8usize];
/// 256 bits vector size to use with 64 bits elements.
///
/// a = (rte_v256s64_t){ a0, a1, a2, a3 }
pub type rte_v256s64_t = [i64; 4usize];
pub type __m64 = [::std::os::raw::c_longlong; 1usize];
pub type __v2si = [::std::os::raw::c_int; 2usize];
pub type __v4hi = [::std::os::raw::c_short; 4usize];
pub type __v8qi = [::std::os::raw::c_char; 8usize];
pub type __v4si = [::std::os::raw::c_int; 4usize];
pub type __v4sf = [f32; 4usize];
pub type __m128 = [f32; 4usize];
pub type __m128d = [f64; 2usize];
pub type __m128i = [::std::os::raw::c_longlong; 2usize];
pub type __v2df = [f64; 2usize];
pub type __v2di = [::std::os::raw::c_longlong; 2usize];
pub type __v8hi = [::std::os::raw::c_short; 8usize];
pub type __v16qi = [::std::os::raw::c_char; 16usize];
pub type __v16qs = [::std::os::raw::c_schar; 16usize];
pub type xmm_t = __m128i;
#[repr(C)]
#[derive(Copy)]
pub struct rte_xmm {
    pub x: __BindgenUnionField<xmm_t>,
    pub u8: __BindgenUnionField<[u8; 16usize]>,
    pub u16: __BindgenUnionField<[u16; 8usize]>,
    pub u32: __BindgenUnionField<[u32; 4usize]>,
    pub u64: __BindgenUnionField<[u64; 2usize]>,
    pub pd: __BindgenUnionField<[f64; 2usize]>,
    pub bindgen_union_field: [u8; 16usize],
}
#[test]
fn bindgen_test_layout_rte_xmm() {
    assert_eq!(::std::mem::size_of::<rte_xmm>() , 16usize , concat ! (
               "Size of: " , stringify ! ( rte_xmm ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_xmm ) ) . x as * const _ as usize } ,
                0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_xmm ) , "::" ,
                stringify ! ( x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_xmm ) ) . u8 as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_xmm ) , "::" ,
                stringify ! ( u8 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_xmm ) ) . u16 as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_xmm ) , "::" ,
                stringify ! ( u16 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_xmm ) ) . u32 as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_xmm ) , "::" ,
                stringify ! ( u32 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_xmm ) ) . u64 as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_xmm ) , "::" ,
                stringify ! ( u64 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_xmm ) ) . pd as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_xmm ) , "::" ,
                stringify ! ( pd ) ));
}
impl Clone for rte_xmm {
    fn clone(&self) -> Self { *self }
}
pub type rte_xmm_t = rte_xmm;
/// A structure used to store memory information.
#[repr(C)]
pub struct memory_info {
    pub name: [::std::os::raw::c_char; 256usize],
    pub size: u64,
}
#[test]
fn bindgen_test_layout_memory_info() {
    assert_eq!(::std::mem::size_of::<memory_info>() , 264usize , concat ! (
               "Size of: " , stringify ! ( memory_info ) ));
    assert_eq! (::std::mem::align_of::<memory_info>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( memory_info ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const memory_info ) ) . name as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( memory_info ) , "::" ,
                stringify ! ( name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const memory_info ) ) . size as * const _ as
                usize } , 256usize , concat ! (
                "Alignment of field: " , stringify ! ( memory_info ) , "::" ,
                stringify ! ( size ) ));
}
/// A structure used to store memory segment information.
#[repr(C)]
pub struct memseg_info {
    pub idx: u32,
    pub pfn: u64,
    pub size: u64,
    pub mfn: [u64; 2048usize],
}
#[test]
fn bindgen_test_layout_memseg_info() {
    assert_eq!(::std::mem::size_of::<memseg_info>() , 16408usize , concat ! (
               "Size of: " , stringify ! ( memseg_info ) ));
    assert_eq! (::std::mem::align_of::<memseg_info>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( memseg_info ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const memseg_info ) ) . idx as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( memseg_info ) , "::" ,
                stringify ! ( idx ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const memseg_info ) ) . pfn as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( memseg_info ) , "::" ,
                stringify ! ( pfn ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const memseg_info ) ) . size as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( memseg_info ) , "::" ,
                stringify ! ( size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const memseg_info ) ) . mfn as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( memseg_info ) , "::" ,
                stringify ! ( mfn ) ));
}
/// A structure used to store memory block information.
#[repr(C)]
#[derive(Debug, Copy)]
pub struct memblock_info {
    pub exchange_flag: u8,
    pub used: u8,
    pub vir_addr: u64,
    pub pfn: u64,
    pub mfn: u64,
}
#[test]
fn bindgen_test_layout_memblock_info() {
    assert_eq!(::std::mem::size_of::<memblock_info>() , 32usize , concat ! (
               "Size of: " , stringify ! ( memblock_info ) ));
    assert_eq! (::std::mem::align_of::<memblock_info>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( memblock_info ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const memblock_info ) ) . exchange_flag as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( memblock_info ) , "::"
                , stringify ! ( exchange_flag ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const memblock_info ) ) . used as * const _ as
                usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! ( memblock_info ) , "::"
                , stringify ! ( used ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const memblock_info ) ) . vir_addr as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( memblock_info ) , "::"
                , stringify ! ( vir_addr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const memblock_info ) ) . pfn as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( memblock_info ) , "::"
                , stringify ! ( pfn ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const memblock_info ) ) . mfn as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( memblock_info ) , "::"
                , stringify ! ( mfn ) ));
}
impl Clone for memblock_info {
    fn clone(&self) -> Self { *self }
}
#[repr(u64)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum rte_page_sizes {
    RTE_PGSIZE_4K = 4096,
    RTE_PGSIZE_64K = 65536,
    RTE_PGSIZE_256K = 262144,
    RTE_PGSIZE_2M = 2097152,
    RTE_PGSIZE_16M = 16777216,
    RTE_PGSIZE_256M = 268435456,
    RTE_PGSIZE_512M = 536870912,
    RTE_PGSIZE_1G = 1073741824,
    RTE_PGSIZE_4G = 4294967296,
    RTE_PGSIZE_16G = 17179869184,
}
pub type phys_addr_t = u64;
/// Physical memory segment descriptor.
#[repr(C, packed)]
#[derive(Debug, Copy)]
pub struct rte_memseg {
    /// < Start physical address.
    pub phys_addr: phys_addr_t,
    pub __bindgen_anon_1: rte_memseg__bindgen_ty_1,
    /// < Length of the segment.
    pub len: usize,
    /// < The pagesize of underlying memory
    pub hugepage_sz: u64,
    /// < NUMA socket ID.
    pub socket_id: i32,
    /// < Number of channels.
    pub nchannel: u32,
    /// < Number of ranks.
    pub nrank: u32,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_memseg__bindgen_ty_1 {
    /// < Start virtual address.
    pub addr: __BindgenUnionField<*mut ::std::os::raw::c_void>,
    /// < Makes sure addr is always 64 bits
    pub addr_64: __BindgenUnionField<u64>,
    pub bindgen_union_field: u64,
}
#[test]
fn bindgen_test_layout_rte_memseg__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<rte_memseg__bindgen_ty_1>() , 8usize ,
               concat ! (
               "Size of: " , stringify ! ( rte_memseg__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<rte_memseg__bindgen_ty_1>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( rte_memseg__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_memseg__bindgen_ty_1 ) ) . addr as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_memseg__bindgen_ty_1 ) , "::" , stringify ! ( addr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_memseg__bindgen_ty_1 ) ) . addr_64 as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_memseg__bindgen_ty_1 ) , "::" , stringify ! ( addr_64 )
                ));
}
impl Clone for rte_memseg__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_rte_memseg() {
    assert_eq!(::std::mem::size_of::<rte_memseg>() , 44usize , concat ! (
               "Size of: " , stringify ! ( rte_memseg ) ));
    assert_eq! (::std::mem::align_of::<rte_memseg>() , 1usize , concat ! (
                "Alignment of " , stringify ! ( rte_memseg ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_memseg ) ) . phys_addr as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_memseg ) , "::" ,
                stringify ! ( phys_addr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_memseg ) ) . len as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_memseg ) , "::" ,
                stringify ! ( len ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_memseg ) ) . hugepage_sz as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_memseg ) , "::" ,
                stringify ! ( hugepage_sz ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_memseg ) ) . socket_id as * const _
                as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_memseg ) , "::" ,
                stringify ! ( socket_id ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_memseg ) ) . nchannel as * const _ as
                usize } , 36usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_memseg ) , "::" ,
                stringify ! ( nchannel ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_memseg ) ) . nrank as * const _ as
                usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_memseg ) , "::" ,
                stringify ! ( nrank ) ));
}
impl Clone for rte_memseg {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    /// Lock page in physical memory and prevent from swapping.
///
/// @param virt
/// The virtual address.
/// @return
/// 0 on success, negative on error.
    pub fn rte_mem_lock_page(virt: *const ::std::os::raw::c_void)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /// Get physical address of any mapped virtual address in the current process.
/// It is found by browsing the /proc/self/pagemap special file.
/// The page must be locked.
///
/// @param virt
/// The virtual address.
/// @return
/// The physical address or RTE_BAD_PHYS_ADDR on error.
    pub fn rte_mem_virt2phy(virt: *const ::std::os::raw::c_void)
     -> phys_addr_t;
}
extern "C" {
    /// Get the layout of the available physical memory.
///
/// It can be useful for an application to have the full physical
/// memory layout to decide the size of a memory zone to reserve. This
/// table is stored in rte_config (see rte_eal_get_configuration()).
///
/// @return
/// - On success, return a pointer to a read-only table of struct
/// rte_physmem_desc elements, containing the layout of all
/// addressable physical memory. The last element of the table
/// contains a NULL address.
/// - On error, return NULL. This should not happen since it is a fatal
/// error that will probably cause the entire system to panic.
    pub fn rte_eal_get_physmem_layout() -> *const rte_memseg;
}
extern "C" {
    /// Dump the physical memory layout to a file.
///
/// @param f
/// A pointer to a file for output
    pub fn rte_dump_physmem_layout(f: *mut FILE);
}
extern "C" {
    /// Get the total amount of available physical memory.
///
/// @return
/// The total amount of available physical memory in bytes.
    pub fn rte_eal_get_physmem_size() -> u64;
}
extern "C" {
    /// Get the number of memory channels.
///
/// @return
/// The number of memory channels on the system. The value is 0 if unknown
/// or not the same on all devices.
    pub fn rte_memory_get_nchannel() -> ::std::os::raw::c_uint;
}
extern "C" {
    /// Get the number of memory ranks.
///
/// @return
/// The number of memory ranks on the system. The value is 0 if unknown or
/// not the same on all devices.
    pub fn rte_memory_get_nrank() -> ::std::os::raw::c_uint;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rte_log_dynamic_type {
    _unused: [u8; 0],
}
/// The rte_log structure.
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_logs {
    /// < Bitfield with enabled logs.
    pub type_: u32,
    /// < Log level.
    pub level: u32,
    /// < Output file set by rte_openlog_stream, or NULL.
    pub file: *mut FILE,
    pub dynamic_types_len: usize,
    pub dynamic_types: *mut rte_log_dynamic_type,
}
#[test]
fn bindgen_test_layout_rte_logs() {
    assert_eq!(::std::mem::size_of::<rte_logs>() , 32usize , concat ! (
               "Size of: " , stringify ! ( rte_logs ) ));
    assert_eq! (::std::mem::align_of::<rte_logs>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( rte_logs ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_logs ) ) . type_ as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_logs ) , "::" ,
                stringify ! ( type_ ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_logs ) ) . level as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_logs ) , "::" ,
                stringify ! ( level ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_logs ) ) . file as * const _ as usize
                } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_logs ) , "::" ,
                stringify ! ( file ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_logs ) ) . dynamic_types_len as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_logs ) , "::" ,
                stringify ! ( dynamic_types_len ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_logs ) ) . dynamic_types as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_logs ) , "::" ,
                stringify ! ( dynamic_types ) ));
}
impl Clone for rte_logs {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    #[link_name = "rte_logs"]
    pub static mut rte_logs: rte_logs;
}
extern "C" {
    /// Change the stream that will be used by the logging system.
///
/// This can be done at any time. The f argument represents the stream
/// to be used to send the logs. If f is NULL, the default output is
/// used (stderr).
///
/// @param f
/// Pointer to the stream.
/// @return
/// - 0 on success.
/// - Negative on error.
    pub fn rte_openlog_stream(f: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    /// Set the global log level.
///
/// After this call, logs with a level lower or equal than the level
/// passed as argument will be displayed.
///
/// @param level
/// Log level. A value between RTE_LOG_EMERG (1) and RTE_LOG_DEBUG (8).
    pub fn rte_log_set_global_level(level: u32);
}
extern "C" {
    /// Deprecated, replaced by rte_log_set_global_level().
    pub fn rte_set_log_level(level: u32);
}
extern "C" {
    /// Get the global log level.
///
/// @return
/// The current global log level.
    pub fn rte_log_get_global_level() -> u32;
}
extern "C" {
    /// Deprecated, replaced by rte_log_get_global_level().
    pub fn rte_get_log_level() -> u32;
}
extern "C" {
    /// Enable or disable the log type.
///
/// @param type
/// Log type, for example, RTE_LOGTYPE_EAL.
/// @param enable
/// True for enable; false for disable.
    pub fn rte_set_log_type(type_: u32, enable: ::std::os::raw::c_int);
}
extern "C" {
    /// Get the global log type.
    pub fn rte_get_log_type() -> u32;
}
extern "C" {
    /// Get the log level for a given type.
///
/// @param logtype
/// The log type identifier.
/// @return
/// 0 on success, a negative value if logtype is invalid.
    pub fn rte_log_get_level(logtype: u32) -> ::std::os::raw::c_int;
}
extern "C" {
    /// Set the log level for a given type.
///
/// @param pattern
/// The regexp identifying the log type.
/// @param level
/// The level to be set.
/// @return
/// 0 on success, a negative value if level is invalid.
    pub fn rte_log_set_level_regexp(pattern: *const ::std::os::raw::c_char,
                                    level: u32) -> ::std::os::raw::c_int;
}
extern "C" {
    /// Set the log level for a given type.
///
/// @param logtype
/// The log type identifier.
/// @param level
/// The level to be set.
/// @return
/// 0 on success, a negative value if logtype or level is invalid.
    pub fn rte_log_set_level(logtype: u32, level: u32)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /// Get the current loglevel for the message being processed.
///
/// Before calling the user-defined stream for logging, the log
/// subsystem sets a per-lcore variable containing the loglevel and the
/// logtype of the message being processed. This information can be
/// accessed by the user-defined log output function through this
/// function.
///
/// @return
/// The loglevel of the message being processed.
    pub fn rte_log_cur_msg_loglevel() -> ::std::os::raw::c_int;
}
extern "C" {
    /// Get the current logtype for the message being processed.
///
/// Before calling the user-defined stream for logging, the log
/// subsystem sets a per-lcore variable containing the loglevel and the
/// logtype of the message being processed. This information can be
/// accessed by the user-defined log output function through this
/// function.
///
/// @return
/// The logtype of the message being processed.
    pub fn rte_log_cur_msg_logtype() -> ::std::os::raw::c_int;
}
extern "C" {
    /// Register a dynamic log type
///
/// If a log is already registered with the same type, the returned value
/// is the same than the previous one.
///
/// @param name
/// The string identifying the log type.
/// @return
/// - >0: success, the returned value is the log type identifier.
/// - (-ENONEM): cannot allocate memory.
    pub fn rte_log_register(name: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /// Dump log information.
///
/// Dump the global level and the registered log types.
///
/// @param f
/// The output stream where the dump should be sent.
    pub fn rte_log_dump(f: *mut FILE);
}
extern "C" {
    /// Generates a log message.
///
/// The message will be sent in the stream defined by the previous call
/// to rte_openlog_stream().
///
/// The level argument determines if the log should be displayed or
/// not, depending on the global rte_logs variable.
///
/// The preferred alternative is the RTE_LOG() because it adds the
/// level and type in the logged string.
///
/// @param level
/// Log level. A value between RTE_LOG_EMERG (1) and RTE_LOG_DEBUG (8).
/// @param logtype
/// The log type, for example, RTE_LOGTYPE_EAL.
/// @param format
/// The format string, as in printf(3), followed by the variable arguments
/// required by the format.
/// @return
/// - 0: Success.
/// - Negative on error.
    pub fn rte_log(level: u32, logtype: u32,
                   format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /// Generates a log message.
///
/// The message will be sent in the stream defined by the previous call
/// to rte_openlog_stream().
///
/// The level argument determines if the log should be displayed or
/// not, depending on the global rte_logs variable. A trailing
/// newline may be added if needed.
///
/// The preferred alternative is the RTE_LOG() because it adds the
/// level and type in the logged string.
///
/// @param level
/// Log level. A value between RTE_LOG_EMERG (1) and RTE_LOG_DEBUG (8).
/// @param logtype
/// The log type, for example, RTE_LOGTYPE_EAL.
/// @param format
/// The format string, as in printf(3), followed by the variable arguments
/// required by the format.
/// @param ap
/// The va_list of the variable arguments required by the format.
/// @return
/// - 0: Success.
/// - Negative on error.
    pub fn rte_vlog(level: u32, logtype: u32,
                    format: *const ::std::os::raw::c_char,
                    ap: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
pub type rte_be16_t = u16;
pub type rte_be32_t = u32;
pub type rte_be64_t = u64;
pub type rte_le16_t = u16;
pub type rte_le32_t = u32;
pub type rte_le64_t = u64;
/// A structure describing a memzone, which is a contiguous portion of
/// physical memory identified by a name.
#[repr(C, packed)]
#[derive(Debug, Copy)]
pub struct rte_memzone {
    /// < Name of the memory zone.
    pub name: [::std::os::raw::c_char; 32usize],
    /// < Start physical address.
    pub phys_addr: phys_addr_t,
    pub __bindgen_anon_1: rte_memzone__bindgen_ty_1,
    /// < Length of the memzone.
    pub len: usize,
    /// < The page size of underlying memory
    pub hugepage_sz: u64,
    /// < NUMA socket ID.
    pub socket_id: i32,
    /// < Characteristics of this memzone.
    pub flags: u32,
    /// < Memseg it belongs.
    pub memseg_id: u32,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_memzone__bindgen_ty_1 {
    /// < Start virtual address.
    pub addr: __BindgenUnionField<*mut ::std::os::raw::c_void>,
    /// < Makes sure addr is always 64-bits
    pub addr_64: __BindgenUnionField<u64>,
    pub bindgen_union_field: u64,
}
#[test]
fn bindgen_test_layout_rte_memzone__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<rte_memzone__bindgen_ty_1>() , 8usize ,
               concat ! (
               "Size of: " , stringify ! ( rte_memzone__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<rte_memzone__bindgen_ty_1>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( rte_memzone__bindgen_ty_1 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_memzone__bindgen_ty_1 ) ) . addr as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_memzone__bindgen_ty_1 ) , "::" , stringify ! ( addr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_memzone__bindgen_ty_1 ) ) . addr_64
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_memzone__bindgen_ty_1 ) , "::" , stringify ! ( addr_64 )
                ));
}
impl Clone for rte_memzone__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_rte_memzone() {
    assert_eq!(::std::mem::size_of::<rte_memzone>() , 76usize , concat ! (
               "Size of: " , stringify ! ( rte_memzone ) ));
    assert_eq! (::std::mem::align_of::<rte_memzone>() , 1usize , concat ! (
                "Alignment of " , stringify ! ( rte_memzone ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_memzone ) ) . name as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_memzone ) , "::" ,
                stringify ! ( name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_memzone ) ) . phys_addr as * const _
                as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_memzone ) , "::" ,
                stringify ! ( phys_addr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_memzone ) ) . len as * const _ as
                usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_memzone ) , "::" ,
                stringify ! ( len ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_memzone ) ) . hugepage_sz as * const
                _ as usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_memzone ) , "::" ,
                stringify ! ( hugepage_sz ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_memzone ) ) . socket_id as * const _
                as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_memzone ) , "::" ,
                stringify ! ( socket_id ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_memzone ) ) . flags as * const _ as
                usize } , 68usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_memzone ) , "::" ,
                stringify ! ( flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_memzone ) ) . memseg_id as * const _
                as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_memzone ) , "::" ,
                stringify ! ( memseg_id ) ));
}
impl Clone for rte_memzone {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    /// Reserve a portion of physical memory.
///
/// This function reserves some memory and returns a pointer to a
/// correctly filled memzone descriptor. If the allocation cannot be
/// done, return NULL.
///
/// @param name
/// The name of the memzone. If it already exists, the function will
/// fail and return NULL.
/// @param len
/// The size of the memory to be reserved. If it
/// is 0, the biggest contiguous zone will be reserved.
/// @param socket_id
/// The socket identifier in the case of
/// NUMA. The value can be SOCKET_ID_ANY if there is no NUMA
/// constraint for the reserved zone.
/// @param flags
/// The flags parameter is used to request memzones to be
/// taken from specifically sized hugepages.
/// - RTE_MEMZONE_2MB - Reserved from 2MB pages
/// - RTE_MEMZONE_1GB - Reserved from 1GB pages
/// - RTE_MEMZONE_16MB - Reserved from 16MB pages
/// - RTE_MEMZONE_16GB - Reserved from 16GB pages
/// - RTE_MEMZONE_256KB - Reserved from 256KB pages
/// - RTE_MEMZONE_256MB - Reserved from 256MB pages
/// - RTE_MEMZONE_512MB - Reserved from 512MB pages
/// - RTE_MEMZONE_4GB - Reserved from 4GB pages
/// - RTE_MEMZONE_SIZE_HINT_ONLY - Allow alternative page size to be used if
/// the requested page size is unavailable.
/// If this flag is not set, the function
/// will return error on an unavailable size
/// request.
/// @return
/// A pointer to a correctly-filled read-only memzone descriptor, or NULL
/// on error.
/// On error case, rte_errno will be set appropriately:
/// - E_RTE_NO_CONFIG - function could not get pointer to rte_config structure
/// - E_RTE_SECONDARY - function was called from a secondary process instance
/// - ENOSPC - the maximum number of memzones has already been allocated
/// - EEXIST - a memzone with the same name already exists
/// - ENOMEM - no appropriate memory area found in which to create memzone
/// - EINVAL - invalid parameters
    pub fn rte_memzone_reserve(name: *const ::std::os::raw::c_char,
                               len: usize, socket_id: ::std::os::raw::c_int,
                               flags: ::std::os::raw::c_uint)
     -> *const rte_memzone;
}
extern "C" {
    /// Reserve a portion of physical memory with alignment on a specified
/// boundary.
///
/// This function reserves some memory with alignment on a specified
/// boundary, and returns a pointer to a correctly filled memzone
/// descriptor. If the allocation cannot be done or if the alignment
/// is not a power of 2, returns NULL.
///
/// @param name
/// The name of the memzone. If it already exists, the function will
/// fail and return NULL.
/// @param len
/// The size of the memory to be reserved. If it
/// is 0, the biggest contiguous zone will be reserved.
/// @param socket_id
/// The socket identifier in the case of
/// NUMA. The value can be SOCKET_ID_ANY if there is no NUMA
/// constraint for the reserved zone.
/// @param flags
/// The flags parameter is used to request memzones to be
/// taken from specifically sized hugepages.
/// - RTE_MEMZONE_2MB - Reserved from 2MB pages
/// - RTE_MEMZONE_1GB - Reserved from 1GB pages
/// - RTE_MEMZONE_16MB - Reserved from 16MB pages
/// - RTE_MEMZONE_16GB - Reserved from 16GB pages
/// - RTE_MEMZONE_256KB - Reserved from 256KB pages
/// - RTE_MEMZONE_256MB - Reserved from 256MB pages
/// - RTE_MEMZONE_512MB - Reserved from 512MB pages
/// - RTE_MEMZONE_4GB - Reserved from 4GB pages
/// - RTE_MEMZONE_SIZE_HINT_ONLY - Allow alternative page size to be used if
/// the requested page size is unavailable.
/// If this flag is not set, the function
/// will return error on an unavailable size
/// request.
/// @param align
/// Alignment for resulting memzone. Must be a power of 2.
/// @return
/// A pointer to a correctly-filled read-only memzone descriptor, or NULL
/// on error.
/// On error case, rte_errno will be set appropriately:
/// - E_RTE_NO_CONFIG - function could not get pointer to rte_config structure
/// - E_RTE_SECONDARY - function was called from a secondary process instance
/// - ENOSPC - the maximum number of memzones has already been allocated
/// - EEXIST - a memzone with the same name already exists
/// - ENOMEM - no appropriate memory area found in which to create memzone
/// - EINVAL - invalid parameters
    pub fn rte_memzone_reserve_aligned(name: *const ::std::os::raw::c_char,
                                       len: usize,
                                       socket_id: ::std::os::raw::c_int,
                                       flags: ::std::os::raw::c_uint,
                                       align: ::std::os::raw::c_uint)
     -> *const rte_memzone;
}
extern "C" {
    /// Reserve a portion of physical memory with specified alignment and
/// boundary.
///
/// This function reserves some memory with specified alignment and
/// boundary, and returns a pointer to a correctly filled memzone
/// descriptor. If the allocation cannot be done or if the alignment
/// or boundary are not a power of 2, returns NULL.
/// Memory buffer is reserved in a way, that it wouldn't cross specified
/// boundary. That implies that requested length should be less or equal
/// then boundary.
///
/// @param name
/// The name of the memzone. If it already exists, the function will
/// fail and return NULL.
/// @param len
/// The size of the memory to be reserved. If it
/// is 0, the biggest contiguous zone will be reserved.
/// @param socket_id
/// The socket identifier in the case of
/// NUMA. The value can be SOCKET_ID_ANY if there is no NUMA
/// constraint for the reserved zone.
/// @param flags
/// The flags parameter is used to request memzones to be
/// taken from specifically sized hugepages.
/// - RTE_MEMZONE_2MB - Reserved from 2MB pages
/// - RTE_MEMZONE_1GB - Reserved from 1GB pages
/// - RTE_MEMZONE_16MB - Reserved from 16MB pages
/// - RTE_MEMZONE_16GB - Reserved from 16GB pages
/// - RTE_MEMZONE_256KB - Reserved from 256KB pages
/// - RTE_MEMZONE_256MB - Reserved from 256MB pages
/// - RTE_MEMZONE_512MB - Reserved from 512MB pages
/// - RTE_MEMZONE_4GB - Reserved from 4GB pages
/// - RTE_MEMZONE_SIZE_HINT_ONLY - Allow alternative page size to be used if
/// the requested page size is unavailable.
/// If this flag is not set, the function
/// will return error on an unavailable size
/// request.
/// @param align
/// Alignment for resulting memzone. Must be a power of 2.
/// @param bound
/// Boundary for resulting memzone. Must be a power of 2 or zero.
/// Zero value implies no boundary condition.
/// @return
/// A pointer to a correctly-filled read-only memzone descriptor, or NULL
/// on error.
/// On error case, rte_errno will be set appropriately:
/// - E_RTE_NO_CONFIG - function could not get pointer to rte_config structure
/// - E_RTE_SECONDARY - function was called from a secondary process instance
/// - ENOSPC - the maximum number of memzones has already been allocated
/// - EEXIST - a memzone with the same name already exists
/// - ENOMEM - no appropriate memory area found in which to create memzone
/// - EINVAL - invalid parameters
    pub fn rte_memzone_reserve_bounded(name: *const ::std::os::raw::c_char,
                                       len: usize,
                                       socket_id: ::std::os::raw::c_int,
                                       flags: ::std::os::raw::c_uint,
                                       align: ::std::os::raw::c_uint,
                                       bound: ::std::os::raw::c_uint)
     -> *const rte_memzone;
}
extern "C" {
    /// Free a memzone.
///
/// @param mz
/// A pointer to the memzone
/// @return
/// -EINVAL - invalid parameter.
/// 0 - success
    pub fn rte_memzone_free(mz: *const rte_memzone) -> ::std::os::raw::c_int;
}
extern "C" {
    /// Lookup for a memzone.
///
/// Get a pointer to a descriptor of an already reserved memory
/// zone identified by the name given as an argument.
///
/// @param name
/// The name of the memzone.
/// @return
/// A pointer to a read-only memzone descriptor.
    pub fn rte_memzone_lookup(name: *const ::std::os::raw::c_char)
     -> *const rte_memzone;
}
extern "C" {
    /// Dump all reserved memzones to a file.
///
/// @param f
/// A pointer to a file for output
    pub fn rte_memzone_dump(f: *mut FILE);
}
extern "C" {
    /// Walk list of all memzones
///
/// @param func
/// Iterator function
/// @param arg
/// Argument passed to iterator
    pub fn rte_memzone_walk(func:
                                ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                               *const rte_memzone,
                                                                           arg:
                                                                               *mut ::std::os::raw::c_void)>,
                            arg: *mut ::std::os::raw::c_void);
}
/// Structure to hold heap statistics obtained from rte_malloc_get_socket_stats function.
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_malloc_socket_stats {
    /// < Total bytes on heap
    pub heap_totalsz_bytes: usize,
    /// < Total free bytes on heap
    pub heap_freesz_bytes: usize,
    /// < Size in bytes of largest free block
    pub greatest_free_size: usize,
    /// < Number of free elements on heap
    pub free_count: ::std::os::raw::c_uint,
    /// < Number of allocated elements on heap
    pub alloc_count: ::std::os::raw::c_uint,
    /// < Total allocated bytes on heap
    pub heap_allocsz_bytes: usize,
}
#[test]
fn bindgen_test_layout_rte_malloc_socket_stats() {
    assert_eq!(::std::mem::size_of::<rte_malloc_socket_stats>() , 40usize ,
               concat ! (
               "Size of: " , stringify ! ( rte_malloc_socket_stats ) ));
    assert_eq! (::std::mem::align_of::<rte_malloc_socket_stats>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( rte_malloc_socket_stats ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_malloc_socket_stats ) ) .
                heap_totalsz_bytes as * const _ as usize } , 0usize , concat !
                (
                "Alignment of field: " , stringify ! ( rte_malloc_socket_stats
                ) , "::" , stringify ! ( heap_totalsz_bytes ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_malloc_socket_stats ) ) .
                heap_freesz_bytes as * const _ as usize } , 8usize , concat !
                (
                "Alignment of field: " , stringify ! ( rte_malloc_socket_stats
                ) , "::" , stringify ! ( heap_freesz_bytes ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_malloc_socket_stats ) ) .
                greatest_free_size as * const _ as usize } , 16usize , concat
                ! (
                "Alignment of field: " , stringify ! ( rte_malloc_socket_stats
                ) , "::" , stringify ! ( greatest_free_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_malloc_socket_stats ) ) . free_count
                as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_malloc_socket_stats
                ) , "::" , stringify ! ( free_count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_malloc_socket_stats ) ) . alloc_count
                as * const _ as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_malloc_socket_stats
                ) , "::" , stringify ! ( alloc_count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_malloc_socket_stats ) ) .
                heap_allocsz_bytes as * const _ as usize } , 32usize , concat
                ! (
                "Alignment of field: " , stringify ! ( rte_malloc_socket_stats
                ) , "::" , stringify ! ( heap_allocsz_bytes ) ));
}
impl Clone for rte_malloc_socket_stats {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    /// This function allocates memory from the huge-page area of memory. The memory
/// is not cleared. In NUMA systems, the memory allocated resides on the same
/// NUMA socket as the core that calls this function.
///
/// @param type
/// A string identifying the type of allocated objects (useful for debug
/// purposes, such as identifying the cause of a memory leak). Can be NULL.
/// @param size
/// Size (in bytes) to be allocated.
/// @param align
/// If 0, the return is a pointer that is suitably aligned for any kind of
/// variable (in the same manner as malloc()).
/// Otherwise, the return is a pointer that is a multiple of *align*. In
/// this case, it must be a power of two. (Minimum alignment is the
/// cacheline size, i.e. 64-bytes)
/// @return
/// - NULL on error. Not enough memory, or invalid arguments (size is 0,
/// align is not a power of two).
/// - Otherwise, the pointer to the allocated object.
    pub fn rte_malloc(type_: *const ::std::os::raw::c_char, size: usize,
                      align: ::std::os::raw::c_uint)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    /// Allocate zero'ed memory from the heap.
///
/// Equivalent to rte_malloc() except that the memory zone is
/// initialised with zeros. In NUMA systems, the memory allocated resides on the
/// same NUMA socket as the core that calls this function.
///
/// @param type
/// A string identifying the type of allocated objects (useful for debug
/// purposes, such as identifying the cause of a memory leak). Can be NULL.
/// @param size
/// Size (in bytes) to be allocated.
/// @param align
/// If 0, the return is a pointer that is suitably aligned for any kind of
/// variable (in the same manner as malloc()).
/// Otherwise, the return is a pointer that is a multiple of *align*. In
/// this case, it must obviously be a power of two. (Minimum alignment is the
/// cacheline size, i.e. 64-bytes)
/// @return
/// - NULL on error. Not enough memory, or invalid arguments (size is 0,
/// align is not a power of two).
/// - Otherwise, the pointer to the allocated object.
    pub fn rte_zmalloc(type_: *const ::std::os::raw::c_char, size: usize,
                       align: ::std::os::raw::c_uint)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    /// Replacement function for calloc(), using huge-page memory. Memory area is
/// initialised with zeros. In NUMA systems, the memory allocated resides on the
/// same NUMA socket as the core that calls this function.
///
/// @param type
/// A string identifying the type of allocated objects (useful for debug
/// purposes, such as identifying the cause of a memory leak). Can be NULL.
/// @param num
/// Number of elements to be allocated.
/// @param size
/// Size (in bytes) of a single element.
/// @param align
/// If 0, the return is a pointer that is suitably aligned for any kind of
/// variable (in the same manner as malloc()).
/// Otherwise, the return is a pointer that is a multiple of *align*. In
/// this case, it must obviously be a power of two. (Minimum alignment is the
/// cacheline size, i.e. 64-bytes)
/// @return
/// - NULL on error. Not enough memory, or invalid arguments (size is 0,
/// align is not a power of two).
/// - Otherwise, the pointer to the allocated object.
    pub fn rte_calloc(type_: *const ::std::os::raw::c_char, num: usize,
                      size: usize, align: ::std::os::raw::c_uint)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    /// Replacement function for realloc(), using huge-page memory. Reserved area
/// memory is resized, preserving contents. In NUMA systems, the new area
/// resides on the same NUMA socket as the old area.
///
/// @param ptr
/// Pointer to already allocated memory
/// @param size
/// Size (in bytes) of new area. If this is 0, memory is freed.
/// @param align
/// If 0, the return is a pointer that is suitably aligned for any kind of
/// variable (in the same manner as malloc()).
/// Otherwise, the return is a pointer that is a multiple of *align*. In
/// this case, it must obviously be a power of two. (Minimum alignment is the
/// cacheline size, i.e. 64-bytes)
/// @return
/// - NULL on error. Not enough memory, or invalid arguments (size is 0,
/// align is not a power of two).
/// - Otherwise, the pointer to the reallocated memory.
    pub fn rte_realloc(ptr: *mut ::std::os::raw::c_void, size: usize,
                       align: ::std::os::raw::c_uint)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    /// This function allocates memory from the huge-page area of memory. The memory
/// is not cleared.
///
/// @param type
/// A string identifying the type of allocated objects (useful for debug
/// purposes, such as identifying the cause of a memory leak). Can be NULL.
/// @param size
/// Size (in bytes) to be allocated.
/// @param align
/// If 0, the return is a pointer that is suitably aligned for any kind of
/// variable (in the same manner as malloc()).
/// Otherwise, the return is a pointer that is a multiple of *align*. In
/// this case, it must be a power of two. (Minimum alignment is the
/// cacheline size, i.e. 64-bytes)
/// @param socket
/// NUMA socket to allocate memory on. If SOCKET_ID_ANY is used, this function
/// will behave the same as rte_malloc().
/// @return
/// - NULL on error. Not enough memory, or invalid arguments (size is 0,
/// align is not a power of two).
/// - Otherwise, the pointer to the allocated object.
    pub fn rte_malloc_socket(type_: *const ::std::os::raw::c_char,
                             size: usize, align: ::std::os::raw::c_uint,
                             socket: ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    /// Allocate zero'ed memory from the heap.
///
/// Equivalent to rte_malloc() except that the memory zone is
/// initialised with zeros.
///
/// @param type
/// A string identifying the type of allocated objects (useful for debug
/// purposes, such as identifying the cause of a memory leak). Can be NULL.
/// @param size
/// Size (in bytes) to be allocated.
/// @param align
/// If 0, the return is a pointer that is suitably aligned for any kind of
/// variable (in the same manner as malloc()).
/// Otherwise, the return is a pointer that is a multiple of *align*. In
/// this case, it must obviously be a power of two. (Minimum alignment is the
/// cacheline size, i.e. 64-bytes)
/// @param socket
/// NUMA socket to allocate memory on. If SOCKET_ID_ANY is used, this function
/// will behave the same as rte_zmalloc().
/// @return
/// - NULL on error. Not enough memory, or invalid arguments (size is 0,
/// align is not a power of two).
/// - Otherwise, the pointer to the allocated object.
    pub fn rte_zmalloc_socket(type_: *const ::std::os::raw::c_char,
                              size: usize, align: ::std::os::raw::c_uint,
                              socket: ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    /// Replacement function for calloc(), using huge-page memory. Memory area is
/// initialised with zeros.
///
/// @param type
/// A string identifying the type of allocated objects (useful for debug
/// purposes, such as identifying the cause of a memory leak). Can be NULL.
/// @param num
/// Number of elements to be allocated.
/// @param size
/// Size (in bytes) of a single element.
/// @param align
/// If 0, the return is a pointer that is suitably aligned for any kind of
/// variable (in the same manner as malloc()).
/// Otherwise, the return is a pointer that is a multiple of *align*. In
/// this case, it must obviously be a power of two. (Minimum alignment is the
/// cacheline size, i.e. 64-bytes)
/// @param socket
/// NUMA socket to allocate memory on. If SOCKET_ID_ANY is used, this function
/// will behave the same as rte_calloc().
/// @return
/// - NULL on error. Not enough memory, or invalid arguments (size is 0,
/// align is not a power of two).
/// - Otherwise, the pointer to the allocated object.
    pub fn rte_calloc_socket(type_: *const ::std::os::raw::c_char, num: usize,
                             size: usize, align: ::std::os::raw::c_uint,
                             socket: ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    /// Frees the memory space pointed to by the provided pointer.
///
/// This pointer must have been returned by a previous call to
/// rte_malloc(), rte_zmalloc(), rte_calloc() or rte_realloc(). The behaviour of
/// rte_free() is undefined if the pointer does not match this requirement.
///
/// If the pointer is NULL, the function does nothing.
///
/// @param ptr
/// The pointer to memory to be freed.
    pub fn rte_free(ptr: *mut ::std::os::raw::c_void);
}
extern "C" {
    /// If malloc debug is enabled, check a memory block for header
/// and trailer markers to indicate that all is well with the block.
/// If size is non-null, also return the size of the block.
///
/// @param ptr
/// pointer to the start of a data block, must have been returned
/// by a previous call to rte_malloc(), rte_zmalloc(), rte_calloc()
/// or rte_realloc()
/// @param size
/// if non-null, and memory block pointer is valid, returns the size
/// of the memory block
/// @return
/// -1 on error, invalid pointer passed or header and trailer markers
/// are missing or corrupted
/// 0 on success
    pub fn rte_malloc_validate(ptr: *const ::std::os::raw::c_void,
                               size: *mut usize) -> ::std::os::raw::c_int;
}
extern "C" {
    /// Get heap statistics for the specified heap.
///
/// @param socket
/// An unsigned integer specifying the socket to get heap statistics for
/// @param socket_stats
/// A structure which provides memory to store statistics
/// @return
/// Null on error
/// Pointer to structure storing statistics on success
    pub fn rte_malloc_get_socket_stats(socket: ::std::os::raw::c_int,
                                       socket_stats:
                                           *mut rte_malloc_socket_stats)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /// Dump statistics.
///
/// Dump for the specified type to a file. If the type argument is
/// NULL, all memory types will be dumped.
///
/// @param f
/// A pointer to a file for output
/// @param type
/// A string identifying the type of objects to dump, or NULL
/// to dump all objects.
    pub fn rte_malloc_dump_stats(f: *mut FILE,
                                 type_: *const ::std::os::raw::c_char);
}
extern "C" {
    /// Set the maximum amount of allocated memory for this type.
///
/// This is not yet implemented
///
/// @param type
/// A string identifying the type of allocated objects.
/// @param max
/// The maximum amount of allocated bytes for this type.
/// @return
/// - 0: Success.
/// - (-1): Error.
    pub fn rte_malloc_set_limit(type_: *const ::std::os::raw::c_char,
                                max: usize) -> ::std::os::raw::c_int;
}
extern "C" {
    /// Return the physical address of a virtual address obtained through
/// rte_malloc
///
/// @param addr
/// Address obtained from a previous rte_malloc call
/// @return
/// RTE_BAD_PHYS_ADDR on error
/// otherwise return physical address of the buffer
    pub fn rte_malloc_virt2phy(addr: *const ::std::os::raw::c_void)
     -> phys_addr_t;
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct sched_param {
    pub __sched_priority: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_sched_param() {
    assert_eq!(::std::mem::size_of::<sched_param>() , 4usize , concat ! (
               "Size of: " , stringify ! ( sched_param ) ));
    assert_eq! (::std::mem::align_of::<sched_param>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( sched_param ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sched_param ) ) . __sched_priority as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( sched_param ) , "::" ,
                stringify ! ( __sched_priority ) ));
}
impl Clone for sched_param {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __sched_param {
    pub __sched_priority: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___sched_param() {
    assert_eq!(::std::mem::size_of::<__sched_param>() , 4usize , concat ! (
               "Size of: " , stringify ! ( __sched_param ) ));
    assert_eq! (::std::mem::align_of::<__sched_param>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( __sched_param ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __sched_param ) ) . __sched_priority as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __sched_param ) , "::"
                , stringify ! ( __sched_priority ) ));
}
impl Clone for __sched_param {
    fn clone(&self) -> Self { *self }
}
pub type __cpu_mask = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct cpu_set_t {
    pub __bits: [__cpu_mask; 16usize],
}
#[test]
fn bindgen_test_layout_cpu_set_t() {
    assert_eq!(::std::mem::size_of::<cpu_set_t>() , 128usize , concat ! (
               "Size of: " , stringify ! ( cpu_set_t ) ));
    assert_eq! (::std::mem::align_of::<cpu_set_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( cpu_set_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cpu_set_t ) ) . __bits as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( cpu_set_t ) , "::" ,
                stringify ! ( __bits ) ));
}
impl Clone for cpu_set_t {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn __sched_cpucount(__setsize: usize, __setp: *const cpu_set_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __sched_cpualloc(__count: usize) -> *mut cpu_set_t;
}
extern "C" {
    pub fn __sched_cpufree(__set: *mut cpu_set_t);
}
extern "C" {
    pub fn sched_setparam(__pid: __pid_t, __param: *const sched_param)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sched_getparam(__pid: __pid_t, __param: *mut sched_param)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sched_setscheduler(__pid: __pid_t, __policy: ::std::os::raw::c_int,
                              __param: *const sched_param)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sched_getscheduler(__pid: __pid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sched_yield() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sched_get_priority_max(__algorithm: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sched_get_priority_min(__algorithm: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sched_rr_get_interval(__pid: __pid_t, __t: *mut timespec)
     -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct tm {
    pub tm_sec: ::std::os::raw::c_int,
    pub tm_min: ::std::os::raw::c_int,
    pub tm_hour: ::std::os::raw::c_int,
    pub tm_mday: ::std::os::raw::c_int,
    pub tm_mon: ::std::os::raw::c_int,
    pub tm_year: ::std::os::raw::c_int,
    pub tm_wday: ::std::os::raw::c_int,
    pub tm_yday: ::std::os::raw::c_int,
    pub tm_isdst: ::std::os::raw::c_int,
    pub tm_gmtoff: ::std::os::raw::c_long,
    pub tm_zone: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_tm() {
    assert_eq!(::std::mem::size_of::<tm>() , 56usize , concat ! (
               "Size of: " , stringify ! ( tm ) ));
    assert_eq! (::std::mem::align_of::<tm>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( tm ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tm ) ) . tm_sec as * const _ as usize } ,
                0usize , concat ! (
                "Alignment of field: " , stringify ! ( tm ) , "::" , stringify
                ! ( tm_sec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tm ) ) . tm_min as * const _ as usize } ,
                4usize , concat ! (
                "Alignment of field: " , stringify ! ( tm ) , "::" , stringify
                ! ( tm_min ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tm ) ) . tm_hour as * const _ as usize }
                , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( tm ) , "::" , stringify
                ! ( tm_hour ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tm ) ) . tm_mday as * const _ as usize }
                , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( tm ) , "::" , stringify
                ! ( tm_mday ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tm ) ) . tm_mon as * const _ as usize } ,
                16usize , concat ! (
                "Alignment of field: " , stringify ! ( tm ) , "::" , stringify
                ! ( tm_mon ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tm ) ) . tm_year as * const _ as usize }
                , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( tm ) , "::" , stringify
                ! ( tm_year ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tm ) ) . tm_wday as * const _ as usize }
                , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( tm ) , "::" , stringify
                ! ( tm_wday ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tm ) ) . tm_yday as * const _ as usize }
                , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( tm ) , "::" , stringify
                ! ( tm_yday ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tm ) ) . tm_isdst as * const _ as usize }
                , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( tm ) , "::" , stringify
                ! ( tm_isdst ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tm ) ) . tm_gmtoff as * const _ as usize
                } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( tm ) , "::" , stringify
                ! ( tm_gmtoff ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tm ) ) . tm_zone as * const _ as usize }
                , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( tm ) , "::" , stringify
                ! ( tm_zone ) ));
}
impl Clone for tm {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct itimerspec {
    pub it_interval: timespec,
    pub it_value: timespec,
}
#[test]
fn bindgen_test_layout_itimerspec() {
    assert_eq!(::std::mem::size_of::<itimerspec>() , 32usize , concat ! (
               "Size of: " , stringify ! ( itimerspec ) ));
    assert_eq! (::std::mem::align_of::<itimerspec>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( itimerspec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const itimerspec ) ) . it_interval as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( itimerspec ) , "::" ,
                stringify ! ( it_interval ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const itimerspec ) ) . it_value as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( itimerspec ) , "::" ,
                stringify ! ( it_value ) ));
}
impl Clone for itimerspec {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigevent {
    _unused: [u8; 0],
}
extern "C" {
    pub fn clock() -> clock_t;
}
extern "C" {
    pub fn time(__timer: *mut time_t) -> time_t;
}
extern "C" {
    pub fn difftime(__time1: time_t, __time0: time_t) -> f64;
}
extern "C" {
    pub fn mktime(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn strftime(__s: *mut ::std::os::raw::c_char, __maxsize: usize,
                    __format: *const ::std::os::raw::c_char, __tp: *const tm)
     -> usize;
}
extern "C" {
    pub fn strftime_l(__s: *mut ::std::os::raw::c_char, __maxsize: usize,
                      __format: *const ::std::os::raw::c_char,
                      __tp: *const tm, __loc: __locale_t) -> usize;
}
extern "C" {
    pub fn gmtime(__timer: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn localtime(__timer: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn gmtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn localtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn asctime(__tp: *const tm) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ctime(__timer: *const time_t) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn asctime_r(__tp: *const tm, __buf: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ctime_r(__timer: *const time_t, __buf: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[link_name = "__tzname"]
    pub static mut __tzname: [*mut ::std::os::raw::c_char; 2usize];
}
extern "C" {
    #[link_name = "__daylight"]
    pub static mut __daylight: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "__timezone"]
    pub static mut __timezone: ::std::os::raw::c_long;
}
extern "C" {
    #[link_name = "tzname"]
    pub static mut tzname: [*mut ::std::os::raw::c_char; 2usize];
}
extern "C" {
    pub fn tzset();
}
extern "C" {
    #[link_name = "daylight"]
    pub static mut daylight: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "timezone"]
    pub static mut timezone: ::std::os::raw::c_long;
}
extern "C" {
    pub fn stime(__when: *const time_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timegm(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn timelocal(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn dysize(__year: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nanosleep(__requested_time: *const timespec,
                     __remaining: *mut timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_getres(__clock_id: clockid_t, __res: *mut timespec)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_gettime(__clock_id: clockid_t, __tp: *mut timespec)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_settime(__clock_id: clockid_t, __tp: *const timespec)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_nanosleep(__clock_id: clockid_t,
                           __flags: ::std::os::raw::c_int,
                           __req: *const timespec, __rem: *mut timespec)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_getcpuclockid(__pid: pid_t, __clock_id: *mut clockid_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_create(__clock_id: clockid_t, __evp: *mut sigevent,
                        __timerid: *mut timer_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_delete(__timerid: timer_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_settime(__timerid: timer_t, __flags: ::std::os::raw::c_int,
                         __value: *const itimerspec,
                         __ovalue: *mut itimerspec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_gettime(__timerid: timer_t, __value: *mut itimerspec)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_getoverrun(__timerid: timer_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timespec_get(__ts: *mut timespec, __base: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
pub type __jmp_buf = [::std::os::raw::c_long; 8usize];
pub const PTHREAD_CREATE_JOINABLE: _bindgen_ty_8 =
    _bindgen_ty_8::PTHREAD_CREATE_JOINABLE;
pub const PTHREAD_CREATE_DETACHED: _bindgen_ty_8 =
    _bindgen_ty_8::PTHREAD_CREATE_DETACHED;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_8 {
    PTHREAD_CREATE_JOINABLE = 0,
    PTHREAD_CREATE_DETACHED = 1,
}
pub const PTHREAD_MUTEX_TIMED_NP: _bindgen_ty_9 =
    _bindgen_ty_9::PTHREAD_MUTEX_TIMED_NP;
pub const PTHREAD_MUTEX_RECURSIVE_NP: _bindgen_ty_9 =
    _bindgen_ty_9::PTHREAD_MUTEX_RECURSIVE_NP;
pub const PTHREAD_MUTEX_ERRORCHECK_NP: _bindgen_ty_9 =
    _bindgen_ty_9::PTHREAD_MUTEX_ERRORCHECK_NP;
pub const PTHREAD_MUTEX_ADAPTIVE_NP: _bindgen_ty_9 =
    _bindgen_ty_9::PTHREAD_MUTEX_ADAPTIVE_NP;
pub const PTHREAD_MUTEX_NORMAL: _bindgen_ty_9 =
    _bindgen_ty_9::PTHREAD_MUTEX_TIMED_NP;
pub const PTHREAD_MUTEX_RECURSIVE: _bindgen_ty_9 =
    _bindgen_ty_9::PTHREAD_MUTEX_RECURSIVE_NP;
pub const PTHREAD_MUTEX_ERRORCHECK: _bindgen_ty_9 =
    _bindgen_ty_9::PTHREAD_MUTEX_ERRORCHECK_NP;
pub const PTHREAD_MUTEX_DEFAULT: _bindgen_ty_9 =
    _bindgen_ty_9::PTHREAD_MUTEX_TIMED_NP;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_9 {
    PTHREAD_MUTEX_TIMED_NP = 0,
    PTHREAD_MUTEX_RECURSIVE_NP = 1,
    PTHREAD_MUTEX_ERRORCHECK_NP = 2,
    PTHREAD_MUTEX_ADAPTIVE_NP = 3,
}
pub const PTHREAD_MUTEX_STALLED: _bindgen_ty_10 =
    _bindgen_ty_10::PTHREAD_MUTEX_STALLED;
pub const PTHREAD_MUTEX_STALLED_NP: _bindgen_ty_10 =
    _bindgen_ty_10::PTHREAD_MUTEX_STALLED;
pub const PTHREAD_MUTEX_ROBUST: _bindgen_ty_10 =
    _bindgen_ty_10::PTHREAD_MUTEX_ROBUST;
pub const PTHREAD_MUTEX_ROBUST_NP: _bindgen_ty_10 =
    _bindgen_ty_10::PTHREAD_MUTEX_ROBUST;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_10 {
    PTHREAD_MUTEX_STALLED = 0,
    PTHREAD_MUTEX_ROBUST = 1,
}
pub const PTHREAD_PRIO_NONE: _bindgen_ty_11 =
    _bindgen_ty_11::PTHREAD_PRIO_NONE;
pub const PTHREAD_PRIO_INHERIT: _bindgen_ty_11 =
    _bindgen_ty_11::PTHREAD_PRIO_INHERIT;
pub const PTHREAD_PRIO_PROTECT: _bindgen_ty_11 =
    _bindgen_ty_11::PTHREAD_PRIO_PROTECT;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_11 {
    PTHREAD_PRIO_NONE = 0,
    PTHREAD_PRIO_INHERIT = 1,
    PTHREAD_PRIO_PROTECT = 2,
}
pub const PTHREAD_RWLOCK_PREFER_READER_NP: _bindgen_ty_12 =
    _bindgen_ty_12::PTHREAD_RWLOCK_PREFER_READER_NP;
pub const PTHREAD_RWLOCK_PREFER_WRITER_NP: _bindgen_ty_12 =
    _bindgen_ty_12::PTHREAD_RWLOCK_PREFER_WRITER_NP;
pub const PTHREAD_RWLOCK_PREFER_WRITER_NONRECURSIVE_NP: _bindgen_ty_12 =
    _bindgen_ty_12::PTHREAD_RWLOCK_PREFER_WRITER_NONRECURSIVE_NP;
pub const PTHREAD_RWLOCK_DEFAULT_NP: _bindgen_ty_12 =
    _bindgen_ty_12::PTHREAD_RWLOCK_PREFER_READER_NP;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_12 {
    PTHREAD_RWLOCK_PREFER_READER_NP = 0,
    PTHREAD_RWLOCK_PREFER_WRITER_NP = 1,
    PTHREAD_RWLOCK_PREFER_WRITER_NONRECURSIVE_NP = 2,
}
pub const PTHREAD_INHERIT_SCHED: _bindgen_ty_13 =
    _bindgen_ty_13::PTHREAD_INHERIT_SCHED;
pub const PTHREAD_EXPLICIT_SCHED: _bindgen_ty_13 =
    _bindgen_ty_13::PTHREAD_EXPLICIT_SCHED;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_13 {
    PTHREAD_INHERIT_SCHED = 0,
    PTHREAD_EXPLICIT_SCHED = 1,
}
pub const PTHREAD_SCOPE_SYSTEM: _bindgen_ty_14 =
    _bindgen_ty_14::PTHREAD_SCOPE_SYSTEM;
pub const PTHREAD_SCOPE_PROCESS: _bindgen_ty_14 =
    _bindgen_ty_14::PTHREAD_SCOPE_PROCESS;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_14 {
    PTHREAD_SCOPE_SYSTEM = 0,
    PTHREAD_SCOPE_PROCESS = 1,
}
pub const PTHREAD_PROCESS_PRIVATE: _bindgen_ty_15 =
    _bindgen_ty_15::PTHREAD_PROCESS_PRIVATE;
pub const PTHREAD_PROCESS_SHARED: _bindgen_ty_15 =
    _bindgen_ty_15::PTHREAD_PROCESS_SHARED;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_15 {
    PTHREAD_PROCESS_PRIVATE = 0,
    PTHREAD_PROCESS_SHARED = 1,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct _pthread_cleanup_buffer {
    pub __routine: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                  *mut ::std::os::raw::c_void)>,
    pub __arg: *mut ::std::os::raw::c_void,
    pub __canceltype: ::std::os::raw::c_int,
    pub __prev: *mut _pthread_cleanup_buffer,
}
#[test]
fn bindgen_test_layout__pthread_cleanup_buffer() {
    assert_eq!(::std::mem::size_of::<_pthread_cleanup_buffer>() , 32usize ,
               concat ! (
               "Size of: " , stringify ! ( _pthread_cleanup_buffer ) ));
    assert_eq! (::std::mem::align_of::<_pthread_cleanup_buffer>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( _pthread_cleanup_buffer ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _pthread_cleanup_buffer ) ) . __routine
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _pthread_cleanup_buffer
                ) , "::" , stringify ! ( __routine ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _pthread_cleanup_buffer ) ) . __arg as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _pthread_cleanup_buffer
                ) , "::" , stringify ! ( __arg ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _pthread_cleanup_buffer ) ) .
                __canceltype as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( _pthread_cleanup_buffer
                ) , "::" , stringify ! ( __canceltype ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _pthread_cleanup_buffer ) ) . __prev as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( _pthread_cleanup_buffer
                ) , "::" , stringify ! ( __prev ) ));
}
impl Clone for _pthread_cleanup_buffer {
    fn clone(&self) -> Self { *self }
}
pub const PTHREAD_CANCEL_ENABLE: _bindgen_ty_16 =
    _bindgen_ty_16::PTHREAD_CANCEL_ENABLE;
pub const PTHREAD_CANCEL_DISABLE: _bindgen_ty_16 =
    _bindgen_ty_16::PTHREAD_CANCEL_DISABLE;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_16 {
    PTHREAD_CANCEL_ENABLE = 0,
    PTHREAD_CANCEL_DISABLE = 1,
}
pub const PTHREAD_CANCEL_DEFERRED: _bindgen_ty_17 =
    _bindgen_ty_17::PTHREAD_CANCEL_DEFERRED;
pub const PTHREAD_CANCEL_ASYNCHRONOUS: _bindgen_ty_17 =
    _bindgen_ty_17::PTHREAD_CANCEL_ASYNCHRONOUS;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_17 {
    PTHREAD_CANCEL_DEFERRED = 0,
    PTHREAD_CANCEL_ASYNCHRONOUS = 1,
}
extern "C" {
    pub fn pthread_create(__newthread: *mut pthread_t,
                          __attr: *const pthread_attr_t,
                          __start_routine:
                              ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                             *mut ::std::os::raw::c_void)
                                                        ->
                                                            *mut ::std::os::raw::c_void>,
                          __arg: *mut ::std::os::raw::c_void)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_exit(__retval: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn pthread_join(__th: pthread_t,
                        __thread_return: *mut *mut ::std::os::raw::c_void)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_detach(__th: pthread_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_self() -> pthread_t;
}
extern "C" {
    pub fn pthread_equal(__thread1: pthread_t, __thread2: pthread_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_init(__attr: *mut pthread_attr_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_destroy(__attr: *mut pthread_attr_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_getdetachstate(__attr: *const pthread_attr_t,
                                       __detachstate:
                                           *mut ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_setdetachstate(__attr: *mut pthread_attr_t,
                                       __detachstate: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_getguardsize(__attr: *const pthread_attr_t,
                                     __guardsize: *mut usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_setguardsize(__attr: *mut pthread_attr_t,
                                     __guardsize: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_getschedparam(__attr: *const pthread_attr_t,
                                      __param: *mut sched_param)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_setschedparam(__attr: *mut pthread_attr_t,
                                      __param: *const sched_param)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_getschedpolicy(__attr: *const pthread_attr_t,
                                       __policy: *mut ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_setschedpolicy(__attr: *mut pthread_attr_t,
                                       __policy: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_getinheritsched(__attr: *const pthread_attr_t,
                                        __inherit: *mut ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_setinheritsched(__attr: *mut pthread_attr_t,
                                        __inherit: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_getscope(__attr: *const pthread_attr_t,
                                 __scope: *mut ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_setscope(__attr: *mut pthread_attr_t,
                                 __scope: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_getstackaddr(__attr: *const pthread_attr_t,
                                     __stackaddr:
                                         *mut *mut ::std::os::raw::c_void)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_setstackaddr(__attr: *mut pthread_attr_t,
                                     __stackaddr: *mut ::std::os::raw::c_void)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_getstacksize(__attr: *const pthread_attr_t,
                                     __stacksize: *mut usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_setstacksize(__attr: *mut pthread_attr_t,
                                     __stacksize: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_getstack(__attr: *const pthread_attr_t,
                                 __stackaddr:
                                     *mut *mut ::std::os::raw::c_void,
                                 __stacksize: *mut usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_setstack(__attr: *mut pthread_attr_t,
                                 __stackaddr: *mut ::std::os::raw::c_void,
                                 __stacksize: usize) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_setschedparam(__target_thread: pthread_t,
                                 __policy: ::std::os::raw::c_int,
                                 __param: *const sched_param)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_getschedparam(__target_thread: pthread_t,
                                 __policy: *mut ::std::os::raw::c_int,
                                 __param: *mut sched_param)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_setschedprio(__target_thread: pthread_t,
                                __prio: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_once(__once_control: *mut pthread_once_t,
                        __init_routine:
                            ::std::option::Option<unsafe extern "C" fn()>)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_setcancelstate(__state: ::std::os::raw::c_int,
                                  __oldstate: *mut ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
